{"question_content": "Can there be more than a variety of the disease Alzheimer's disease?", "question_id": "811479"},
{"question_content": "Is alzheimer's disease inherited?", "question_id": "12609"},
{"question_content": "What are the warning signs of alzheimer's disease?", "question_id": "702805"},
{"question_content": "Can sleep apnea cause psychological problems?", "question_id": "38271"},
{"question_content": "My grandmother has vascular dementia does anybody know what behavioral difference is between this and alzheimers?", "question_id": "248874"},
{"question_content": "How are head injuries a cause of alzheimers?", "question_id": "743534"},
{"question_content": "Had overnight oxygen test done it was 83% can sleep apena cause this? I have an asd and Asa also\nCan it be heart related?Can liver disease cause this?", "question_id": "6718123"},
{"question_content": "Should I get a genetic test if breast cancer runs in my family in aunts and cousins?", "question_id": "188315"},
{"question_content": "Is it a good idea to obtain a genetic test using 23andme? It would be good to know what major diseases, such as breast cancer, I am vulnerable to.", "question_id": "120701"},
{"question_content": "My mom has dementia. She is on celexa, aricept, namenda and risperdal. She takes low to normal doses. She has gained 70 lbs in 18 months and feels tired all the time. Is it expected? Suggestions?", "question_id": "950225"},
{"question_content": "What are normal breathing sounds for 92 yo? All night long has gasps, lapses, loud breaths, not typical snoring. Never noisy before. Sleep apnea?", "question_id": "319950"},
{"question_content": "Who should I talk to if I am worried that my parent has alzheimer's disease?", "question_id": "12623"},
{"question_content": "Should someone stop Aricept and nemenda if they can still walk but not talk? No side effects, but could it contribute to mobility?", "question_id": "76735"},
{"question_content": "Fall asleep fine but wake after 3hr every night & cannot go back to sleep. Only way go back to sleep is a sleeping pill or zolpidem. I'm diabetic and use a cpap. Ideas bout cause or a solution plz?Thx", "question_id": "1240179"},
{"question_content": "21 m old boy, 2 ear infections, high fever, bad cough, runny nose, congestion, irritability, sore throat. Loss of appetite on amoxil for 3 d no change?", "question_id": "504579"},
{"question_content": "With hypertension and coronary artery disease plus diabetes is it safe to consume an energy drink?  I have no energy.", "question_id": "1229034"},
{"question_content": "I have a sore throat, sinus pressure and headache, nasal congestion, sore teeth, no fever, fatigue, and sore neck.  What is going on?", "question_id": "330605"},
{"question_content": "If you had breast cancer and took chemo can you tan in a tanning bed without harming yourself?", "question_id": "53778"},
{"question_content": "Is lithium an effective treatment for bipolar disorder?", "question_id": "247633"},
{"question_content": "Are there any treatments for breast cancer besides surgery, chemo, and radiation?", "question_id": "39200"},
{"question_content": "What is the treatment for bipolar disorder?", "question_id": "1111838"},
{"question_content": "When i make a bowel movement it takes 2 hours stool is soft not constipated have hemorrhoids anal fissures how will doc fix bowel movement?", "question_id": "1506138"},
{"question_content": "Lip biopsy- seronegative sjogren's. What's diff in + & -?  See dr 11/25. Any suggestions or where to find info? Very sick year. Had 2 ivig's for my ms", "question_id": "1042877"},
{"question_content": "I had a negative blood pregnancy test after missing my period after an iui. Is it possible for me to be pregnant but be too early to detect because it has only been 2 weeks since ovulation?", "question_id": "564950"},
{"question_content": "My period is 5 days late (day 42). I have headaches, cramps, pink spotting and faint bfp that turned always bfn. Bbt chart is crazy, tending to low. Could i be pregnant?", "question_id": "843662"},
{"question_content": "Unprotected sex no sperm all pregancy negative test and blood test. my period is light and short every 28 days,am I pregnant ? Didn't miss period", "question_id": "1413103"},
{"question_content": "Heavy breasts and abdomen, nauseus, more pregnant symptoms, neg hpt, late period? What's wrong?", "question_id": "647377"},
{"question_content": "Darkened nipples, light tingly(gas maybe?)like cramps, nausea, food cravings, dizziness, nosebleeds, & sore breasts PMS or pregnancy?Also light bleeding", "question_id": "817656"},
{"question_content": "Can you get pregnant 3 days before your period and bleed for only 2 days and spot for 3 days could i be pregnant?", "question_id": "1551954"},
{"question_content": "Do you thing the radiation i got from head CT scan 3 years ago gave me a brain tumor-im asking because im having a brain tumor symptoms now im worry?", "question_id": "1010147"},
{"question_content": "I did not get my periods for two months. I have enlarged and sore breasts, bloated abdomen, pain in upper back, lower abdominal cramping and inner thigh pain. My bloodtest was negative. What should I do?", "question_id": "945177"},
{"question_content": "I ended my Depo-Provera shot early jan. And still no period.Right lowerside abdmoinal pain nausea stomach pain.?", "question_id": "1218724"},
{"question_content": "How long can a person live with a brain tumor before it causes symptoms?", "question_id": "103348"},
{"question_content": "Does is right that stress can cause gbm brain tumor im in high stress and anxiety from 3 years constant now I have symptoms im worry ?", "question_id": "867402"},
{"question_content": "23 yo no history of high BP or familial cardiovascular problems. Sharp headache on side of head upon ingesting caffeine. Aneurysm or brain tumor?", "question_id": "288923"},
{"question_content": "Had unprotected sex last day of period. I'm 1 week late with nausea,sore nipples and minor cramps. COULD I pregnant?", "question_id": "1434306"},
{"question_content": "I have missed my periods for two months. My LMP was on may 3rd and i had sex on may 25th. I did a test on june 13thbut it came negative. I have bloating, nausea, increase in appetite, dizziness, headaches, insomnia and fatigue.Can i be pregnant?", "question_id": "867851"},
{"question_content": "For 3 weeks, I have had constipation, bloating, gas, distended abdomen, nausea, headache, extreme fatgue, dizziness. Tested & not pregnant.  Advice?", "question_id": "530164"},
{"question_content": "Very often I have bloody diarrhea with blood clots. I was diagnosed with ibs. Is this  normal or maybe, there's something  else?", "question_id": "559830"},
{"question_content": "Unprotected sex then started spotting two days later for a day, twelve days later start bleeding similar to my period. Pregnancy or menestral?", "question_id": "1450947"},
{"question_content": "I had mid cycle bleeding/spotting last month. My period is  3 days late, is because of the mid cycle bleeding? I have uterine fibroids. Could i b pg?", "question_id": "1531978"},
{"question_content": "Menstrual cycle (period) 5 days late,  should I take a pregnancy test?  Nausea vomiting headaches backaches frequent urination wake up thirsty, hungry", "question_id": "1236476"},
{"question_content": "My 9 year old daughter has nausea, a headache and a sore throat but no fever or diarrhea or vomiting. What can she have??", "question_id": "1517055"},
{"question_content": "Ate plane food (chicken+spinach+potato) now me and brother have diarrhea, he is vomiting too,  has continued for 5 days  now i have blood in stool.", "question_id": "1458242"},
{"question_content": "Luq pain, colonoscopy, blood work, stool cultures normal. Abdomen not tender. Colicky pain - feels like cramp you get after eating and exercising right away. New depressed.25 y/o f. Pancreatic cancer?", "question_id": "1044158"},
{"question_content": "Postmenopausal 46 yrs. & told i'm severely anemic more than a yr. 2010 colonoscopy= polyp in stomach & colon.  What are the chances that I have colon cancer?", "question_id": "864360"},
{"question_content": "I have nausea all day and light dizzy and  very light cramps I had sex unprotected but he pull out before he finish sometime no late period?", "question_id": "1533139"},
{"question_content": "Migraines nausea fatigue diarrhea sharp stomach pains inner trembling loss of appetite. Began 5dys ago after vertigo in shower/vomiting. Period in 2wk?", "question_id": "1443822"},
{"question_content": "Help! my vagina itches, burns but no discharge?", "question_id": "105095"},
{"question_content": "Abdominal MRI found a \"fluid filled gallbladder with no gallstones\" & a 1 CM cyst in liver-can it b cause of nausea, diarrhea, rt side pain for 3+ mos?", "question_id": "896864"},
{"question_content": "White with sometimes greenish cloth like discharge.Terrible itching around anal and vagina, peeling skin and rash on vagina area. Kinda odor not bad??", "question_id": "6716885"},
{"question_content": "I had sex with my boyfriend we used protection and my vagina itches inside. He also used his fingers on me. Could I be allergic to the condom or what?", "question_id": "6721474"},
{"question_content": "Bad headaches for 2 weeks on and off, nausea, dizziness (not vertigo), fatigue, increased heart rate (at times). Blood tests normal. Not pregnant.", "question_id": "940971"},
{"question_content": "Is sore swollen nipples and breasts, nausea, and upper back pain a sign of pregnancy?", "question_id": "1226544"},
{"question_content": "I feel short of breath a lot but my doctor says my chest X-ray is clear. does this mean that my lungs are ok?", "question_id": "8713"},
{"question_content": "Sticky vaginal discharge that makes itching around the vaginal area.swab test normal no infections no yeast.pelvic test normal.plz help its annoying?", "question_id": "1433382"},
{"question_content": "Been having pressure n my face between my nose & eyes runny nose, cough, lightheaded when blowing my nose it's kinda green alil? No fever no aches!", "question_id": "1160849"},
{"question_content": "8 month old has one chest X-ray in the ER because of high fever. His lungs were clear. Is he now at risk for cancer?", "question_id": "642100"},
{"question_content": "I've noticed a stronger vaginal odor lately. Could it be a yeast infection or VB without itching or discharge?", "question_id": "1420783"},
{"question_content": "Small cell lung cancer. How long was it there when you can see it on x-ray?", "question_id": "100171"},
{"question_content": "Vaginal itching and burning after having a lot of sex. What is causing it? Could it be a yeast infection? How do i treat it?", "question_id": "1436740"},
{"question_content": "Can a chest X-ray or echo detect lung cancer?", "question_id": "501848"},
{"question_content": "24 year old. Gym goer. Smoke 1-3 cig/day. Feeling pain near right scapula back side only when I cough sneeze stretch or wake up in morning. Lung cancer/pancoast.?", "question_id": "1178903"},
{"question_content": "Had a clear chest xray in December and that's all 2 different doctors would do, scared that I have lung cancer but no cough. Is it likely?", "question_id": "1435393"},
{"question_content": "What's the relationship between interstitial lung disease and pulmonary fibrosis?", "question_id": "37080"},
{"question_content": "I have a very small nodule on the apex of my lung found on chest X-ray my doctor saidit may be scar tissue or a blocked bone shadow, it is on the apex and I am 70 years old, is it cancer?", "question_id": "1235864"},
{"question_content": "If I have cystic fibrosis and get a lung transplant, will the disease eventually invade my new lungs?", "question_id": "39498"},
{"question_content": "I got a scar tissue in lung after radiation therapy for breast cancer. No one told me it could happen. What should I do?", "question_id": "304461"},
{"question_content": "I'm a factory worker and my job requires me to stand for 8 hrs and sometimes carry heavy things I have breast cancer stage 3 but i 've already done with my chemotheraphy  and radiation last  feb of this year but still have 4 sessions of herceptin. Can i g", "question_id": "506298"},
{"question_content": "Waking up gasping for air when i'm falling asleep. Occasional localized pain in sternum. Healthy ECG 2 yr ago,  good bp, doc says heart & lungs sound good. Do i still need to worry about heart failure?", "question_id": "637342"},
{"question_content": "How to boost white blood counts during chemotherapy for breast cancer?", "question_id": "91297"},
{"question_content": "25 year old 9 year smoker quit 2 mnths ago, wake up tasting blood, spit blood, 3 e.r. visits, no xrays,lungs sound clear, lung cancer? gums bleed easy", "question_id": "1550390"},
{"question_content": "Is there a less toxic alternative to chemotherapy for breast cancer treatment?", "question_id": "25227"},
{"question_content": "20 weeks pregnant with BV and yeast infection. Being treated with Flagyl and Monistat 7.  Suppose to have transvaginal ultrasound for cervical length. Should I reschedule or is it transvaginal safe?", "question_id": "1373750"},
{"question_content": "Could my immune system still be compromised 2 years after chemo and radiation for stage 1 breast cancer?  I seem to get sick a lot now.", "question_id": "568790"},
{"question_content": "Burning irritation, itchy, mild fishy vaginal odor with very little clear discharge...Could it be a yeast infection or BV or what? What OTC meds work?", "question_id": "130762"},
{"question_content": "I am a 55 year old, post menopausal woman. My ER and pr are positive and her2 is negative. I have been diagnosed with stage t1n0m0 breast cancer, my tumor being 1.2 CM big. Can chemo be avoided?", "question_id": "303536"},
{"question_content": "I found out during a CT heart angio in may that I have a 4 mm calcified nodule, possibly on my intrapulmonary lymph gland. I am worried that it's lung cancer. I did not do a follow up. What should I do?", "question_id": "919657"},
{"question_content": "Does calcification in thyroid nodules mean that you have cancer?", "question_id": "18558"},
{"question_content": "I stopped the Depo-Provera shot last year in September. I still no period . My doctor gave me a pill to start it and it's been 4 weeks and still nothing.", "question_id": "1533093"},
{"question_content": "Fluctuating lipase numbers, negative mrcp, ercp, CT scan. Numbers mainly normal but sometimes elevated for no reason. Lung cancer?", "question_id": "1227939"},
{"question_content": "I had a sudden fever, body aches, runny nose, sore, throat, and cough yesterday. Is this a cold or the flu. Two weeks ago I had strep throat. ?", "question_id": "6789935"},
{"question_content": "Everyday off and on for a couple of months I have a tightness in my head, dull headache (temple pain and behind eyes), and neck pain tender to touch.?", "question_id": "264072"},
{"question_content": "Have excruciating pain on my sciatica radiating to my hip then down to right above my knee on the back side of leg. Do have psoriatic arthritis.", "question_id": "1549801"},
{"question_content": "What causes recurrent chemical pregnancies? I have had three now. The ER found fibroids. My fertility specialist found nothing but a healthy uterus.", "question_id": "546980"},
{"question_content": "My big toe hurts a lot but it is not brusied or swollen but it hurts to walk on and sometimes bend what should I do?", "question_id": "1251482"},
{"question_content": "I have repeated painful swollen joints I have been told it is gout I have had the joint fluid analyzed 4 times and there have never been any crystals negative rheumatoid panel it affects fingers wrist foot ankle heel knee usually one at a time occasionall", "question_id": "258994"},
{"question_content": "2 years ago i was diagnosis with transverse myelitis. Again i had another lesion on my spine close to the first one past and present brain MRI was clear should I be doing a spinal tap. Could it still be ms?", "question_id": "944413"},
{"question_content": "How is a diagnosis of MS supported by an MRI of the brain and the spine?", "question_id": "22736"},
{"question_content": "Having left leg pain in back of knee, thigh and bottom of foot. Ultrasound and D Dimer normal but it's getting worse. Should I go to ER?", "question_id": "1406192"},
{"question_content": "What is juvenile rheumatoid arthritis?", "question_id": "9580"},
{"question_content": "Pinching feeling right where my calf and ankle meet in the back of my lower leg?  Sometimes foot cramps as well, pain in knee and thigh.", "question_id": "489802"},
{"question_content": "I fell onto bent knee. Now I get a HORRIFIC pain if I kneel, below patella, on the part thats on floor. I basically can't kneel. My walk is okay, there is no fracture and patella is okay. Whatshould I do?", "question_id": "960508"},
{"question_content": "What can be done if a knee MRI comes back negative but the patient is still having problems? Can a MRI miss a medial meniscus tear? Please explain", "question_id": "694732"},
{"question_content": "I had a knee scope to fix a torn meniscus in february. I still had pain 6 months later so i had another MRI which showed another tear on the other sid?", "question_id": "355238"},
{"question_content": "I don't play any sports im having a pain that starts by my ankle bone up the side of my leg into my knee, I have difficulty walking what could it be?", "question_id": "1225760"},
{"question_content": "Is there any laser treatment for acne scars?", "question_id": "93856"},
{"question_content": "If my ligament is completely torn in my ankle when should I walk in it?", "question_id": "943034"},
{"question_content": "I have an ache in my calf and pain in my ankle. Could this be dvt? There is no swelling or redness.", "question_id": "48955"},
{"question_content": "3 week since rt tkr. Not bending well --52 degree. 2 patella dislocation and lateral releases failed 10 month prior. When will manipulation be done?", "question_id": "794696"},
{"question_content": "My 67 years old mom has onfh (osteonecrosis of the femeral head) on both hip joints, what's success rate on surgery to replace total hip in her age?", "question_id": "986476"},
{"question_content": "Does a meniscus tear cause  a knee to click at the joint line? I have a hard time bending and extending my knee because it get stuck  please help", "question_id": "598377"},
{"question_content": "I have intense pain in the back side of my right leg, just above back of my knee when sitting or driving. Its a very localized area and does not radiate.  I am in good shape, jog, walk alot.   Might I have pulled something?  Read up on sciatica, doesn't s", "question_id": "392443"},
{"question_content": "Should i get crutches i sprained my ankle i can walk as long as i don't bend it at all it hurts even like that its badly bruised and swollen what todo?", "question_id": "800071"},
{"question_content": "Have pain in the back of my knee, no swelling redness or warmth, haven't injured it; could it a blood clot or dvt?", "question_id": "1028792"},
{"question_content": "Anxiety! I have inner thigh pain only upon pushing the area. There is no swelling or redness and feels a little lumpy inthe sore area. I have spider veins on the left side of knee. Could it be a clot?", "question_id": "357528"},
{"question_content": "My 11-year-old son is having hip pain and trouble with walking and lifting his left leg. We saw a doctor and gotx-rays. It was reported he has bilateral capital femoral epiphysis. What should I do?", "question_id": "519219"},
{"question_content": "I am recovering from a DVT in the calf area and was wondering if a tubular bandage or the like would help to control the swelling behind my knee?", "question_id": "608440"},
{"question_content": "Nrv probs in foot 4 years.Did lots of swimming.Hurts where leg meets foot/swollen in 4 places around ankle.Can hardly walk.Foot feels heavy/have to keep flat. I don't recall an injury.So much pain. ?", "question_id": "945107"},
{"question_content": "If  i had a l5-s1 discectomy in 2009  , could it cause swollen feet and inflamed  in between toes and ankles, can hardly walk short , a lot of back pain?", "question_id": "328926"},
{"question_content": "Is swimming good for teens who have osgood schlatter disease and tendonitis in his or her knees?", "question_id": "28155"},
{"question_content": "Osgood schlatter both knees.  Rice, less running, ion patches has limited affect on pain when running. Dry needling was recommended ? Suggestions?", "question_id": "987088"},
{"question_content": "I twisted my right knee and ankle on 7/26/12. I had an MRI on 4/29/13, after the birth of my son. The MRI showed an injury to meniscus. Why is the pain worsening after physicaltherapy? What should I do next?", "question_id": "773435"},
{"question_content": "Is a d-dimer enough to rule out a DVT or pulmonary embolism.  suffering from chest pain,shortness of bteath, n burning n swelling in legs n back?", "question_id": "1332824"},
{"question_content": "I have mild pain/discomfort on my left knee after wieght traning for my legs yesterday. How long should I rest? When should I apply ice/heat?", "question_id": "1122777"},
{"question_content": "What test(s) do doctors run to rule out pulmonary embolism in a pregnant woman? 20 gs wks, no leg pain, shortness of breath, cough and chest pain for 4 days after long distance traveling.", "question_id": "6627500"},
{"question_content": "With a potential ankle fracture should  you keep the shoe on until ems arrives. It appeared fx since she was c/o numbness in toes.", "question_id": "574382"},
{"question_content": "I have constant pain and weakness in my foot and part of my ankle is sunken in. Help! I have been under the care of a podiatrist for 2 years. I have had 20+ sprains and strains since i was 10. I am 26 now. I had a hairline fracture 2 years ago and receive", "question_id": "395272"},
{"question_content": "If I have a hairline fracture below my big toe will I need a cast that comes up to my ankle or a cast that comes up to my knee or will I need one at all?", "question_id": "284160"},
{"question_content": "What are the warning signs of a pulmonary embolism (pe or blood clot in the lung)?", "question_id": "8729"},
{"question_content": "Should I have surgery to remove the bone chip/chunk from my foot? 3 years ago i was playing ultimate frisbee, i jumped up and landed wrong and broke a bone in my right foot/ankle.  At the time i thought i just sprained something, so i didn’t see a doctor.", "question_id": "382129"},
{"question_content": "A few months back I fraxctured my ankle and my foot. I was told at my last appointment in aug to wear a brace for a month then I can bare wieght in it. I still cant bare weight and my ankle bone that I fracture looks out place what should I do?", "question_id": "1494383"},
{"question_content": "I hurt my foot I have constant pain in my foot I can't walk on it and have pins and needles in my toes there is no swelling ?", "question_id": "1330085"},
{"question_content": "My son had micro fracture surgery on hos left ankle, he plays pro basketball, he now complains of some pain and a burning sensation running up  ankle\r\n?", "question_id": "303460"},
{"question_content": "Migraine left side of head and face numb and tingly left arm and leg. Migraine gone. Next day back, just temple on right side. Tugging feeling left heel, burning spot back of lower leg. Gone in a min.", "question_id": "1401226"},
{"question_content": "I sprained my ankle/foot 3 weeks ago and i still get bad swelling, bruising and pain. What should I do?", "question_id": "340369"},
{"question_content": "I have ligament damage due to an untreated ankle fracture the bones have healed, will the ligaments heal or do I need surgery?", "question_id": "239493"},
{"question_content": "Had abdominal pain, nausea, occasional vomitting for three months. Normal scans, endoscopy and colonoscopy except mild antral gastritis. Any ideas?", "question_id": "1426877"},
{"question_content": "Broken & dislocated ankle & torn ligaments. Had surgery, no weight for 8 wks. On wk 7. Taking norco 5mg/325 2-3x daily. Normal? How long can I take?", "question_id": "664505"},
{"question_content": "Should i request a pet scan? For the past seven months I have had a sharp, aching pain in my shin right on the bone near my knee that has progressively gotten worse.", "question_id": "603986"},
{"question_content": "My ankle is a little swollen. It gets stuck and I have to force it, so it pops. It's been going on like this for years and it can hurt up to my knee. What should I do?", "question_id": "486692"},
{"question_content": "Had red rash all over body.4 days i'm on 3 different anitihistamin.Now joint stiffness, swelling feet, ankles, hands, wrist.What could this be?", "question_id": "811042"},
{"question_content": "Weird feeling in back of knee almost like hitting funny bone..tingling also. Radiates down to foot with pain in foot and sometimes calf also. What could this be? no swelling", "question_id": "6699115"},
{"question_content": "Is AST of 37 and ALT of 49 in blood something to be concerned about? They are listed as high according to lab and I've been exhibiting fatigue.", "question_id": "1199456"},
{"question_content": "I have a nondisplaced fibula shaft fracture. What now?", "question_id": "197486"},
{"question_content": "Would an MRI of the brain rule out alzheimer's or brain damage? Or ms? I'm 19, male, been battling horrible symptoms for years, about to end it all", "question_id": "1048004"},
{"question_content": "How does someone get rid of joint effusion in the knee?  If someone has a knee effusion is a MRI accurate?  Please explain i don't know what to do?", "question_id": "720398"},
{"question_content": "Can an ultrasound show a tumor of muscle? I have had major back, neck pain and pain in both legs also in right breast. I have found a large knot in my back on left side below shoulder blade at times I have felt short of breath. I had an ultrasound today t", "question_id": "390449"},
{"question_content": "Hve pain in shoulder/neck/jaw and arm & down in right breast!. Hve bad tennis elbow! do repetitive work with right side! feels like muscle pain pector?", "question_id": "650397"},
{"question_content": "25f have back pain most days and now my arms/hand/fingers are hurting/tingling/numb, headaches too!", "question_id": "557272"},
{"question_content": "Could I have ms? I have  severe depression, constantly tired,  lack of libido and a tingling sensation in my hands and feet.", "question_id": "653630"},
{"question_content": "I've read that MS used to be checked (at least partially) with the \"hot tub test.\" I've noticed my symptoms (dizziness, balance issues, numbness/tingling extremities) actually seem BETTER when I'm in a hot bath/shower. Mean anything or coincidence?", "question_id": "6765899"},
{"question_content": "Scaroilitis or sciatica? What's  difference? Had an X-ray & dr says it's sacroilitis, but i feel pain in my back, hips & it runs to knee, is it both?", "question_id": "644631"},
{"question_content": "Fever, asthma history, & slight shortness of breath. Just more asthma, or maybe pneumonia?", "question_id": "103119"},
{"question_content": "I have the following symptoms for past 5 days now (sneezing, headache, stuffy nose, itchy eyes, sore throat. I'm thinking it's allergies, i've been using reactive but doesn't seem to do the job.. Any suggestions?", "question_id": "203975"},
{"question_content": "I take fenofibrate lipid regulating agent,thus it trigger allergy.eg.sneezing watery nose,redness of both eyes,itchiness of tongue with preckles ontop?", "question_id": "1380387"},
{"question_content": "Hello, my mom has bad swelling at bone joint by base of thumb of side of wrist above thumb.  Also bad swelling & pain of middle finger.  Is this osteo?", "question_id": "762714"},
{"question_content": "Sneezing, itchy+runny nose even can't breath.Lung function test abnormal, not asthma.Blood oxygen 100.Doctor suspects hyperventilation.Caused by allergy?", "question_id": "1060629"},
{"question_content": "Stung between thumb and fore finger. Swelling is excessive. Running nearly to elbow. Cannot move wrist or any fingers. How long before dangerous  bee?", "question_id": "945647"},
{"question_content": "My thumb joint is very painful and swollen.  Severe pain grasping or moving thumb towards small finger.  Some pain 1 month, severe pain 3 days.", "question_id": "6729784"},
{"question_content": "Hello,\r\n\r\nI'm 23 years old and suffer from anemia/heavy blood loss. Does green tea have anything to do with heavy blood loss during periods?", "question_id": "1406948"},
{"question_content": "I do have history of vertigo and low blood pressure.  Is it normal that my head gets dizzy for a few second once I get up from a sitting position? Mostly when I m kneeling on the floor. Also, when I lie down flat on bed...my head can feel a bit dizzy. But", "question_id": "1554067"},
{"question_content": "4 year old child has a bad sore throat and he is talking funny (like in strep). He has ha, stomachache, and his mouth and legs hurt. He also has low grade fever, runny nose and is sneezing. Does it sound like he might have strep?", "question_id": "951483"},
{"question_content": "Streak of bright red blood on stool.  Some pain after bowel movement.  What could cause this? Worried about cancer.", "question_id": "1473496"},
{"question_content": "Is gamma knife surgery an option for a brain tumor?", "question_id": "123886"},
{"question_content": "Choroidal melanoma (1994). No issues since treatment til now.  U/s shows 2 spots liver (8.2cm/2.1cm), waiting on mri. If cancer would this likely be considered metastasized from original cancer?", "question_id": "948869"},
{"question_content": "Mom going for chemotherapy(gemcitabine) for gallbladder cancer 4th stage with severe lung mets, she is with home oxygen, does chemo worthful?", "question_id": "993310"},
{"question_content": "Liver cancer stage 4 , lung cancer and spleen cancer with cirrhosis and hep c  can I take chemotherapy treatment to reduce tumor maker?", "question_id": "820591"},
{"question_content": "After last summer few of my bithmarks have changed shapes/size a bit. How big difference shall be to suspect skin cancer or to contact a doctor?", "question_id": "600698"},
{"question_content": "Can radiation therapy help to treat colon cancer that's spread to the liver or kidneys?", "question_id": "39246"},
{"question_content": "Is it possible to get cervical cancer from anything other than hpv?", "question_id": "112477"},
{"question_content": "How do you \"catch\" the types of cervical cancer? Is it always by sex with an HPV carrier?", "question_id": "189385"},
{"question_content": "My father was diagnosed with thyroid cancer at 46. I am 27, but asked for a thyroid ultrasound as a precaution. The us revealed one 4x6x6mm solid nodule. Should i be worried? Does this merit biopsy?", "question_id": "675757"},
{"question_content": "An ultrasound of thyroid reported a 6 mm nodule but a rescan one month later reported nothing. The doctor saidthat the radiologist over read the first scan. Its been 8 monthssince. Is a follow up needed?", "question_id": "945572"},
{"question_content": "I've been sick for 14 yrs. Is it lupus? Fatigue, weightloss, anaemia, rash on face, atrial fibrilation, decayed teeth, hair loss, fever, rundown.", "question_id": "820918"},
{"question_content": "Diagnosed grossly hypothyroid /hashimoto, feeling worse as weeks go by, ultrasound scan reads thyroid demonstrates a heterogenous nodular echo texture?", "question_id": "1260908"},
{"question_content": "Two nodules, 1.9 and 1.8 CM on left thyroid lobe. 1st nodule is benign follicular. 2nd is abundant benign appearing follicular epithelial cells, hemosiderin-laden macrophages & colloid noted. Cancer?", "question_id": "949952"},
{"question_content": "For the past few days I had green stools. Today saw tiny spots of blood on tissue. Little abdominal pain. On protonix 40 mg 2 x daily. Is this normal?", "question_id": "1366387"},
{"question_content": "Do I have a ear infection? Itchy ears, popping ears from blowing my nose too much.  I also have a runny/stuffy nose (itchy nose). What can it be? No other symptoms.", "question_id": "6683424"},
{"question_content": "I have broad osteophyte complex w/ moderate foraminal stenosis in C6/7.  Neck pain, esp. left shoulder & arm.  Is a bone spur pressing on nerve root?", "question_id": "1425838"},
{"question_content": "Constant r arm/shoulder pain, tingliing, hand swells & turns cold × 5yrs. Mri: c5-c6 & c6-c7 disk ostephyte complex, disk protrusion with annular tear, central canal stenosis. Could this be the cause?", "question_id": "970950"},
{"question_content": "If I had a thyroid scan that read: left lobe of gland is  mildly enlarged at 5.8cm x 1.7 x 2.2 .  There is a avascular 3 mm hypoechoic nodule in the lower pole of the left lobe. How would I know if it was \" hot or cold\"?", "question_id": "261514"},
{"question_content": "Arm bone pain, muscle weakness, arthritis in right shoulder.No ra, or others. What else could this be?", "question_id": "136327"},
{"question_content": "Tsh level 5.58, no symptoms, u/s found 1cm subtle hypoechoic nodule w/increased peripheral vascularity.  Pcp ordered rai uptake scan before fna.  Why?", "question_id": "1293657"},
{"question_content": "neuro diagnosis MS on 7/21/14. My rheumatologist thinks i also have sarcoidosis or lupus. I had lesions biopsies today but all my blood work is neg. possible", "question_id": "1423325"},
{"question_content": "These are a few of my symptoms for the last 3 months, body rash including itchy skin, tachycardia, afib, flushed hot feeling running through blood, muscle aches, diarrhea and tenderness below breast bone. What could it be?", "question_id": "540466"},
{"question_content": "Thyroid sono results:\"heterogeneous gland suggesting multinodular goiter -no discrete dominant masses observed\"-what does this mean?", "question_id": "589151"},
{"question_content": "My son may have ringworm of the scalp. His skin is flaking - and a sore on his scalp.  It's itchy and he has a stomach ache, headache and sore throat?", "question_id": "1555739"},
{"question_content": "Test results are multinodular goiter so radionuclide thyroid scan?", "question_id": "212044"},
{"question_content": "Cervical disk herniation c4-c5 c5-c6 c6-c7?", "question_id": "641347"},
{"question_content": "I am patient 0f asthma, diabetese, hypertention, high cholestrol, reoccurent nassal polyp, anxiety, depression, brain anyerism, and un diagnosed fever from last 3 months what can be cause of fever, trreatment?", "question_id": "791397"},
{"question_content": "Can multiple surgeries under general anesthesia for radiofrequency on c2, c3, c4, c5, c6, bilateral affect my kidneyfunction? Recent blood high bun/crtn.", "question_id": "572563"},
{"question_content": "I have had a sore throat for a long time, but i also have quite bad hay fever, could my allergies be a cause of my sore throat ?", "question_id": "612712"},
{"question_content": "My MRI report is right paracentral herniation of c5-c6 IV disc indenting spinal cord...Doctor said to me it is necessary operation is it right?", "question_id": "652842"},
{"question_content": "What is the risk of having severe cervical spinal stenosis myelopathy? There is almost no CSF around T3/T4&6 due to narrowing from the disks and steno", "question_id": "1452850"},
{"question_content": "Unexplained  bruising all over body, fatigue,  wieghtloss, headaches, loss of appitite, body aches, mild dizziness, weak legs.What going on with me?", "question_id": "1475068"},
{"question_content": "Herniated cervical disc c5-c6 touch nerves. After 5 months physio, no more tingling sensation on arm. Still neck pain often. What else can be done?", "question_id": "627520"},
{"question_content": "Symptoms: unilateral enlarged tonsil (left side), swollen lymph node, throat and ear pain all on left side, extreme fatigue, weight loss for 2 months.", "question_id": "1381513"},
{"question_content": "Itchy pink blotches on scalp for 3 weeks. Dermatologists don't think it's psoriasis & it doesn't really look like psoriasis. Have used steroid cream for 2 weeks but it hasn't changed. What could it be", "question_id": "1292429"},
{"question_content": "I have ddd and herniation at L5 s1 and this along with bulging discs overall the lumbar spine shows on MRI with urinary retention incontinence and fec?", "question_id": "491368"},
{"question_content": "I'm a dental assistant,been having numbness in both hands, now pain, burning and tingling in right hand, mainly middle and ring fingers, no pinky numb?", "question_id": "1578869"},
{"question_content": "Have hashimotos 29 year old.  have very inflamed itchy scalp for 7 mths.seen 2 dermatologists, tried cortisone crm.ANA neg, thyroid levels good. Very depressed. :(?", "question_id": "1232118"},
{"question_content": "I have sudden joint pain, swelling and purple discoloration in my big toe what could this be? The pain came on suddenly and i cannot really walk. I did not injure the toe or foot, I am not diabetic or in poor health. The only health condition I have is hy", "question_id": "400103"},
{"question_content": "Pain and swelling on ball of foot under big toe in diabetic?", "question_id": "627573"},
{"question_content": "Little toe is swollen, red, blue, numb and frozen, itched because the swelling. Joint pain now in other pinky hurts. Mornings and nights  diabetes?", "question_id": "1152215"},
{"question_content": "My diagnosis is: t11-12 tarlov cyst, l3-4 slight diffuse posterior bulge (sdpb), l4-5 desicated cartilege (dc) and sdpb l5-s1 dc, sdpb with superimposed central disc herniation and moderate indentation of vts. What shouldi do?", "question_id": "918145"},
{"question_content": "What percentage of seropositive RA patients with anti-cpp of >250 accompanied by pain/swelling in hands, wrists, tmj, elbows, achilles' tendon  with ESR and CRP wnl? Do you alter the treatment ?", "question_id": "515462"},
{"question_content": "Grade2 Spondylolisthesis of L5/S1. Circumferential disc buldge & minimal narrowing of neural formina. Disc buldge impinges S1. Can this cause hip pain?", "question_id": "1454999"},
{"question_content": "Dual tissue growth between skin and toenail. One month ago, after going for a 3 hour hike, my big toe on my left foot felt very mildly sore and looked slightly swollen around the base of the nail. One week later, a small tissue growth developed. Two weeks", "question_id": "403483"},
{"question_content": "Had stress fracture in foot. Wore boot  1 mo. 4 mo. Later foot still swollen tho doc said bone healed. No pain just noticeable swelling not improving.?", "question_id": "278206"},
{"question_content": "Big toe sore, skin red, squeezed and pus came out side of toe nail. is it a possible ingrown toe nail ? Infection ?", "question_id": "1435568"},
{"question_content": "I have tingling feet my MRI shows L5 -s1 bulging disc with mid atrophy of some muscles around l5-4-3 . My doctor tingling feet. Are because of  and this disc hasn't. Caused it. He gave me nortriptilin is my doctor right? I still have tingling feet and som", "question_id": "253223"},
{"question_content": "Do i need to go to a doctor and get an antibiotic? Lymph nodes are swollen for about two weeks   no fever no redness   pain started in left ear two weeks ago   right side was swollen   about a week ago   the left side started swelling   there is drainage", "question_id": "394369"},
{"question_content": "Three swollen cervical lymph nodes all on left side of neck some ear pain doctor HS seen one of them says wait 2 month fbc normal should I be worried?", "question_id": "551372"},
{"question_content": "Back pain & numbness in foot after MRI report l5-s1: wide based shallow disc herniation eccentric to left. Mild degree facet prominence. Central canal not significantly stenotic. What does this mean?", "question_id": "1010387"},
{"question_content": "Have a bug bite it is now inflammed  red hard and warm to touch. Very  itchy and painful  should I be worried. I have a history of  lupus & cellulitis?", "question_id": "280884"},
{"question_content": "My ferratin is 6, hemoglobin 10.4 and hemocrit 34. Indicates iron deficiency anemia. Cannot take supplements due to ibs. No red meat. Recommendation?", "question_id": "1184735"},
{"question_content": "I've recently broke out in a pimply flesh coloured itchy rash on my forearms back neck thighs and tummy so you have any idea what it could be? Thankyo", "question_id": "6700820"},
{"question_content": "Headaches I hadn't experienced feel like migraines for they come with nausea vomiting dizziness weakness also cold toes cold sweats neck pain clammy?", "question_id": "252815"},
{"question_content": "Swollen lymph nodes in groin armpit and neck allare under a CM in diameter. Also all have been examined by doctor they are very movable.Should i worry?", "question_id": "1113330"},
{"question_content": "Found a small painful enlarged lymph node near my breast/under my armpit. Apart from things like cancer what else could it be?", "question_id": "1425454"},
{"question_content": "Bumps keep popping up in numerous amounts. Started off with 4 and now in a week's time at 30. Mostly on abdomen, thigh, back and side. itchy and red?", "question_id": "6786634"},
{"question_content": "Is it normal for a right temporal lobe tumor the size of a golf ball to cause dizziness and bad headaches?", "question_id": "1286292"},
{"question_content": "I have a light brown/tan  (little bit darker in center), dry, raised, irregular  spot on side of breast. Size of a dime. Recent breast itchy & hot?", "question_id": "6717973"},
{"question_content": "I have had migraine headaches for years. My last 3 headaches have come with facial numbness and dizziness, a new symptom for me. Is this normal or should I be alarmed?", "question_id": "193700"},
{"question_content": "Every morning i wake up with a migraine it seems like.  I have a headache almost 4-5xweek can this be from sleep apnea?", "question_id": "906769"},
{"question_content": "Added 10 mg nortriptyline (nummular headache) to 50 mg trazodone (insomnia) with 60 mg cymbalta (migraine). Felt dizzy, drugged & weak so stopped trazodone. Feel better, but can't sleep. What to do?", "question_id": "691108"},
{"question_content": "I have dizzy spells nausea and sore head on left side?", "question_id": "484577"},
{"question_content": "Severe throbbing pain on right side of head, dizzy, lightheaded, nausea and some vomiting. Symptoms worse on movement ?", "question_id": "1433517"},
{"question_content": "Sudden chest pain that comes & goes but gets severe.Nausea, dizzy, fatigue, sweats, vomiting. Going to dr. Will I  get admitted to hospital?", "question_id": "275378"},
{"question_content": "Been having cramping, headaches, frequent urination, dizziness, lower back pain, and mood changes but i got 2 negative pregnancy tests am i pregnant?", "question_id": "547922"},
{"question_content": "Stomach cramps and diarrhea (with a little blood) 30 min after every meal for 9 days. No other symptoms. Could it be a symptom of colon/bowel cancer?", "question_id": "1473640"},
{"question_content": "Besides ringworm what kind of rash can cause a red circle  with a wart like skin tag on the breast area? It showed up over night", "question_id": "55161"},
{"question_content": "No period for 3months, all pregnant symptoms, but neg blood test. Dr says to get ultrasound for ovarian cyst. Is possible to still be pregnant ?", "question_id": "839407"},
{"question_content": "My breast been feeling itchy \\u0026#40;Nipples\\u0026#41; I've been having the mild cramps I've been takin naps more than offend VERY thirsty 10DPO could I be pregnant?", "question_id": "1433005"},
{"question_content": "I have a hard pea sized lump between my breasts.2 weeks ago pus and blood cum out of it.But its stil here, the same size.Could it be cancerous?", "question_id": "346971"},
{"question_content": "I am 26 years old and was recently diagnosed with a 3.8 CM complex ovarian cyst on my right ovary. 3 days later, in mid july, I believe it ruptured because I had hyperacute pain in my lower right abdomen and I can't even throw enough adjectives at you to", "question_id": "280210"},
{"question_content": "Pain upper left side under rib cage just below left breast. Mammogram, x-ray, CT scan, colonoscopy and urine all fine. Help.", "question_id": "694806"},
{"question_content": "I have leftsided colitis.Tried 6mp, but developed pancreatitis. I am managing with asacol and colocort enema. Still get blood in the stool. Advice?", "question_id": "68649"},
{"question_content": "3 month baby have a little cough, sneezes sometimes & runny nose. Breast & bottle  feed. What should I do?", "question_id": "761921"},
{"question_content": "My dad is 53 years old and in good shape. He was diagnosed with stage 4 secondary liver cancer; the primary is still unknown. He has had a CT scan, an endoscopy, and a colonoscopy done. Will a pet scan show something more?", "question_id": "309716"},
{"question_content": "Why would i develop heartburn after starting ppis?  Had severe allergies/asthma since child, was told (despite allergy testing) that it might be GERD", "question_id": "507378"},
{"question_content": "Swollen lymph node,headache, left eye pain,sore throat,hard to breath especially outside,heart racing,heart racing,joint pain,weight/hair loss,nosleep?", "question_id": "6729795"},
{"question_content": "I have occasional amounts of bright red blood in my stool i had a colonoscopy and a CT scan that revealed nothing says my gp I have pain in lower righ?", "question_id": "852022"},
{"question_content": "Some symptoms of asthma if you don't wheeze but cough when you run or jog?", "question_id": "104299"},
{"question_content": "My right breast saline implant ruptured is it normal for me to have light to severe pain on my left side and my back of my shoulder and on my chest?", "question_id": "576455"},
{"question_content": "Painless throat swelling w/ diff. Swallowing w/hard swollen painless lymph nodes at multiple sites, airway feels obstructed.Other symptoms incl. Dry eyes+pain+photophobia, dry mouth, joint pain. Help?", "question_id": "628686"},
{"question_content": "Had a colonoscopy a year a go, normal apperance, lympcites in biopse, no evidence of uc or chrons. Could I develop these diseases just a year later?", "question_id": "128372"},
{"question_content": "Positive for blood in stool. Dr. Won't do colonoscopy because i'm not a candidate for surgery. (have stage 3b lung cancer & severe copd)  any suggesti?", "question_id": "235781"},
{"question_content": "Got chest and one left breast side got pain? When i breath caught little pain between my keft breath also chest too", "question_id": "1377879"},
{"question_content": "I have dysautonomia and woke up short of breath-i can walk and all just feel like need more air, this happened b4 had spiral ct/xray chest, and heart echos/stress test evthing ok, but how can I help it?", "question_id": "945620"},
{"question_content": "Does ovarian cyst making stop my period for two months?", "question_id": "954052"},
{"question_content": "52years, bulky uterus fibroid at anterior wall of funders, irregular periods, excess bleeding with clots past 20 days, dnc and Pap smear normal. ?", "question_id": "1568847"},
{"question_content": "Hey I'm 18 years old and sexually active...I use no form of birth control at all...normally I just take emergency contraception...I started bleeding two weeks after my period?", "question_id": "6740670"},
{"question_content": "My son is 2mths (14lbs&9oz) suction & saline doesn't help his congestion (no flu/rsv) what can I do to help him, got a humidifier also.No cough/fever?", "question_id": "609421"},
{"question_content": "I haven't had a period in 12 months, and I do have 2 complicated ovarian cysts on a recent ultrasound. Today I woke up with bleeding . Is this normal?", "question_id": "1428024"},
{"question_content": "A friend has intramural uterine fibroids with frequent urination and pelvic discomfort. She is unmarried. Can fibroids be cured with homeopathy or aur?", "question_id": "346188"},
{"question_content": "Should I have a hysterectomy? I have had 6 blood transfusions in 7years. I am 33yrs old with one pregnancy/one child. I have symptomatic uterine fibroids and iron defiency anemia.  My blood levels normally run between 6.9 and 7.3.  The lowest has been 5.8", "question_id": "380593"},
{"question_content": "Does fibroids cause blood to come out after urination? And how can it be treated?", "question_id": "57855"},
{"question_content": "What could cause only the lymph nodes on the left side of my neck to be swollen (2cm) and have a tender feeling especially to touch, that an ultrasound wont show?", "question_id": "834759"},
{"question_content": "\"Galactorrhea\" from both breasts,1 clear,1 milky, upon squeezing only. Prolactin,thyroid, blood tests all \"norm\".Should I get further testing?not preg", "question_id": "1454237"},
{"question_content": "I have pelvic pain, spotting between periods and bloating could it be cysts in ovaries?", "question_id": "1571254"},
{"question_content": "My ALT is 140, AST is 40, and Bilirubin is 0.3. I haven't spoken with my doctor because the results came directly from the lab. What does it mean if you have high ALT, but normal AST? I'm worried.", "question_id": "1378729"},
{"question_content": "ALT 57 U/L; AST 32 U/L; S. Bilirubin (total) 0.60 mg/dl; S. Alkaline  Phosphate 55 U/L; HBs Ag: Negative > do these labs indicate liver inflammation?", "question_id": "1474258"},
{"question_content": "Severe pain from mid spine up thru eye. Stiff and swollen neck.Trembling & spasmatic muscle .Disorientated and severe headache, have cellulitis on face. Temp is only 97.3 tho. Scared, what is wrong?", "question_id": "640919"},
{"question_content": "What could cause a low WBC (2.7), low hgb, low and hct, with differential high mono, and high gran?", "question_id": "49143"},
{"question_content": "I have a sgpt (alt) of 52, sgot (ast) of 27, and my ldh of 268, should I get more tests?", "question_id": "629729"},
{"question_content": "Male,29.Active/healthy weight.Non-Smoker.No Fam hist.Recent norm stress test, holter & echo.Heart is ok?I got worried bc I read about young adult MIs.", "question_id": "1552365"},
{"question_content": "My sister just got diagnosed with liver cirrhosis from years of drinking and abusing prescription medication.  Does it ALWAYS lead to liver cancer?", "question_id": "1331973"},
{"question_content": "Alt 188 AST 88 does changing statins cause the elevation? Nevver had abnormal liver function test before", "question_id": "629361"},
{"question_content": "I went for liver test and the result shows that my alt(sgpt) is 84.3 and asp (sgot) is 87.5. Pls what does it mean?", "question_id": "570725"},
{"question_content": "Cholesterol 174, triglycerides 68, HDL ch 45.00, LDL direct 80.00, vldl 14, HDL risk factor 3.9, CRP 0.53, homocysteine 8.6 with no diabetes. Good?", "question_id": "320024"},
{"question_content": "Mild urq pain just below rib cage. Ast & ALT 15. Normal abdominal ultrasound even though it state mildly enlgd liver 18cm. Should i be worried? Can an ultrasound be normal with mildly enlarged liver?", "question_id": "792440"},
{"question_content": "My cholesterol is 220, my LDL 80, HDL 80, triglyderides 175  .  Do I need a statin?", "question_id": "76956"},
{"question_content": "I had hysterectomy done. Do I still need a pap smear done yearly?", "question_id": "32969"},
{"question_content": "Are fish oil supplements a good idea to lower my cholesterol levels. My numbers are total 236. Ldl 150 HDL 71 tric 77\r\n?", "question_id": "244804"},
{"question_content": "Is it recommended to have gallbladder out if hida scan says your function is 30 percent and gb ultrasound says you don't have gallstones?", "question_id": "615530"},
{"question_content": "I've been told i hv a complex ovarian cyst and multiple fibroids some of which r calcified. D fibroids r inside and outside my uterus. Should i worry?", "question_id": "1164433"},
{"question_content": "What's the medical consensus on Fibroscan? Is it a reliable diagnostic tool for ESLD/cirrhosis?", "question_id": "1449333"},
{"question_content": "Alt is 67 and AST is 30, direct bilirubin is .2, alp is 157 but im 18. Total cholesterol is 213 LDL is 137 will this cause problems during gb surgery?", "question_id": "1248374"},
{"question_content": "No period nearly 6 months, low back, abdomen/pelvic pain, frequent urination, blood in urine, headsche, NT sexaly activ, 15 yrs old, chills, nausea?", "question_id": "1457723"},
{"question_content": "Is there any new cure for hep c and cirohsis. 76 years male with hepc , cirohsis, heartt issue and gall bladder stone?", "question_id": "1398459"},
{"question_content": "Where will the bile be produced in the case of amputation of gall bladder with stones?", "question_id": "77192"},
{"question_content": "My mom has barrets esophagus. She has diabetes, BP , thyroid..She's had kidney stones n recently hd her gall bladder removed. What food cn she eat ?", "question_id": "598175"},
{"question_content": "I am confused about my recent blood work. What is the hemoglobin, hematocrit, mcv, mch, mchc and rdw?", "question_id": "172789"},
{"question_content": "What's d best way to find, i'm having a hiatal hernia?Endoscopy normal.Freq belching, acid reflux, sensation behind breast bone, bloating, breathing prob.", "question_id": "1231156"},
{"question_content": "Why do gall bladder stones formed?", "question_id": "193498"},
{"question_content": "Recent CBC: RBC 4.48, Hgb 11.8, Hct 38.1, MCV 85.0, MCH 26.3, MCHC 31.0, RDW 15.8, Plt 503. How \"abnormal\" is my Plt in relative terms? What is likely the cause of high Plt (poss iron deficiency?)?", "question_id": "1353134"},
{"question_content": "Had adominal ultrasound and discovered gall stones.  Have had no gall bladder pain.  What should I do?", "question_id": "76367"},
{"question_content": "Had gall bladder surgery 18 days ago. Doctor at post opt visit told me to now peel dermabond off. Wounds look fine. I am nervous. Will it hurt?", "question_id": "1442729"},
{"question_content": "Kub X-ray showed no stone I am still having severe pain at night on my left side could it still be a kidney stone?", "question_id": "357754"},
{"question_content": "I've been taking naproxen 500 mg bid for almost a month for low back pain, usually on an empty stomach, in the morning. I'm on protonix and Zantac for gerd. I've been having stomach pain/pressure today. Could it be gastritis?", "question_id": "937898"},
{"question_content": "What is the treatment for gall bladder stones?  Is it only surgery?", "question_id": "112334"},
{"question_content": "I have a dorsal ganglion cyst on my wrist..It is not painful but is it safe to get removed? Any complications/scaring wit surgery for this?", "question_id": "794836"},
{"question_content": "Can you remove a ganglion cyst on the top side of your hand without surgery?", "question_id": "34213"},
{"question_content": "I was diagnosed with erosive gastritis, GERD, and hiatal hernia. I have terrible stomach pain. Why is Ativan the only thing that gives me any relief?", "question_id": "6710012"},
{"question_content": "Skin test for food allergies had a +2 reaction to milk and +to soy  blood test  came back negative still have issues w/milk what do i do ?", "question_id": "6649225"},
{"question_content": "What is the difference between lactose intolerance and dairy allergies in babies? I am a mother of a 4 month baby, and when she was 1 week she was diagnosed with an allergy to lactose -  the smear test came out with clotted blood hidden in the poop. As a", "question_id": "374448"},
{"question_content": "I had a ganglion cyst surgically removed from my knuckle of my thumb and it has come back.  What should I do?", "question_id": "483893"},
{"question_content": "I had UTI several times. I experience pain in my testicles after urination and sometimes there is swelling in the veins on my testes. I got a culture done and it had E.coli; there are pus cells in semen and urine. Any treatment?", "question_id": "951330"},
{"question_content": "I am 34 years old, 365 pds, i take niacin, red yeast rice and fish oil, for high cholesterol, hbp  at what age should I consider a asprian regimen?", "question_id": "731936"},
{"question_content": "If a cyst is painless does that mean it isn't infected? Would it cause a nearby lymph node to swell? I'm 18 with a cyst and swollen node in armpit.", "question_id": "1451272"},
{"question_content": "What are the odds of a 33 year old male getting colon cancer? I have loose stool, incomplete evacuation, itch, constipation, urgency. Could it be IBS or something else?", "question_id": "903561"},
{"question_content": "Bright red  blood once when expelled gas. No blood in stool. Stool normal brown color. Have hemorrhoids. What else might cause this?", "question_id": "965803"},
{"question_content": "I've prediabetes(fasting 91 mg/dl, hba1c5.7%) no ketone in my urine.Why I have diabetes synonym like dry skin, urination, my weight loss 6 kg in a month?", "question_id": "1093894"},
{"question_content": "Ige blood level of 500 with Chronic hives and fatigue. Causes?", "question_id": "6790187"},
{"question_content": "Should I have this more extensive cystoscopy done under anesthesia in the hospital? Had blood in my urine went to emergency room.  No infection found was told to see a urologist.  He found a large gray mass in my bladder after doing a cystoscopy said he d", "question_id": "399872"},
{"question_content": "25/female visited doc had 153 hr, high blood pressure, and abnormal ekg, blood tests normal, low vitamin d. Anxiety or should I see cardiologist?", "question_id": "590906"},
{"question_content": "I  have taken macrobid, bactrim, nitrofum and other meds that have failed with my chronic uti. Should I be taking something else or could I be misdiagnosed?", "question_id": "82993"},
{"question_content": "Is blood on toilet paper after a bowel movement a common sign of colon cancer?", "question_id": "107484"},
{"question_content": "How do you know if daughter completed puberty? Normal periods sev years, public hair, growth spurts, minor breast development though quite flatchested", "question_id": "1460478"},
{"question_content": "I have had a swollen lymph node under my left armpit for the last three days, and  muscle soreness, what could be wrong? -21 year old female", "question_id": "385333"},
{"question_content": "Back in january I had an EKG and had low blood pressure they said the next step was a stress test. I am uninsured so I passed the heart fluttering went away but now I have chest pressure along with jaw and teeth pain, fatigue and some nausea. I have an ap", "question_id": "263713"},
{"question_content": "If my family  medical history contains diabetes, high blood pressure, cancer, rhomatide, kidney stones, calcium, what are my chances of getting those.", "question_id": "547382"},
{"question_content": "Had culture done of urine and diagnosed with uti.Dr gave macrobid. But my kidney hurts and read somewhere that Macrobid doesn't treat k.I.What to do?", "question_id": "507908"},
{"question_content": "My dad scanner results said prediculaire liver tissue mass extended peri pancreatic cephalic and he needs biopsy what it means is his cancer killer?", "question_id": "1444458"},
{"question_content": "Does colon cancer usually cause bright red blood in your stool or is the blood darker in color?", "question_id": "661479"},
{"question_content": "Had CT scan of kidneys to check for stones, etc. All that was found was small ovarian cyst. If i had adrenal tumor, etc., would it also have shown up?", "question_id": "1044075"},
{"question_content": "Very sudden sore, swollen throat, red dots on roof of mouth. Completely fine when i woke up this am. What could it be?", "question_id": "585425"},
{"question_content": "What does Mono MCR mean after RX nitrofurantoin?", "question_id": "1425869"},
{"question_content": "Colon cancer. Do you always have to have blood seen in your stools?", "question_id": "102938"},
{"question_content": "I had allergy for the past 3 months!Coughing, sneezing, specially night hard to breath! Stuffy nose. Now I have swollen lymph neck nd crank sore. Hiv?", "question_id": "6647660"},
{"question_content": "I saw blood in my stool and i'm completely freaked out. What could it mean? There is colon cancer in the family.", "question_id": "110476"},
{"question_content": "Sore throat, bright red throat and tonsils, swollen tonsils, looks like tonsil stones in deep tonsillar crypts, swollen lymph nodes. Go to doctor?", "question_id": "1531161"},
{"question_content": "Would colon cancer show up in a abdominal CT scan ?", "question_id": "104794"},
{"question_content": "What is the likelyhood of a sudden polyp in gallbladder being cancer after colon cancer in person with lynch syndrome?", "question_id": "749006"},
{"question_content": "Felt ill.  Chills and bad sore throat.  Maybe a cold? Same today. Noticed small discoloration on tongue on side (no black) and bump near back. CANCER?", "question_id": "6715960"},
{"question_content": "After 10 days on cipro/flagyl for diverticulitis I now have an 1.5cm swollen occipital lymphnode. A CT and abdominal X-ray was negative. Thoughts?", "question_id": "170359"},
{"question_content": "Can an abdominal CT to rule out kidney stones and other abdominal pain (w/o )contrast detect colon cancer?", "question_id": "1164193"},
{"question_content": "I was diagnosed with diverticulitis and was started on Flagyl and cipro? Is that the usual therapy?", "question_id": "93854"},
{"question_content": "I need to have inguinal hernia surgery, I am 5-7, 225 lb. Would it be advisable to have some belly fat removed during the surgery?", "question_id": "365337"},
{"question_content": "Sore throat to the point where its painful to swallow, ear ache in both ears but mainly the left, a stiff neck and headaches on off Had for 7 days?", "question_id": "1465605"},
{"question_content": "How do polyps in the colon relate to colon cancer?", "question_id": "13588"},
{"question_content": "Is it possible for me to have colon cancer without polyps?", "question_id": "98595"},
{"question_content": "What to expect in metastasis, lung and brain cancer?", "question_id": "125458"},
{"question_content": "From past 6 months I am experiencing on/off pain in left testicle. A bulge is also seen sometimes in groin.Shown to doc .Says no hernia, varicocele?", "question_id": "1062987"},
{"question_content": "A barium enema does not sound fun, but it is effective to diagnose colon polyps?", "question_id": "10822"},
{"question_content": "Dr. Rx'd fluconazole 150mg for yeast infection. Said 'can repeat in 3 days'. 1st dose 27th. Is 3 days 30th? Can I use OTC yeast cream w/this? Itch!", "question_id": "1244357"},
{"question_content": "I have pounding headaches, high fevers. Trouble breathing when laying down, vomiting, nausea, shakes, and lower upper right abdomen pain?", "question_id": "961168"},
{"question_content": "My 10 yo son has swollen nodes in the front and back of his neck and also his elbow.No fever or sore throat.?", "question_id": "263823"},
{"question_content": "37 and allergic to mom's dachshund. Eyes are tearing, red and itch. Nose is runny and sneezing. Hate benadryl, is 25mg hydrox-zine ok?", "question_id": "1430070"},
{"question_content": "Vomiting continuously, shakes, muscle spasms, high temp of 39.1, dehydrated, face pain, not eating, headaches, pain in upper abdomen region ?", "question_id": "965843"},
{"question_content": "Weekly Migraine headaches normally triggeredby certain foofoods, direct sunlight. Managing by inducing vomiting drinking warm water & skipping 2 meals?", "question_id": "1421896"},
{"question_content": "I get chronic headaches, even tho im healthy, drink plenty of water, nd most of the time the headache turn in migranes, what can I do?", "question_id": "61706"},
{"question_content": "ER doc said my 18mnth old has Hand-Foot-Mouth disease but she has bumps around her mouth on hands and feet top and bottem on arms,legs,buttocks,scalp?", "question_id": "1448544"},
{"question_content": "I'm a 26 year old female who's been experiencing dry mouth with no relief after drinking water.My mom has diabetes but nobody else.Could I have it too?", "question_id": "6667909"},
{"question_content": "5 yr old complains of sore tongue way in the back; has red spots in back of throat. What could be the cause?", "question_id": "480070"},
{"question_content": "Could a brain tumor present with double vision spells and dizzy spells lasting 30 seconds to two minutes?", "question_id": "624121"},
{"question_content": "I noticed a white spoy on my iris. It itches and is very red my eye also wont stop watering. Is this an emergency?", "question_id": "693418"},
{"question_content": "My 4 year old has itchy little red bumps on the side of her face and arms and feet. I believe it's chicken pot does she need to go see the doctor?", "question_id": "1472674"},
{"question_content": "The back of my throat behind my tonsils have small whitish yellow bumps and my tonsils and back of mouth have small red veins everywhere. Concerns?", "question_id": "1572031"},
{"question_content": "My gum is inflamed, swollen & hurts around my bottom right wisdom tooth that's half cut through. I'm getting earache and sore throat. Is it infected?", "question_id": "529746"},
{"question_content": "I have a pain in the left side of neck which is causing headache. The pain is traveling to the back of my shoulder blade. I have an ear burning (warming) sensation. Pain relief is not working. What should I do?", "question_id": "540381"},
{"question_content": "How can I manage carpal tunnel syndrome while pregnant?", "question_id": "4803"},
{"question_content": "An area of my gum is swollen. How can I tell if my tooth is infected?", "question_id": "56206"},
{"question_content": "Dentist prescribed antibiotic/pain med for tooth abscess yesterday, today I am still in pain/face is swollen/gum and lip are now numb is this normal?", "question_id": "1258438"},
{"question_content": "Been on antibiotics for 6 days got a tooth pulled 4 days ago. Bit my lip while i was numb it is swollen, painful, and not improving. What can I do?", "question_id": "678864"},
{"question_content": "Woke up with numb bottom lip due to tooth hurting. Dr got it pulled out today. Still numb. Will this go away or be permanent. Said was a good extracti?", "question_id": "1522367"},
{"question_content": "My daughter has a bunch of small bumps on her belly there not red or itchy there not blisters, more like pencil head size, lots of them and they look kinda of like white bumps any idea what this could be?", "question_id": "398322"},
{"question_content": "Sore throat feels like a pimple on the back of my tongue used sore throat gargle(betadine)  on the right side its painfull when i swallow?", "question_id": "678746"},
{"question_content": "I have red spots at the very front of my soft palate, a cold, and a bad sore throat. What's going on? My hard palate is white", "question_id": "1219158"},
{"question_content": "Hi, I've got a few red prickly spots on my soft palate and a mild sore throat over the last 2 days. A similar thing occurred a few months ago. ?", "question_id": "1447916"},
{"question_content": "My belly button is itchy and red and sometimes wet and sometimes crusty. I don't have a piercing and shower regularly.?", "question_id": "118831"},
{"question_content": "The urine tube in me penis is itching-burning\nWhat medicine can Inuse?", "question_id": "1455668"},
{"question_content": "I had my wisdom teeth removed 2 days ago and my lip jaw and chin are still numb, how long will this last? My doctor didn't warn me about this.", "question_id": "337771"},
{"question_content": "I had a surgery 4 years ago. I had my 4 wisdom teeth extracted and until now, my lower lip is still numb and i feel prickle in my lower lip and chin. What should I do?", "question_id": "346618"},
{"question_content": "I had 4 impacted wisdom teeth removed 2 weeks ago. My chin and bottom lip are numb. Chin feels pressure anditches but i can't feel ice cubes. Any options?", "question_id": "540249"},
{"question_content": "I have 2 sores in my mouth. 1 small bright red sore on soft palate by my teeth and 1 underneath the tip of tongue small red border white center. Can u have canker sores and oral herpes @the same time?", "question_id": "1456731"},
{"question_content": "Is there anything I can do to increase the possibility of regaining full feeling in my lower lip and chin after wisdom teeth extraction?", "question_id": "1529597"},
{"question_content": "The left side of my chin and tongue went numb a week ago. I have all my wisdom teeth, however one has started protruding. Same side. Is it related?", "question_id": "321021"},
{"question_content": "I have been having sore throat for 5 days. There is no fever, cough or nasal infection. I have been on 3 rounds of antibiotic for my tooth. My daughter also has strep right nowand it grew bacteria. What should I do?", "question_id": "764612"},
{"question_content": "I've been having Diarrhea, I did have a headache but it went away! Do I have the stomach flu or colon cancer? Answer back ASAP and I'm 17", "question_id": "1431688"},
{"question_content": "I have sore throat, headache, bodyache, mild fever. Is it a bacterial or viral infection? I had a flu shot last month.", "question_id": "55722"},
{"question_content": "Possible i could have oral cancer?  but would your tongue and throat hurt at same time?  i also have ear pain, jaw pain, throat stings hard to swallow", "question_id": "1378609"},
{"question_content": "feel pain behind left ear left upper jaw my throat having difficulty in swallowing and my face goes to one side ever since i had molar tooth removed?", "question_id": "1518651"},
{"question_content": "After having both lower wisdom teeth removed, the right side of my neck, throat, and jaw are so painful i can hardly open my mouth or swallow.", "question_id": "620365"},
{"question_content": "Jaw had sore spot that hurts when pressed. Lower left jaw. No mouth/tooth pain. Caused one sided headache this am. Should I see my doctor?", "question_id": "6786467"},
{"question_content": "Wisdom tooth abscessed, and can't open my jaw! how to treat this?", "question_id": "538621"},
{"question_content": "Tooth abscess, awaiting extraction. Jaw is swollen and i cannot open mouth wide enough for treatmen on amoxillian and co codomol for 10 days tooth ok?", "question_id": "1160657"},
{"question_content": "I've been feeling dizzy while sitting and walking for months. Can this be a ear infection? Stress? Or optical? Blood pressure is controlled", "question_id": "1164252"},
{"question_content": "I recently had 2 out of 4 wisdom teeth removed and am experiencing \"lock jaw\". How can I get rid of that asap?", "question_id": "1094942"},
{"question_content": "Hi it's 3 weeks since my wisdom tooth extraction. I had earache in my left ear which i did expect but that's gone. Now i can't hear in right ear..", "question_id": "628706"},
{"question_content": "20 years old.. I got a tooth in the back of my mouth and I get jaw pains sometimes how is wisdom teeth removed will I feel it during ir after.Help?", "question_id": "108489"},
{"question_content": "I have a hard lump on my lower inner left leg about halfway between my knee and ankle you cannot see it only feel it and can be sensitive to touch should I be worried ?", "question_id": "264112"},
{"question_content": "Pain in right shoulder blade. Circular motion with head cause pain in neck when I go to the right. Heart attack, lung cancer or just muscle sore?", "question_id": "1553074"},
{"question_content": "My chest X-ray showed low to moderate air trapping.Do I have copd?", "question_id": "1372290"},
{"question_content": "I'm having pain in the arch of my foot, toes, ankle, heel, and up into the side of my leg. Doctor said I have sciatica issues. Could this be related?", "question_id": "905376"},
{"question_content": "How does COPD look on a chest x-ray?", "question_id": "961313"},
{"question_content": "Can COPD be seen on chest x-ray?", "question_id": "960823"},
{"question_content": "I have pericoronitis in a infected wisdom tooth in the lower left side. I have a swollen lymph node on the right side though is that possible?", "question_id": "6648646"},
{"question_content": "Throat feels tight on left side I believe due to swollen lymph nodes slight sinus issues been a month just got an infected tooth removed what's issue", "question_id": "1400392"},
{"question_content": "I have a sore neck and everytime i turn my head, my vision goes funny. It feels like my brain moves and i get dizzy and nauseous. What should I do?", "question_id": "330565"},
{"question_content": "Due to wisdom tooth trouble, i can't open my mouth more than what would accomodate one finger. The dentist prescribed antibiotics and after 2 days, the ache subsided but still can't open my mouth normally?", "question_id": "645626"},
{"question_content": "12 days post-op wisdom tooth extraction. Had a bad taste in mouth which is gone now, still have unpleasant breath sometimes.  Brushing 3x/day, peridex 2x/day, dentist says no infection or gum problems?", "question_id": "907851"},
{"question_content": "So had severe sinus infection and after antibiotics and CT scan i still have head pressure and aches. Its been 9 weeks now since it started.. Normal?", "question_id": "619724"},
{"question_content": "5 days post-op wisdom tooth extraction. Healing perfectly, dentist said i'm doing great.  How to keep food out of the hole/stitches without irrigation syringe. Syringe may cause dry socket he said.", "question_id": "901902"},
{"question_content": "The inner side of both my feet hurt really bad whenever I walk. It feels like a bone is sticking out(not my ankle but lower down on the foot). Help?", "question_id": "1506172"},
{"question_content": "I have 'dropfoot, nervdamage left leg, always pain, ortopedicshoes.I walk on toe.The bone on top of foot \"bigger, bump.Foot smaller.What do about \"bump?", "question_id": "161426"},
{"question_content": "How long will i stay numb after having my wisdom teeth out? I had my wisdom teeth out this morning at 8:30 (it's now 3:00 pm) and still feel a lot of numbness in the back of my mouth. I've never felt numb for this long after going to the dentist. Is somet", "question_id": "400166"},
{"question_content": "I have a sore throat with a white spot that looks like a kanker sore in the back of throat and also a red bloody spot right next to it. any ideas?", "question_id": "1443214"},
{"question_content": "Blood clot in my calf (not deep vein) told wear stocking but can't cos foot goes blue and swollen. Operated my foot, can't walk. What to do?", "question_id": "351653"},
{"question_content": "I have swollen feet,ankles and calfs with red marks(not itchy) under the skin, they have been swollen for three weeks and water tabs did nothing ?", "question_id": "1442400"},
{"question_content": "After surgery of navicular xtra bone in foot am i able to join military? I've flat foot too.Does navicular bone makes pain in tarsal?", "question_id": "691163"},
{"question_content": "Can asthma cause lung nodule in non smoker 52 yr/F had chest xray april - negative, now chest xray july nodule showing?", "question_id": "1407624"},
{"question_content": "Mom had xray 3 months ago&it was negative,then just the other day had xray had 1cm small density nodule,how did this pop up so quick,cancer? nonsmoker", "question_id": "1408646"},
{"question_content": "Mom is coughing 2wks, her chest X Ray is ok but she has many cracked blood vessels in the eye, no infection in it. Can it be from coughing. Dangerous?", "question_id": "1466331"},
{"question_content": "After day 12, still coughing, runny nose, conjunctivitis ( on eye antibiotics ) still feeling tired, not sleeping well, but no fever. Since I have no fever--could be asthma? Would seeing dr help?", "question_id": "549136"},
{"question_content": "What other options will my doc give me if steroid & rescue inhalers aren't helping asthma?", "question_id": "1440631"},
{"question_content": "Did deadlifts 2 months ago & had severe back pain 2 wk. Now mild chronic pain. Get sharp pain from spine across back if do deadlift, no leg pain. Other weight exercise ok.Can pulled muscle take +8 weeks to heal?", "question_id": "1129340"},
{"question_content": "Muscle weakness in rt biceps in multiple cervical hnp c4-5 5-6 6-7 It's sometimes weak.and numb. Axial neck pain too. Epidural inj. didn't work.op?", "question_id": "1245724"},
{"question_content": "Varicose veins, 2 weeks ago had the stripping done to his leg, it swells up once in a while and it hurts to wear the stocking that was given to him.", "question_id": "566461"},
{"question_content": "Tmj c spine issues. Clicking left TMJ and neck without doing really anything.No big TMJ pain now, just clicking.Do stretches strengthening exercises. Mri 12/2012 shows cervical damage, but not on tmj.", "question_id": "638248"},
{"question_content": "Hardly slept at a for more than a week. Tried, valerian root, melatonin, kava, motrinpm, ambien, and xanax. Xanax helped two nights but does not work now.Also tried relaxation techniques suggested.Help?", "question_id": "1102654"},
{"question_content": "Left tonsil swollen a little pain left ear little pain when swallow feels like lump in throat. Bad breath nasty taste in mouth?", "question_id": "1568883"},
{"question_content": "New ringing in ears and slight numbness around mouth and nose. Recently had CT MRI mrv EEG all normal.History pregnant TMJ ehlers danlos anxiety. Help?", "question_id": "1070456"},
{"question_content": "Not gettin good deep resting sleep trying 10 mg melatonin a night 2 of them.can i take more.ambiem dont work.What do i do.dont want habit forming drug?", "question_id": "1568627"},
{"question_content": "Side of tongue pain, upper jaw pain by roof of mouth, lower jaw pain under tongue, ear discomfort, nerve pain under eye next to nose. TMJ?", "question_id": "1394439"},
{"question_content": "Can TMJ cause leftside face and arm numbness, ear fullness, your eye to feel pressured? Clear brainmri and ct. Left sidejaw pops out when opening it", "question_id": "1036671"},
{"question_content": "Bad bloating in upper abdomen &chest, frequent bowel movements, reflux, belching, pain in center of chest, cleared by cardiology, thoughts?", "question_id": "1470555"},
{"question_content": "The side of my jaw is hurting right below my ear, and cannot open my mouth all the way plus sounds like sand inside could it be tmj?", "question_id": "1402436"},
{"question_content": "I have tmj. My jaw shifted to the left and i can make sound of my left jaw. There is no pain. I also have a swollen pea sized growth in front of my left ear. What should I do?", "question_id": "548461"},
{"question_content": "I was on klonopin  3 mg  about to raise  it to 4mg along with my prozak  adhd meds like dextroamphetamine  Concerta vyvanse  and Adderall,trazodone, and  multiple  others like 7 months ago when I  suddenly  was taking  off my insurance  and I suffered so", "question_id": "6703294"},
{"question_content": "I recently had an MRI of the brain. The results where as follows mild atrophy and mild periventricular white matter ischemic small vessel disease.  Wh?", "question_id": "877474"},
{"question_content": "I woke up with a sore throat, headache and fever. Strep throat is going around st school. I really do not have money to go to doctor. Is there anythin?", "question_id": "83405"},
{"question_content": "Im seeing doc in few days but im freaking out! I have a lump under the skin by clit on lips of vagina. it feels like a sm. ball inside when I touch it?", "question_id": "1387570"},
{"question_content": "Prozac with Adderall and crack?", "question_id": "650837"},
{"question_content": "Carotid artery? (ent said don't worry about it) swollen/painful for 10 mo. Ct scan showed nothing abnormal. Should i see a vascular doc or do nothing?", "question_id": "577574"},
{"question_content": "Have hiatal hernia. Lately I'm having soft pale-colored stools that float, diarrhea, stomach pain, gas, nausea. Are these symptoms related to hernias?", "question_id": "1338053"},
{"question_content": "Hav shortness of breath, small amt. Blood in mucus phlegm no cough at all. Did xray blood test. Doc says no TB cancer. Mayb smoking. I jus quit. Help!?", "question_id": "111782"},
{"question_content": "What do I do now? I have had a swollen lymph node in my neck for about 6 weeks now. Sometimes it is easily felt but other times it is not so pronounced, but is always larger than the right side.  I recently went to the doctor due to this and pain in my sp", "question_id": "385057"},
{"question_content": "Immune compromised 36 yo female. Had very mild case of shingles in past. Have shingles-like pain again, but no rash. This time pain is under right armpit and shoulder area.", "question_id": "979624"},
{"question_content": "•\t I am diabetic since 5 years,for the last 5 years  my fasting  blood glucose in between 125-134 mg/dL and my  blood sugar level two hours after eati?", "question_id": "1432272"},
{"question_content": "Does diabetes always show in a random glucose blood test? I had gestational diabetes but random glucose has been clear for 6 years. Now im having strog sweet smell in urine and heart palps and jitters", "question_id": "905956"},
{"question_content": "My daughter needs the chicken pox vaccine & 1 week ago a friend gave her kiss on cheek but he now knows his rash is shingles. Was she exposed?", "question_id": "128192"},
{"question_content": "Is a gluten-free diet a healthy alternative for someone that doesn't have celiac disease?", "question_id": "10783"},
{"question_content": "About 5 days ago, the skin on the upper left side of my left foot went numb. No diabetes, good blood pressure, not sure what's causing it. ?", "question_id": "1568658"},
{"question_content": "Pitted edema both legs, no DVT  should I wear support stockings all times, & are calf only supp. Compression sleeves as good as toe to upper calf sock?", "question_id": "1199121"},
{"question_content": "My son has rashes on his tummy, back, arms, and also has little red spots on his face. He has had the chicken pix vaccine. He has fever and bad cough ?", "question_id": "131665"},
{"question_content": "At night my right hand wakes me with numbness and tingling and a lot of pain lasts for about an hour help me please. I am 47 on metformin for type 2 diabetes, hctz for my high blood pressure, and welbuterin to try to help with quitting cigarettes, i  also", "question_id": "389786"},
{"question_content": "Can someone who had chronic Lyme disease and has been treated for it  & still has neurological symptoms, bladder dysfunction & pain possibly have ms?", "question_id": "715455"},
{"question_content": "If a retiree did not have chicken pox in childhood, is there any reason to get the shingles vaccine? Saw drug company ad about it.", "question_id": "127104"},
{"question_content": "35/f, family history of dvt. Pe with 4 major clots in lower right lung and a huge saddle embolus on feb 12. 4 mgs warfarin a day. My chest hurts today, hasn't in weeks. Pulse slightly high. Am i okay?", "question_id": "790974"},
{"question_content": "Chronic neck, jaw, face, ear, shoulder and other ligament /joint pains but last few months get metallic taste in mouth only when pain comes on, why?", "question_id": "1551008"},
{"question_content": "Can you get shingles if exposed to chicken pox if you already had chicken pox as a child?", "question_id": "127566"},
{"question_content": "Do I still have to worry for my chest pain even if I have normal 2deho Jan 2013, ecg, treadmill stress test I'm always thinking of heart attack/stroke?", "question_id": "1027564"},
{"question_content": "My doc told me my sugar levels was in 70's the past 3 months after she did blood work, I have had low blood sugar at times, feel weird, diabetes?", "question_id": "76341"},
{"question_content": "Should I check my blood sugar levels at home with a glucose monitor?", "question_id": "14120"},
{"question_content": "I can not skip any meal, my blood sugar drops an I start sweting. I do not take insulin and I have normal sugar level in the morning before meal.", "question_id": "1545949"},
{"question_content": "Two attacks of tingling hands/jaw and chest pain today. Ekg,stress,echo,24holt normal. No fam hist and 28. Is this my heart still? Or panic? Non smoke", "question_id": "1436411"},
{"question_content": "PAINFUL sore throat gets worse each day lasted for 5 days accompanied by cough, fever, congestion. What to do about this and how long will it last ?", "question_id": "6708194"},
{"question_content": "Pain in center of chest. Echo EKG normal. Have anxiety and 7 months pregnant. Pain left side neck and left shoulder blade also?", "question_id": "1527365"},
{"question_content": "My husband is hospitalized for dvt. Should he ask for inferior vena cava filter even if he doesn't undergo tpa treatment? (unsure when clot formed.)", "question_id": "492006"},
{"question_content": "Can a blood test miss a kidney stone that was discovered by an ultrasound?", "question_id": "1409003"},
{"question_content": "After a DVT what are your INR levels suppose to be at in order to be able to come off the warfarin?", "question_id": "29226"},
{"question_content": "What could cause upper abdominal pain and mid back pain?  I've been on a picc line for antibiotics to cure a staph infection for the past 5 weeks.", "question_id": "925737"},
{"question_content": "Do myocardial infarction happen at my age? I'm 23 my BMI is 30 and i don't work out and i sit a lot, my resting heart rate is great tho 50/55 bpm.", "question_id": "6728129"},
{"question_content": "Can you briefly describe what is ischaemia? And is myocardial infarction the same with heart attack?", "question_id": "1035774"},
{"question_content": "What confirms myocardial infarction?", "question_id": "680734"},
{"question_content": "Is running bad for recovery from a dvt? Popiteal vein. On warfarin.", "question_id": "50831"},
{"question_content": "Aneurysm or high risk of heart attack or stroke cause taste of blood in throat?myocardial infraction, inflamed plaque,head pain,chest pain-symptoms!?", "question_id": "1391284"},
{"question_content": "How do I get over my health anxiety..Particularly heart anxiety?..My ekgs..Echo . Stress test came back normal along with my blood work..Help?!", "question_id": "1028023"},
{"question_content": "How long could it take swelling in leg to go down after DVT diagnosis and warfarin started?", "question_id": "29257"},
{"question_content": "If you sleep 5 hours only at night because of anxiety and panic attacks are you risk for much serious problem?Normal 2decho, ecg, stress test, endoscopy", "question_id": "980138"},
{"question_content": "Couldnt breath & pain in left arm- all test came back neg- CT scan of lungs ekgs bloodwork- no heart attack per dr.- 24 hrs still having same issues?", "question_id": "848873"},
{"question_content": "40yr fem, had normal stress test, cta chest, EKG, echo norm but dop sugg impair lv relax. Doctor says heart is fine. Holter shows pvc's and pac's isolated. But despite a norm diagnosis my heart flip flops a lot.", "question_id": "908539"},
{"question_content": "Do I have heart failure? I'm 18 with sleep apnea, chronic stress, hbp, fatigue, palpatation, short of breath and many other issues that aren't solved", "question_id": "919955"},
{"question_content": "My bf has a staph infection he had a 2hr drip of IV atibiotics last night at hosp, 2 anti scripts to take home, how long is he cont? Skin is not open?", "question_id": "285291"},
{"question_content": "I have a cold for about a 9 days. It is not going away. Green mucus from nose and throat. Blood in nose. Facial pain and cough. Sinus infection?", "question_id": "1553687"},
{"question_content": "Hello sir, I am having mild mitral valve prolapse with mild regurgitation. What will be my lifespan.What are the chances of progressing this condition?", "question_id": "794126"},
{"question_content": "What other work up should I do to really ruled out heart disease I've done 2decho doppler, 12 lead ecg, ecg, threadmill stress test all came back normal?", "question_id": "960852"},
{"question_content": "Had 2 ekgs this year still having chest pains today on left side on the breast when i stand up and walk around like a tightening b pain burns a little?", "question_id": "1240084"},
{"question_content": "I'm taking amoxicillin 500mg for a tooth infection and i contracted what i believe to be a throat infection. Should i go to the doctor if i'm already on penicillin?", "question_id": "526744"},
{"question_content": "Played volleyball tonight, my hr got up around 180, and i was having chest pain in my left breast for about 5mins, but i had an EKG yesterday that came out fine. Should i go to er?", "question_id": "693041"},
{"question_content": "My 2 year-old daughter has thick green mucus coming out her eyes and runny nose and fever of 101 for 3 days? I've used garlic oil in her ears for earache.", "question_id": "1217829"},
{"question_content": "I have a sore throat I went the doctor and he give me amoxicillin per 10 days but after 2 weeks the sore throat come back?", "question_id": "1397841"},
{"question_content": "What is the difference between endoscopic sinus surgery and a balloon sinuplasty?  (for chronic sinusitis)", "question_id": "312362"},
{"question_content": "If you get cold sores, can you transmit hsv1 to someone genitally through oral sex when you don't have a cold sore?", "question_id": "1165353"},
{"question_content": "What to do if i'm getting a septoplasty and turbinectomy soon. Advice or comments?", "question_id": "1301038"},
{"question_content": "I have chronic sinusitis, sinus pain, face pain, teeth, gumand jaw pain and severe dry eyes, but my nasal passage is bone dry. Suggestions for dryness?", "question_id": "338945"},
{"question_content": "Will low calorie cranberry juice work as well as regular cranberry juice to help prevent/treat recurrent urinary tract infections?", "question_id": "908271"},
{"question_content": "What are my chances of passing hsv1 genital to someone orally and genitally with and without supressive therapy?", "question_id": "282518"},
{"question_content": "My one year old daughter had a double ear infection. Wefinished the zithromax on friday. Today, she woke up with a swollen eye and green slime coming out. Could she besuffering from pink eye?", "question_id": "484692"},
{"question_content": "What could cause a urinary tract infection in men?", "question_id": "27586"},
{"question_content": "Is a urinary tract infection more common in men or women?", "question_id": "15889"},
{"question_content": "I keep thinking im going deaf.  I have severe anxiety attacks and am scared of going deaf.  I cleaned my ears with water now i think I've damaged 2 ear?", "question_id": "1201673"},
{"question_content": "2 dislocated TMJ disk+bone spur. Inflammation cause hearing loss left ear. Very painful. Possible infection? Taking perc+mscontin now. Will Vicoprofen help?", "question_id": "553177"},
{"question_content": "I've had an ear pain that goes down the front side of my neck, for months now. I also have an off-balance feel. The doctor said there is no infection. Could it be TMJ or something else?", "question_id": "810885"},
{"question_content": "Is it safe to give a 14 month old Benadryl when she is already taking 5ml of zyrtec?", "question_id": "1436456"},
{"question_content": "My 2 yr old daughter has grade1 microtia of the left ear. She has tubes for recurrent infections but she seems to have hearing loss. Is this possible?", "question_id": "849596"},
{"question_content": "My friend has a food allergy reaction. We are unable to access Benadryl (in Saudi Arabia). What action can we take? How much Zyrtec can she take?", "question_id": "1568751"},
{"question_content": "Is it ok to alternate zyrtec(prescribed) and Benadryl (otc) for a few days for an allergy attack. Would be z in am and b at pm. 17mth old male", "question_id": "277695"},
{"question_content": "2 months ago I had strep throat I took some antibiotics and it went away.. Now one tonsil is swollen. Should I be concerned?", "question_id": "1427189"},
{"question_content": "Need alternative to zirtec for allergy-induced asthma. Allegra and Benadryl don't work, nor albuterol asthma inhalars. Claritin gives me nasal pain.", "question_id": "1441854"},
{"question_content": "Can you get a girl pregnant if you have low sexual binding globulin?", "question_id": "1015685"},
{"question_content": "What's the best allergy medicine? Allegra, Claritin or Zyrtec?", "question_id": "6698145"},
{"question_content": "Would a brain MRI with and without contrast show problems with sinuses(cyst or tumors)or do they have to order MRI specifically for the sinuses?", "question_id": "6629857"},
{"question_content": "If im in the ER and they wanna check for a brain tumor by doing a CT scan. Can i request an MRI without contrast instead or is that not an option?", "question_id": "486507"},
{"question_content": "If i had a mri&ct 5mths ago of the brain can anything serous change from then? Like coma or tumor or bleed i'm 20 with no medical problems", "question_id": "628124"},
{"question_content": "I have protected sexual intercourse with a csw after one year i test HIV PCR test result was viral load less than ldl(ldl-10 copies/ml) what mean help?", "question_id": "1032744"},
{"question_content": "Does neomycin and polymyxin b sulfates and hydrocortisone (neomycin sulfate, polymyxin b sulfate and hydrocortisone) cure a stye I have steroid eye drops my dr. Prescribed me a few months ago. I have been trying to get an answer for 2 hours and haven't go", "question_id": "393221"},
{"question_content": "I'm 47 with regular cycles. I had sex on the ovulation day. The day after, one day before my aunt flo was due, i got a lot of creamy cervical mucus. I feel tired, my breasts feel full and have mild cramps in the abdomen. Is this a sign of pregnancy?", "question_id": "795297"},
{"question_content": "Hi, \nI had protected sex with CSW 5 weeks ago. I tested for HIV at 3weeks with RNA PCR and CMIA Combo, both came negative. I again tested for both the test at 4 weeks, it came negative. Today, I tested at 5th week with CMIA combo test which came negative.", "question_id": "1440045"},
{"question_content": "Can two \"clean\" sexually active partners develop an std? If my boyfriend and I have unprotected sex, and neither of us have any stds, can we develop one by not using a condom?", "question_id": "380362"},
{"question_content": "20, male, Docs i am very scared! I was laying down in dark and right eye went blind. everytime i go in dark my right eye goes blind but not in light!", "question_id": "6780374"},
{"question_content": "My period usually lasts for seven days. I had sexual intercourse on the fifth day. Can i become pregnant by doing so?", "question_id": "346947"},
{"question_content": "Endoscopic surgery 5 days ago. I have dull sinus headache and significant pain behind my left eye. Should i call doctor?", "question_id": "1246640"},
{"question_content": "Is it possible for a child/teenager without being sexually active to have vaginal infection", "question_id": "718792"},
{"question_content": "Which laser eye surgery correct both my nearsightedness and astigmatism? Do either of the popular types of laser eye surgery, lasik or prk, fix these issues so that i'll have 20/20 vision or close to it? I can't wear contacts; i've worn glasses since i wa", "question_id": "382291"},
{"question_content": "Astigmitism and corrective procedures? I am near-sighted, and have worn glasses since high-school. I feel like my eyes are gradually getting worse. I really want to get lasik-eye surgery. However, i've been told that since i haveastigmitism, this procedur", "question_id": "372596"},
{"question_content": "Trying to have a baby. calculated my ovulation from last period, the next period didn't come, not yet pregnant. Don't know when I'd ovulate or expect my period. Want to get fertility drug. Pls advice?", "question_id": "6733141"},
{"question_content": "Can a lensectomy help with both astigmatism and nearsightedness? I have astigmatism and I am very nearsighted; i've worn glasses for years. What kind of results could i expect from a lensectomy, and is it as safe as cataract surgery?\n\n.", "question_id": "382408"},
{"question_content": "I had cataract surgery and now have a hole in the retina of my eye. Are the two related in any way?", "question_id": "344219"},
{"question_content": "After having cataract surgery, I now have a large \"floater\" which came from the back of my eye. It is blocking part of my vision. What can be done?", "question_id": "83880"},
{"question_content": "I had cataract surgery a month ago, and now the operated  eye looks smaller than the other one. , what can I do to make eye normal again?", "question_id": "69880"},
{"question_content": "Myopic w/ astigmatism & ms, i've had increasing double vision despite being treated w/ tysabri. For correction, do I need ophthalmologist or neuro-op?", "question_id": "799857"},
{"question_content": "Hi it's been six days since I had sex. The lower part of my stomach is very sore almost like bad cramp. I have been dizzy could I be pregnant?", "question_id": "1423247"},
{"question_content": "Please help! what is the terminology for a person who is nearsighted in one eye and farsighted in the other?", "question_id": "1150059"},
{"question_content": "I have only one fallopian tube left after a ruptured right ectopic pregnancy last year. Can i get pregnant?", "question_id": "319579"},
{"question_content": "I'm on tysabri(for MS and have had a cold for the past 3 weeks.Penicillin, anti inflamitories, cold and flu tablets are not working.Should i be worried?", "question_id": "1123881"},
{"question_content": "Having brown discharge. had 2 period last month. 2nd one occurred after intercourse n started bleeding. might be cause of miscarriage. pls help?", "question_id": "1441705"},
{"question_content": "I am high myopic and have lattice degeneration (no tear). Should i be worried about carrying a 15 lb backpack while travelling cross-country by air?", "question_id": "989668"},
{"question_content": "How long will it take my eye to heal after cataract surgery so I can do the other one?", "question_id": "180036"},
{"question_content": "My mom had a cataract surgery a year ago, but her eyes are still watery. Is this normal?", "question_id": "29424"},
{"question_content": "Can i be sure i'm not pregnant w/ negative hCG blood test 5&6 weeks after contact and nothing on vaginal ultrasound 6 and 8 weeks after contact?", "question_id": "1232182"},
{"question_content": "Can a reaction to lens placed in cataract surgery develop in people with sensitive eyes and allergies to cosmetics, etc?", "question_id": "52656"},
{"question_content": "Which is the best lens to place in the eye after a cataract surgery? My optometrist says that the 'yellow alon' lens is best and the surgeon says that a tech lens is better. Whichone should be used?", "question_id": "848124"},
{"question_content": "If i've had lasik, am i still a candidate for blepharoplasty? I had lasik a few years ago, which left me with chronically dry eyes. Am i still able to have blepharoplasty?\n\n.", "question_id": "396027"},
{"question_content": "Which lens are good for cataract surgery?", "question_id": "911485"},
{"question_content": "Why are people with very dry eyes not suitable candidates for lasik?", "question_id": "366185"},
{"question_content": "Why would my 15 yr old daughter have a constant headache for 6 + weeks? Has been checked by pediatrician, eye doctor, neurologist and ent.  Nothing!", "question_id": "677023"},
{"question_content": "My 2 year old daughter has suffered from severe viral conjunctivitis now she is unable to open her eyes due to light sensivity , how can I help her?", "question_id": "600616"},
{"question_content": "Who should I see about one slightly bulging eye and sudden lazy eye if i've had an eye exam and was just prescribed prism glasses?", "question_id": "504094"},
{"question_content": "I have been feeling these weird cramps in my tummy. Also I've been spotting a few days after my period. The spotting has bees going on for about a week and a few days. It's light pink and kinda brown. Sometimes I feel dizzy. Is there something wrong?", "question_id": "6786626"},
{"question_content": "I have a lazy eye, it is negatively affecting my life. Is there anything i can do to fix it? I had laser surgery when i was a baby, and my doctors put the eye patch to strengthen the eye, but i kept taking it off (since i was a tot). Is there any type of", "question_id": "397817"},
{"question_content": "How can I make dry eyes more comfortable with contacts? I’ve always preferred contacts, but in the last few years i’ve started having really dry eyes. I use artificial tears eye drops, and they work when i’m wearing glasses, but not so good when i’m weari", "question_id": "373214"},
{"question_content": "My period is late, and I had unprotected sex on one of my fertile days. What's the chances I'm pregnant? When should I take a pregnancy test?", "question_id": "1493446"},
{"question_content": "I saw my eye dr yesterday for large sudden onset floaters. No retinal tear or detachment.. Today I am having light flashes....Should i be seen again?", "question_id": "508070"},
{"question_content": "Do wearing of  glasses to correct astigmatism at the age of 3yrs also helps to stimulate the  eye development(getting cornea round) faster in kids ?", "question_id": "285338"},
{"question_content": "I see a new floater in the eye that i had a retinal detachment surgery.  Should i be extremely worried?", "question_id": "696235"},
{"question_content": "Eye ultrasounds reliable for evaluating vitreous syneresis?No retinal tear, I have thousands floaters n clouds, but no significant pvd found.Possible?", "question_id": "1102135"},
{"question_content": "After having retinal detachment surgery, is it normal for your eye to hurt?", "question_id": "184038"},
{"question_content": "Will a OTC mouth gaurd help till i get to see TMJ doc- can't see him for another 3 weeks sick of ear fullness/ dizziness, ENT says its prolly tmj?", "question_id": "1070644"},
{"question_content": "Have scalp tenderness on right side along with ptosis of r eyelid,frequent headache which are worse behind and around right eye. Also pupils diff size?", "question_id": "6702253"},
{"question_content": "I've had irregular periods/spotting for the past 2months. This month, i missed my period on the second day. I have sore/swollen breasts and feeling gassy and bloated; thereis no lump in the breast. What should I do?", "question_id": "834975"},
{"question_content": "I have sleep apnea OCD anxiety and ADHD at age 18. Is it really rare for someone my age to have all those problems?", "question_id": "685683"},
