{"question_content": "How long does a teenager need to be unhappy in order for you to be worried about depression?", "question_id": "43073"},
{"question_content": "Is it possible for a child or teen to get depression like adults do?", "question_id": "120221"},
{"question_content": "Are teenagers who use drugs usually depressed?", "question_id": "42930"},
{"question_content": "Are there particular medications that work in addition to psychotherapy in teenagers for depression?", "question_id": "42957"},
{"question_content": "Can i safely take 400mgs of zoloft. I'm currently taking 200 - 300 mgs daily. My depression varies and today its bad?", "question_id": "1154512"},
{"question_content": "What are the physical symptoms of depression?", "question_id": "222219"},
{"question_content": "Is psychotherapy effective for treating depression?", "question_id": "170923"},
{"question_content": "I was prescribed remeron, for sleep problems and also hope to knock out situational depression with it. 30mg daily. Is this a good medication?", "question_id": "66945"},
{"question_content": "How do I treat my anxiety depression and insomnia? I have been on ativan for 14 years and its doing nothing", "question_id": "6716766"},
{"question_content": "What's the next step in therapy when the antidepressants and psychotherapy doesn't work at all?", "question_id": "284505"},
{"question_content": "What are the symptoms of depression and what can be done to counteract them without medicine? Is there a main reason i feel so shut down and seek to keep people away so i don't hurt them with my words. They seem to hurt anyways. What can I do to know if m", "question_id": "404936"},
{"question_content": "At night my right hand wakes me with numbness and tingling and a lot of pain lasts for about an hour help me please. I am 47 on metformin for type 2 diabetes, hctz for my high blood pressure, and welbuterin to try to help with quitting cigarettes, i  also", "question_id": "389786"},
{"question_content": "Can a person with depression be dependant for life to antidepressants? If that's the case what other threatments can be worth trying?", "question_id": "93496"},
{"question_content": "I've been struggling w/depression for a yr, trying lexapro, celexa, now Prozac 40 & Abilify 5.... I'm have bad heartburn again. Is Adderall an option?", "question_id": "1571774"},
{"question_content": "I've had some depression lately and normally i'm quite a happy person. It got so bad that I had thoughts of suicide. Should I take antidepressants?", "question_id": "60316"},
{"question_content": "Eeg normal. Had facial and limb twitching during eeg. History of convulsion after head injury. No history of epilepsy so far. Any ideas of cause?", "question_id": "1217694"},
{"question_content": "How does wellbutrin (and similar meds) help with depression and anxiety?", "question_id": "221376"},
{"question_content": "My ankles, feet, legs and hands are swelling really big and I have a throbbing pain from it. What could be causing it? I am a newly diagnosed type 2 diabetic.  I also have a slipped disc at my l4&5. I have high blood pressure and high colesterol. I am tak", "question_id": "380775"},
{"question_content": "I am suffering from depression..But don't want to get addicted of anti-depressant drugs.What should I do?", "question_id": "772240"},
{"question_content": "Dr which is a stronger drug.10mg Lexapro or 30mg cymbalta.Thanks?", "question_id": "1163102"},
{"question_content": "How likely am i to be diagnosed with ms? I originally went to the doctor for numbness and tingling in my hand and foot and have gotten severe pain in my opposite arm and hip on two occasions.  One white spot was found on my brain mri, minor degenerative c", "question_id": "392752"},
{"question_content": "Why am i down in the dumps so bad? I take cymbalta and Lexapro with no improvement. I enjoy nothing any more", "question_id": "1091572"},
{"question_content": "Which is better for an episode of acute anxiety-lexapro or cymbalta?", "question_id": "310429"},
{"question_content": "Can medical marijuana help seizures?", "question_id": "244920"},
{"question_content": "Is it true that anti depressants are over prescribed and depression is not always the result of low serotonin? In these cases can the pills make them suicidal?", "question_id": "1179687"},
{"question_content": "What are the differences in side effects between celexa and lexapro?", "question_id": "39151"},
{"question_content": "Feeling depressed towards the end of my pregnancy now after trying to deal with anxiety and panic attacks. Doing therapy. Am i hurting my baby?", "question_id": "6717577"},
{"question_content": "If a 16yo has 2 seizures with eyes rolling and can't be woke up within 2 days 1 neg EEG 1 pos does this mean hes epileptic drs don't know?", "question_id": "650481"},
{"question_content": "Could sleep study be substituted by EEG for sleep problems if ENT doctor didn't suspect OSA.", "question_id": "1426148"},
{"question_content": "If you just starting out with antidepressants, is Zoloft a better option than Effexor? Got Parkinson’s as well", "question_id": "6721396"},
{"question_content": "Is it safe to take Duloxetine (60 mg in the morning) and Buspar (15 mg at bedtime) together, or is it likely to cause serotonin syndrome?", "question_id": "6674929"},
{"question_content": "Was denied zoloft.  Dr. Said it not compatible w my tramadol. Is there any OCD med that is compatible w tramadol and will not put me to sleep so much?", "question_id": "54939"},
{"question_content": "The doctor put my mother on two ssri's. Lexapro  20 mg and added Zoloft 50 mg (in place of abilify). Is this safe? I worry about seratonin syndrome.", "question_id": "592377"},
{"question_content": "Can a elevated blood serotonin level cause you to break out in random rashes?", "question_id": "616568"},
{"question_content": "Is it ok to take Benadryl to treat my allergies? I've tried zyrtec and Claritin but they don't work.", "question_id": "134117"},
{"question_content": "When blow nose, mucus is bloody.  Lots of yellow-green postnasal drip. Some wheeze. No fever.  Take Dymista, Allegra, singulair, qvar, and Ventolin. It's not allergy. Sinusitus?  Go see primary care or wait it out?", "question_id": "1530970"},
{"question_content": "Tsh 1.37 T4 6.9 T3 0.99. Do I jave hypothyroidism?  Constantly tired, weight gain, falljng hair, aching muscles.", "question_id": "1448857"},
{"question_content": "What cough medicine can my child take while taking 50mg Zoloft and 2mg abilify?", "question_id": "1216602"},
{"question_content": "Can you donate blood if you are taking prescription medications?  Klonipin , cymbalta, 1 mg folic acid, singulair, qvar, Ventiolin , nasonex, latuda, trazodone, as well as Allegra, and a multivitamin .", "question_id": "1595118"},
{"question_content": "I have a severe allergy to ibuprofen as well as aspirin. Is vicodin safe to take for a serious migraine?", "question_id": "1509551"},
{"question_content": "I have a 4.5 x 3.5 thyroid nodule: solid, hypervascular. My tgab is at 70 and TSH is 3.15. I am symptomatic.  Is this a cancer marker?", "question_id": "610212"},
{"question_content": "Do solid benign thyroid nodules grow quickly? And could you have normal TSH levels with a solid benign nodule on the thyroid?", "question_id": "74136"},
{"question_content": "Is it common to have a fine needle biopsy of thyroid nodules before surgery?", "question_id": "25859"},
{"question_content": "Have a \"cold\" thyroid nodule <3cm. Dr wants biopsy but i suggest surgery to get it over with.  What do you suggest?", "question_id": "324581"},
{"question_content": "My 4 yr old child has been having a very high fever. I would like to alternate  acetaminophen and ibuprofen. How far apart should they be taken?", "question_id": "619507"},
{"question_content": "What to do if I have a migraine and took 2 Excedrin migraine pill at 7:30am. Still have the migraine!?", "question_id": "1302276"},
{"question_content": "How to calculate the drug dose of ibuprofen and acetaminophen for 2 years old children ? ( I am a pharmacist )", "question_id": "980470"},
{"question_content": "I have had two inconclusive biopsies on a thyroid nodule.Mwhat do you suggest i do?", "question_id": "889265"},
{"question_content": "How long do I have to wait after a nuclear medicine thyroid scan, i-123, to have a fna biopsy and/or thyroid blood tests?", "question_id": "1295213"},
{"question_content": "My 11 month old has many teeth coming out. Three hours ago, i gave her acetaminophen for teething. Can i give her ibuprofen before she sleeps now?", "question_id": "530993"},
{"question_content": "Suffering from migraine, palinopsia, vertigo, nausea, painful joints, fatigue, dry mouth with burning tongue, swollen salivary glands and throat.help ?", "question_id": "1404653"},
{"question_content": "What are the differences between ibuprofen and acetaminophen?", "question_id": "707"},
{"question_content": "Got flu shot on friday. 36 hours later sore throat and headache. No fever . Could this  be immune response to vaccine?", "question_id": "951426"},
{"question_content": "I've been taking 3 Advil/ 6 hours for 10 days due to tooth pain. My dentist recommended Aleve..how long do I wait after taking last dose of advil?", "question_id": "6717265"},
{"question_content": "I have lupus and am remission.  I have a sore on my ear , a fever, a large node in front of my ear and jaw pain. Can a swollen lymph node cause jaw pain.  Dentist said teeth are ok. Derm says ear infec?", "question_id": "907378"},
{"question_content": "My inner ears and top of my throat are very itchy. My nose is blocked and also runny, and eyes are watery. I am not allergic  to anything that I know ?", "question_id": "1434126"},
{"question_content": "Should a 75 year old woman with high blood pressure have brain surgery if the MRI shows a 13 mm aneurism? 75 year old woman, blood pressure and cholesterol levels high, had a stroke in her 40's and recovered fully.  Mri shows 13 mm aneurism, but doctor sa", "question_id": "405501"},
{"question_content": "Could you tell me  if person has atrial fibrillation, is taking metoprolol , Valium as needed .Also now require second medication for high blood pressure which one can go with Valium  above.", "question_id": "566766"},
{"question_content": "Is it normal for my father  to have foot swelling after 1 year from open heart surgery when blood pressure and cholesterol levels are normal?", "question_id": "602618"},
{"question_content": "I'm having a tooth ache, at times I can't tell which one hurts. I also have a headache and congestion. Is this a sinus infection or true tooth ache?", "question_id": "277129"},
{"question_content": "Our 4 year old has a 100.5 fever and complains of pain @ top of his head.  He has no runny nose and no cough/sneezing but is easily fatigued.  What could he have and should we take him to the er?", "question_id": "594261"},
{"question_content": "My blood pressure is 106/66 and my heart rate is 50. I take diltiazem in the morning and metropolol in the evenings. Is this reading OK?", "question_id": "1483344"},
{"question_content": "My 4 mth old  is congested, sneezing, wet cough, runny nose and has ran a fever but low grade. What can I do for her? Can i put vapor rub on her feet?", "question_id": "581391"},
{"question_content": "Runny nose, sneezing, fever of 101.3 and a cough that feels like scraping my lungs/throat with sandpaper.  What could this be? Thanks", "question_id": "1127194"},
{"question_content": "I have a cold for about a 9 days. It is not going away. Green mucus from nose and throat. Blood in nose. Facial pain and cough. Sinus infection?", "question_id": "1553687"},
{"question_content": "I think I've got some allergy as i keep sneezing and hav irritation in my nose and itching in my eyes. It happens around feb-apr every year since 2yrs.", "question_id": "623998"},
{"question_content": "Red tender painful bump on gum near tooth cause? Hist: htn pcos provera zestoretic bad oral hygiene", "question_id": "1119538"},
{"question_content": "Low grade fever, white on back of throat, body aches, congestion, swollen glands & sore ear...What could this be?", "question_id": "980737"},
{"question_content": "My 1 month old has a cough. The doc said it was no more than a slight cold but its getting worse. Sneezing too. No fever or distress. ?", "question_id": "84436"},
{"question_content": "Suffering sinus infection/nostuffed nose,severe toothache&pain over right cheek,ear,nose 5mths now,I'm taking dymista 2W &amoxiclav 1w.Is it effective?", "question_id": "1529132"},
{"question_content": "I've throat pain in right side form 2 month, 1 doctor told its tmj, my ear also pains and some in the jaw also, bt no clicking sound from my jaw, no swallowing problem?", "question_id": "626155"},
{"question_content": "I have sore throat, headache, bodyache, mild fever. Is it a bacterial or viral infection?", "question_id": "195815"},
{"question_content": "Possible i could have oral cancer?  but would your tongue and throat hurt at same time?  i also have ear pain, jaw pain, throat stings hard to swallow", "question_id": "1378609"},
{"question_content": "Woke up this morning sore throat stuffed up nose, cough with green mucus, body ache headache, slight fever.  Should i go to dr or stay home and rest?", "question_id": "1128391"},
{"question_content": "I have tmj. My jaw shifted to the left and i can make sound of my left jaw. There is no pain. I also have a swollen pea sized growth in front of my left ear. What should I do?", "question_id": "548461"},
{"question_content": "Had lower rt wisdom tooth extracted 3 months ago using local. Tooth impacted took 1 1/2 hours to remove. Swollen still, clicking jaw, stuffy ears tmj?", "question_id": "829353"},
{"question_content": "I have swollen glands in my neck, a sore throat,  ears ache and my tonsils areinflamed and covered in white patches. Is this strep throat?", "question_id": "642596"},
{"question_content": "feel pain behind left ear left upper jaw my throat having difficulty in swallowing and my face goes to one side ever since i had molar tooth removed?", "question_id": "1518651"},
{"question_content": "I've had all these symptoms for the past 3 months: nasal congestion, tired, achey body, headaches, dizzy, weak, sore throat, bad breath what could it be?", "question_id": "590458"},
{"question_content": "I have been diagnosed as having gall stones, how long do I have until my gall bladder has to be taken out? I had an attack involving vomiting and rapid bow movement with sevier pains in my abdomen so i went to the emergency room while i was out of town. T", "question_id": "399101"},
{"question_content": "After having both lower wisdom teeth removed, the right side of my neck, throat, and jaw are so painful i can hardly open my mouth or swallow.", "question_id": "620365"},
{"question_content": "WHY??10days after wisdom teeth surgery,PAIN-2 lumps on jaw each side hurt 2touch,still cant open mouth,hurts 2 put pressure on teeth,numb→lip,chin,etc", "question_id": "1359036"},
{"question_content": "Neck has a lump in it&my throat is sore & puffy. The doctor said it's swollen lymph nodes and took a soft tissue scan&nothin showed.Can it be cancer?", "question_id": "1452096"},
{"question_content": "I noticed I have a swollen lymph on the back of my neck just before the hairline should I be worried? I've had a dry cough since last week with body aches and a sore throat. My cough has calmed down a bit my body aches are gone my throat still hurts a lit", "question_id": "400436"},
{"question_content": "Swollen cervical lymph nodes for 5 month now havnt shrunk or grew normal CBC doctors not worried does it mean cancer?", "question_id": "650255"},
{"question_content": "Inflammed tonsils for four months been tested for mono by blood test and been reffered to ENT this happend days after my orthodontist put on braces?", "question_id": "1059691"},
{"question_content": "Wisdom tooth abscessed, and can't open my jaw! how to treat this?", "question_id": "538621"},
{"question_content": "34 wks pregnant. prescribed augmentin for sinus infection but read studies where this drug caused necrotizing enterocolitis.  what should i do?", "question_id": "1364771"},
{"question_content": "3 year old boy with fever for 1 day, cough 3 days, wheeze and runny nose . On xray it says asthmatic bronchitis . Does he need antibiotic ?", "question_id": "950528"},
{"question_content": "How to relieve my two yr old sons cough and stuffy nose? Had to rephrase my last question! No fever or wheezing had symptoms almost 3 weeks now.", "question_id": "1553869"},
{"question_content": "Please the doctors think I have lymphoma are making me go to ENT due to 1 tonsil being 50% bigger than the other-no other symptoms im so scared im crying constantly.My CBC is normal chest/abd CT norma?", "question_id": "1179369"},
{"question_content": "16yr old girl i was told i had bronchitis and have have asthma but I have a painful long cough gasp for air, wheeze, mood swings. Do I have lung cancer?", "question_id": "1216973"},
{"question_content": "Other then asthma what would cause you to wheeze? 33 yr old girl with allergic asthma .", "question_id": "134183"},
{"question_content": "I recently had 2 out of 4 wisdom teeth removed and am experiencing \"lock jaw\". How can I get rid of that asap?", "question_id": "1094942"},
{"question_content": "For almost two months now my throat has been yellow with red veins and white at the roof of my mouth, there are no spots, what could it be?", "question_id": "501328"},
{"question_content": "My 5 yrs old son use ventolin blue colour and brown for his asma.When he sleep he cough frequently and almost out of breath.I am worried?", "question_id": "76955"},
{"question_content": "20 years old.. I got a tooth in the back of my mouth and I get jaw pains sometimes how is wisdom teeth removed will I feel it during ir after.Help?", "question_id": "108489"},
{"question_content": "I got my four wisdom teeth pulled out last week. My jaw still hurts and my first and second upper molar hurts on right side, throbbing pain, is it ok?", "question_id": "1230067"},
{"question_content": "Hi it's 3 weeks since my wisdom tooth extraction. I had earache in my left ear which i did expect but that's gone. Now i can't hear in right ear..", "question_id": "628706"},
{"question_content": "3 yr old has a big swollen lymph node on one side of neck that has been there formonths. Blood work normal.purple circles under eyes?possibilities?", "question_id": "6788402"},
{"question_content": "The dr. Said i had polycolonial gammapathy. I'm 26 with pots and possible autoimmune w/ ANA 1:160 & ESR 29. She said she's sending me to an oncologist which has me really scared! why? Lymphoma? Multiple myleloma? Leukemia?", "question_id": "750237"},
{"question_content": "Top wisdom tooth extracted 10 days ago-irritation b/w it and molar. Now irritation gone but dull cheek & jaw pain, and gums/bone tender above extract.", "question_id": "1556128"},
{"question_content": "No cough or sputum but I have a wheeze and tight chest. Pred. Value spirometry is 83%. Is this COPD or late onset asthma?", "question_id": "675293"},
{"question_content": "Have chronic jaw pain for about 10 years now. Feels weak, throbbing, and tight. wisdom teeth are out. what can be the cause? I massage it w/o relief", "question_id": "1549923"},
{"question_content": "Lower lymph node behind ear is swollen. Have had earaches & drainage, but wisdom teeth are coming in, too. Is it an ear infection or the wisdom teeth?", "question_id": "6734524"},
{"question_content": "How long do I have to wait before i can get braces after having wisdom tooth removal?", "question_id": "498091"},
{"question_content": "Can wisdom teeth cause the bottom teeth to become crooked?", "question_id": "509859"},
{"question_content": "I have small red dots on roof of my mouth toward the back of my throat. My mouth is dry and tongue is red with white coating in parts. My throat hurts?", "question_id": "939282"},
{"question_content": "The upper wisdom teeth in right side began to appear but still not completly .It cause pain in all right side.My eye .My ear .My  jaw. Need help?", "question_id": "1121934"},
{"question_content": "5 days post-op wisdom tooth extraction. Healing perfectly, dentist said i'm doing great.  How to keep food out of the hole/stitches without irrigation syringe. Syringe may cause dry socket he said.", "question_id": "901902"},
{"question_content": "24 male....enlarged submental and submandibular node on both side....molar tooth on both side hurts and infected\nreason?\n.", "question_id": "6635931"},
{"question_content": "How long should I wait to go scuba diving after smoking marijuana?", "question_id": "306833"},
{"question_content": "I have excrutiating pain in my jaw in front of my ear and have swollen glands behind my ear and neck. The pain seems worse after eating. Could this be a parotid salivary gland blockage or cyst? I don't have a fever or any other symptoms and haven't had a", "question_id": "229861"},
{"question_content": "What causes a salivary gland behind my right ear and jaw line to swell ?", "question_id": "954107"},
{"question_content": "The gum around my wisdom tooth has swollen  my cheeks swollen it hurts when I swallow should I see emg dentist or wait till mon?", "question_id": "169961"},
{"question_content": "Is it dangerous to smoke marijuana and breastfeed?", "question_id": "74"},
{"question_content": "Dental cleaning 2 weeks ago got infected tooth. In er last saturday iv antibiotics. Now my cheek and eye socket hurt and very swollen what do i do?", "question_id": "6735172"},
{"question_content": "Can breastfeeding moms smoke synthetic marijuana?", "question_id": "193767"},
{"question_content": "How long will i stay numb after having my wisdom teeth out? I had my wisdom teeth out this morning at 8:30 (it's now 3:00 pm) and still feel a lot of numbness in the back of my mouth. I've never felt numb for this long after going to the dentist. Is somet", "question_id": "400166"},
{"question_content": "I used marijuana before pregnancy to help w/ anxiety & depression (quit while pregnant).  Is it unsafe to use while breastfeeding?", "question_id": "599669"},
{"question_content": "Are there any over-the-counter methods for treating dry socket post-wisdom tooth extraction?", "question_id": "1603842"},
{"question_content": "I had root canal on infected tooth after strong antibiotics, and now my face is very swollen and hurts bad. What do I do?", "question_id": "606462"},
{"question_content": "How to reduce face swollen from infected teeth? Am on antibiotics and my dr adviced me to apply warm cloth on it, am in pain too please help", "question_id": "1062311"},
{"question_content": "I have soar gums they are swollen around back teeth and feel like the are raw it hurts to chew and swallow, and I have no wisdom teeth?", "question_id": "1296232"},
{"question_content": "I quit smoking marijuana before I was 9 weeks pregnant, will my baby be born with THC in it's system?", "question_id": "1408639"},
{"question_content": "My gum is swollen around my wisdom teeth, difficulty swallowing, swollen lymph nodes and a slight headache. Am i okay?", "question_id": "1281867"},
{"question_content": "I have been having some serious bleeding from the gums I have gingivitis and I have recently noticed red itchy bumps on roof of mouth....gingivitis??", "question_id": "6698566"},
{"question_content": "Hard very sm salivary gland stick up and is painful when i press the underside of jaw doesn't happen on other side of mouth though what can this be?", "question_id": "564111"},
{"question_content": "I have been taking antibiotics for infected tooth before the root canal can be started. Should the antibiotics decrease the pain of the infection if it's working?", "question_id": "943163"},
{"question_content": "If you hypertension and mild heartburn, which antibiotics  best to use for healing  tooth root infection after root canal. Clindamycin or amoxicillin?", "question_id": "512741"},
{"question_content": "Are swollen glands common with canker sores? Could I have an infection? I have had a huge canker sore on my cheek now I have a small ones on my tounge, lip, and back near my wisdom tooth and my glands are swollen and feels better after i brush.", "question_id": "399835"},
{"question_content": "Tooth infection not gone after ten days on amoxicillin.  Can I use clyndamycin now to get rid of.?", "question_id": "517275"},
{"question_content": "Swollen cheek impacted wisdom tooth and cyst, pain in side of palate?", "question_id": "728879"},
{"question_content": "I had all 4 wisdom teeth taken out 8 days ago, 2 impacted, 1 half and the other fully exposed- for the last 3 days i've had terrible earaches. Normal?", "question_id": "564949"},
{"question_content": "My gums are receeding, I have trauma, front tooth grinding, my molars are shifting inwards, I have clenching and grindingteeth, soreness in mouth area, biting cheek, and trouble chewing. What should I do?", "question_id": "700097"},
{"question_content": "Had impacted wisdom tooth@cyst removed (upper) under general anesthetic now my palate is tight@painful should this pass? Thanks", "question_id": "772012"},
{"question_content": "How many days after wisdom tooth extraction should I brush at wound site ? For now I only rinse with corsodyl and brush other teeth.", "question_id": "6731803"},
{"question_content": "When can you eat regular food after wisdom tooth extraction.", "question_id": "823450"},
{"question_content": "I had a root canal 2 years ago and now that \"tooth\" is giving me severe pain. My gums are swollen and my face is swollen on one side. ?", "question_id": "1567950"},
{"question_content": "How soon after a lower molar tooth extraction with bone graft and stitches can I chew solid food?", "question_id": "258922"},
{"question_content": "What can cause discomfort or dull pain in tooth next to wisdom tooth extraction site? Less than a week after extraction", "question_id": "1152016"},
{"question_content": "Just lost a crown on my lower back tooth. It already had a root canal couple years ago, the tooth close to gum line, do I have to get a crown now ?", "question_id": "995334"},
{"question_content": "Why do my teeth snap together biting very hard down closed and sometimes biting my inner cheek uncontrollably in my sleep?", "question_id": "856492"},
{"question_content": "Could a cracked root canal tooth cause swollen lymph nodes? Had root canal 5 years ago, pain when chewing.", "question_id": "1568255"},
{"question_content": "Is there maybe a way to remove the scar tissue in my cheeks to prevent further cheek-biting? My teeth are all straight and well cared for.", "question_id": "6674403"},
{"question_content": "I had a root canal 5 days ago. 2 days after I had a pea lump in the gum, no pain but some swelling. Dentist called in Clindamycin. Will this help?", "question_id": "6634031"},
{"question_content": "Can a tooth that is cracked and rotten cause a lymph node behind  my ear to swell and be a little tender?", "question_id": "6761400"},
{"question_content": "I have just been diagnosed with sleep apnea but recently, i woke up to the pain of me biting my tongue. Its never happened before. What should I do?", "question_id": "320142"},
{"question_content": "I saw blood in my stool and i'm completely freaked out. What could it mean? There is colon cancer in the family.", "question_id": "110476"},
{"question_content": "Can lip biting cause oral cancer?  I have it as a habit.", "question_id": "202153"},
{"question_content": "I just had a root canal and the temporary filling at top of tooth fell out. Should i go back to the dentist?", "question_id": "1022257"},
{"question_content": "Had a severe toothache In tooth that was filled 2 years ago. Went to dentist and wanted to do a root canal but could not find anything wrong in x Ray.", "question_id": "6640798"},
{"question_content": "How long does it take a blood clot to dissolve and be replaced by soft tissue after getting your wisdom teeth out?", "question_id": "1436975"},
{"question_content": "Wisdom tooth extraction 2 hrs ago i cant stop bleeding since and my mouth full blood my dentist say it is normal i have big headache what should i do?", "question_id": "1399890"},
{"question_content": "I got a pimple under my bottom eyelid toward the cheek I popped it last night and this morning it is swollen. No pain. What should I do to get rid of?", "question_id": "1484519"},
{"question_content": "Have earache started in the right now in left with mild sore throat and drainage what could this be. Also habe a bad headache?", "question_id": "907332"},
{"question_content": "I'm 18, ex smoker and hookah smoker. I have a lump in my throat, loss of weight and appetite. Dry tongue sore neck. Neck feels swollen. What is this?", "question_id": "940021"},
{"question_content": "I chewed tobacco only a few times in my whole life. Am I going to get mouth cancer?", "question_id": "108052"},
{"question_content": "I had braces to correct underbite. The protrusion is no longer there via teeth extraction. I hear a clicking noise. Will i need surgery to fix tmj?", "question_id": "603631"},
{"question_content": "Whenever i hear my jaw a little bit and i hear a click. Do I have tmj?", "question_id": "1072480"},
{"question_content": "Do braces causes tmj? I had a big problem with my teeth and had to wear braces for 6 years that moved my jaw about 2-3 cm", "question_id": "515053"},
{"question_content": "Left tonsil swollen a little pain left ear little pain when swallow feels like lump in throat. Bad breath nasty taste in mouth?", "question_id": "1568883"},
{"question_content": "Can i get braces if I have dental implants? I'm 35, and would like to get braces. However, I have two dental implants on the upper left side of my jaw due to an accident years ago. Since these implants can't move, does that preclude me from being able to", "question_id": "399521"},
{"question_content": "My jaw tenses up and won't release on one side . It doesn't lock up its just really tight.  Could I have TMJ without the clicking ?", "question_id": "1209112"},
{"question_content": "Can tmj/dental cause tingling numbness in chin, jaw and lips. I have polyneuropathy. Wasn't sure if its that or the dental. I do have dental issues.", "question_id": "833258"},
{"question_content": "How soon after a total knee replacement could someone use a continuous passive motion (cpm) exercise machine?", "question_id": "36692"},
{"question_content": "Can TMJ also cause stiff neck?Jaw line aches, ringing in ears, stiff neck, slight vertigo jaw stiff but can move it fine.Jaw click/cracks is their help", "question_id": "1061385"},
{"question_content": "My jaw keeps clicking. Is this a symptom of TMJ (temporomandibular joint dysfunction)?", "question_id": "544923"},
{"question_content": "Went to ENT checked out  my sores/lesions on tongue and told me it was irritated salivary glands and to eat yogurt and ill be fine. Should i trust?", "question_id": "938343"},
{"question_content": "I got TMJ in my left jaw since 10 years ago. No pain, but i can make sound on it everytime i want. Is threre any solution beside surgery?", "question_id": "324415"},
{"question_content": "At the moment my jaw is at the clicking sound stage where the slipped disc can still pop in and out. Who to see to treat tmj?", "question_id": "702819"},
{"question_content": "Have torn ligaments in knee. Can femur actually slip off the top of the tibia? Could something fracture? Using exercise bike & walking for strength.", "question_id": "122907"},
{"question_content": "My mouth when i open makes a popping sound and my jaw slides over is that TMJ also does TMJ cause permanent hearing loss\r\nthanks?", "question_id": "766266"},
{"question_content": "Rhinoplasty before jaw surgery? I'm 23 and i want to get jaw surgery for my TMJ and asymmetrical face, but want to wait until i'm 25+ to get it.\n\nI'm planning to get rhinoplasty in a couple of weeks, but many have said to get your jaw surgery done first.", "question_id": "398860"},
{"question_content": "What is the typical time for knee swelling  to go away after meniscus arthoscopic and ACL  reconstruction surgery?", "question_id": "222855"},
{"question_content": "Tickling feeling in left ear down neck into left arm. What could cause this? Tmj, partial seizure, anxiety? Jaw has been bothering me today", "question_id": "1100920"},
{"question_content": "I have TMJ and have been living with jaw pain on and off for 2 months now. I opened my mouth a bit wide. Could that cause my jaw to dislocate?", "question_id": "1550514"},
{"question_content": "My moderate overbite is causing tmj; seeking corrective jaw surgery but i can't afford it. What do I do?", "question_id": "1080999"},
{"question_content": "Ten days out surgery to repair both meniscus in left knee, ankle and foot swollen. Sonogram for clot negative. What to do for normal?", "question_id": "823203"},
{"question_content": "I have a displaced fibula fracture roughly 4-5 inches below my knee, The doctor I saw has me on crutches just doing RICE Will I need surgery?", "question_id": "6733551"},
{"question_content": "I have been having a radiating pain in my left arm and jaw and occassional neck pain and back/left shoulder blade pain, for the last 3-4 months. I got an EKG done in june and it was ok. I have been scared for months. What should I do?", "question_id": "920497"},
{"question_content": "What is the recovery time like on corrective jaw surgery / orthodontia?", "question_id": "242850"},
{"question_content": "Can you play football with a  torn ACL if you use a brace and are careful?", "question_id": "36646"},
{"question_content": "How long is the recovery time from corrective surgery for low imperforate anus?", "question_id": "318164"},
{"question_content": "I had knee surgery 4 years ago and i take glucosamine. Is there any other pill that i could take or is that enough. Can i play sports or is that bad?", "question_id": "731096"},
{"question_content": "How much would it cost to get corrective surgery for my big toe?", "question_id": "247534"},
{"question_content": "Are braces required after surgery for the impacted tooth?", "question_id": "269188"},
{"question_content": "Pinching feeling right where my calf and ankle meet in the back of my lower leg?  Sometimes foot cramps as well, pain in knee and thigh.", "question_id": "489802"},
{"question_content": "What is neuroma? I see this word a lot when asking about my recent issue with my right big toe and the swelling of the balls of my right foot. I can't walk or sleep. Please advise.", "question_id": "281976"},
{"question_content": "Im dying of starvation. 6 days after my wisdom teeth surgery. I don't want s dry socket. What do I eat?!?!?", "question_id": "930177"},
{"question_content": "Once my stitches come out from my wisdom teeth surgery, would the pain and swelling go away?", "question_id": "562809"},
{"question_content": "I hurt my foot I have constant pain in my foot I can't walk on it and have pins and needles in my toes there is no swelling ?", "question_id": "1330085"},
{"question_content": "My swelling is almost gone from wisdom teeth, 5th day, when does it completely go down?", "question_id": "288169"},
{"question_content": "My right foot first started swelling under by foot at the base of my middle toe around the distal end of my metatarsal area. It felt as if i was walking on a half of a golf ball. The swelling got worse and now my middle toe is extremely swollen and the ba", "question_id": "289420"},
{"question_content": "How can I make it so i get wisdom teeth swelling down faster?", "question_id": "853238"},
{"question_content": "Should i get crutches i sprained my ankle i can walk as long as i don't bend it at all it hurts even like that its badly bruised and swollen what todo?", "question_id": "800071"},
{"question_content": "If  i had a l5-s1 discectomy in 2009  , could it cause swollen feet and inflamed  in between toes and ankles, can hardly walk short , a lot of back pain?", "question_id": "328926"},
{"question_content": "Dull ache in back top two teeth and slight swelling. Already had wisdom teeth out and everything was clear at my last checkup.Anything to worry about?", "question_id": "1427163"},
{"question_content": "Throat swelling common after wisdom teeth extraction?", "question_id": "174121"},
{"question_content": "My tooth hurt. So i got a root canal done, but it still hurts. I got it extracted with bone grafting. Why does it still hurt? Ialso got my wisdom tooth extracted the same day on the other side of the mouth and I have a dry socket there. Whatshould i do?", "question_id": "551001"},
{"question_content": "Why are my legs red almost like a sunburn, from my knees to my ankles? They aren't swollen & they don't hurt.", "question_id": "728449"},
{"question_content": "Wisdom tooth is aching for last two weeks and have not heard out of ear above said tooth since sore to try to clean ear inside to hear again ?", "question_id": "1238776"},
{"question_content": "I have sharp shooting pain from my hip down through the leg. Sometimes above my knee through the leg feels like it's going through my bone. Could it be sciatica? I've had some tingling too and have been sitting a lot.", "question_id": "842571"},
{"question_content": "Could swollen lymph nodes with normal CBC  in neck be from wisdome tooth extraction  10months ago? Had bad infection & hole in sinuses at the time", "question_id": "587366"},
{"question_content": "Any swelling after wisdom tooth extraction?", "question_id": "334677"},
{"question_content": "I had dry socket about 2 days after getting a tooth extracted last wednesday my dentist cleaned the area and packed it 2 days agoo how long is the swelling in my face and neck going to last i look like I have the mumps and I am still in a lot of pain?", "question_id": "488745"},
{"question_content": "I got one greenpea size non tender lymph node on neck on the side I have wisdom tooth infectn. Seeing dentist soon. Can this lymph node be related to tooth infection?", "question_id": "6694439"},
{"question_content": "When your wisdom teeth are growing in is it normal to have painful brushing with bloody taste in mouth throbbing n sore gums all after brushing?", "question_id": "751523"},
{"question_content": "Abcess tooth extracted. When can I have a bone graft?", "question_id": "1019751"},
{"question_content": "My gingivitis isn't getting any better after using the mouth rinse. Now, gum is swollen around 3 teeth, very tender, and throbbing?", "question_id": "1271191"},
{"question_content": "Excruciating pain on the right side of my mouth. Throbbing jaw pain, tooth aches, sore gums , facial swelling, lips are numb, and a low grade temp.", "question_id": "1381050"},
{"question_content": "I have a haorrible pain on the back lower side of my right leg fron the back of my knee to my heel it is tender to the touch it hurts when I walk?", "question_id": "78579"},
{"question_content": "Why do I get radiating pain/dull ache/nerve pain from my teeth when eating hot or cold, spicy food or even just being outside I have two crowns, one that always bothers me as its always sore and slightly inflammed. My dentist said i need to get my gums cu", "question_id": "392714"},
{"question_content": "The gum around my first pre-molar tooth, on the right side, is sore but there is an obvious red swelling around the area.Could the pain be around the gum area and not the tooth?", "question_id": "902886"},
{"question_content": "Skin rash, month now, skin itches, I scratch, at 1st little bumps would appear, now spreading with raised red lumps with little bumps too, sound like?", "question_id": "6766330"},
{"question_content": "Can sinus cause teeth to ache.Lower and bottom have dull  ache.Bad gums, fibro, herniated disc,  headache, runny nose. Should i see ENT or dentist.", "question_id": "767664"},
{"question_content": "Hey all. Got a sore, red, swollen gum on the left side. No tooth pain or discomfort. Have sinus issues though. Could a sinus infection cause it?", "question_id": "6691103"},
{"question_content": "I have a tooth infection causing swollen gland on one side of throat just started on penicillin when will my throat go back to normal?", "question_id": "1392602"},
{"question_content": "Dentist says nerve damage may have been done during wisdom tooth extraction half of tongue is numb, but is starting to tingle is this a good sign?", "question_id": "491810"},
{"question_content": "Jaw is just really sore. Teeth feel trapped into changing occlusion. Are my teeth moving around? Had light tooth bonding and polishing front teeth set", "question_id": "696590"},
{"question_content": "I punched a woden shelf with my right hand when i lost my temper and my middle finger knuckle is swollen snd i can't squeeze my hand. What happened?", "question_id": "718517"},
{"question_content": "I've had a protruding artery inside my left leg above the knee for several mths/yrs but now varicose veins too lower down. I keep very fit. Any ideas?", "question_id": "528960"},
{"question_content": "I have an infection in my tooth an the dentist cant get me in for another week or two i was wondering if someone could just call me in a antibiotic to bring the swelling down?", "question_id": "6649632"},
{"question_content": "I have lumbar spinal stenosis and have had four back surgeries. I also have nerve damage in my legs and feet.I feel extreme burning and tingling. Now they want to puta spinal cord stimulator (scs) in. Is it a good idea?", "question_id": "754768"},
{"question_content": "Burning pain, tingling, occassional numbness in finger joints or side of fingers?  Nothing seems to help.  Hand and wrist xray'd, no issues there.", "question_id": "987551"},
{"question_content": "How likely is it I have ms?  Eye dr. Said i might after seeing mri.  I have demyelination, 20/50 vision, numb hands, trouble concentrating migraines", "question_id": "508667"},
{"question_content": "ER doc said my 18mnth old has Hand-Foot-Mouth disease but she has bumps around her mouth on hands and feet top and bottem on arms,legs,buttocks,scalp?", "question_id": "1448544"},
{"question_content": "Darkened nipples, light tingly(gas maybe?)like cramps, nausea, food cravings, dizziness, nosebleeds, & sore breasts PMS or pregnancy?Also light bleeding", "question_id": "817656"},
{"question_content": "Shortness of breath, chest pain, burping and farting a lot, cough that won't go away, noisy stomach(not hungry), stomach cramping, i had EKG and chest X-ray 2 weeks ago and they were clear. Is this gerd?", "question_id": "1158246"},
{"question_content": "Will radiation therapy for lung cancer make my father's COPD worse?", "question_id": "39387"},
{"question_content": "I have this nagging soreness above my left rib cage- right below my left breast. It only bothers my when i cough or blow my nose. ?", "question_id": "644627"},
{"question_content": "Had ear infection messed up on antibiotics think its back head hurt eye hurts and looks puffy sinus pressure wont let up?", "question_id": "436115"},
{"question_content": "Does radiation therapy for lung cancer improve survival rates?", "question_id": "39290"},
{"question_content": "My chest X-ray showed low to moderate air trapping.Do I have copd?", "question_id": "1372290"},
{"question_content": "Can radiation therapy cure lung cancer by itself?", "question_id": "39238"},
{"question_content": "Seeing pulmonarologist tomorrow for sob. Chest x-ray, EKG and blood work all normal. Could it be asthma, COPD or emphysema? Gp said lungs sound clear", "question_id": "634148"},
{"question_content": "Can COPD be seen on chest x-ray?", "question_id": "960823"},
{"question_content": "Is it possible to have asthma& have constant lightheadedness as sole sx?Awaken sob, no wheezing. Chest xray shows hyperinflated lungs. Nonsmoker.", "question_id": "1240001"},
{"question_content": "Mom is coughing 2wks, her chest X Ray is ok but she has many cracked blood vessels in the eye, no infection in it. Can it be from coughing. Dangerous?", "question_id": "1466331"},
{"question_content": "Migraines nausea fatigue diarrhea sharp stomach pains inner trembling loss of appetite. Began 5dys ago after vertigo in shower/vomiting. Period in 2wk?", "question_id": "1443822"},
{"question_content": "What could cause my emg of my right leg to show significant nerve damage, but the MRI of my back to be normal? I've had no injuries to either area..", "question_id": "564196"},
{"question_content": "History of lung congestion and phlem from childhood.If I drink smthing cold Im likely to get sore throat,cough,fever.How to improve lung resistance?", "question_id": "1454618"},
{"question_content": "Aafter walking I am belching, chest pain, I am so nervous that I think I have heart attack but I hav normal ecg, 2dechoe, and stress test stomach bloated?", "question_id": "274543"},
{"question_content": "I had a herniated l5- s1 in 2011 and the sciatic pain is gone now.  But since last week i feel tingling and numbness in the middle toe of my left feet. Is this due to herniated disc?", "question_id": "699483"},
{"question_content": "My l4-l5 and S1 are bulging. The pain radiates down my legs and is brutal. I now stand crooked due to it. What can I do to help without using narcotic?", "question_id": "1545586"},
{"question_content": "I had l5-s1 spine fusion and a L4 foraminotomy in several months ago, is there a way to relieve back pain radiating down my left leg?", "question_id": "219919"},
{"question_content": "I have had a constant headache on the right side of my head and behind my eye for about 2 weeks now. It is throbbing pressure, nothing helps, besides coffee or water sometimes. Advice|recommendaaction?", "question_id": "645808"},
{"question_content": "L4-s1 fusion 10 weeks ago. Some symptoms better but now new severe r. Back pain x1mo.  L5,  on the spine to r.  Pain10/10 turning in bed.  Leaning to l. 2° pain. Xrays ok, they insist it's muscle spasm?", "question_id": "696980"},
{"question_content": "40yr fem, had normal stress test, cta chest, EKG, echo norm but dop sugg impair lv relax. Doctor says heart is fine. Holter shows pvc's and pac's isolated. But despite a norm diagnosis my heart flip flops a lot.", "question_id": "908539"},
{"question_content": "I had a decompressive laminectomy at the l3/l4, l4/l5, and l5/s1 on 9/25/12 now when i try to sleep, i wake up everu hour in horrible pain. Why?", "question_id": "524316"},
{"question_content": "My kids have swollen glans or aka sore throat. Do I use? They hate haggling with salt and water. And I have no caffeine free tea. What do I do?", "question_id": "141405"},
{"question_content": "Have been having intervals of numbness and burning in hands feet and lower legs. Seems progressive and more consistent. Ideas of causes?", "question_id": "1440585"},
{"question_content": "I have ddd and herniation at L5 s1 and this along with bulging discs overall the lumbar spine shows on MRI with urinary retention incontinence and fec?", "question_id": "491368"},
{"question_content": "I had back surgery in december, lumbar decompression with laminectiomy at the l4-l5 level. With microdisectomy. Last MRI still shows at posterior disc bulge at the same level. I am still experiencing severe episodes of  burning pain down in my lower extre", "question_id": "274547"},
{"question_content": "I've had sore breasts and nipples for 2 weeks today white thick discharge came out of both nipples. I am spotting a little I am trying to get pregnant?", "question_id": "1544219"},
{"question_content": "Grade2 Spondylolisthesis of L5/S1. Circumferential disc buldge & minimal narrowing of neural formina. Disc buldge impinges S1. Can this cause hip pain?", "question_id": "1454999"},
{"question_content": "I'm 47 with regular cycles. I had sex on the ovulation day. The day after, one day before my aunt flo was due, i got a lot of creamy cervical mucus. I feel tired, my breasts feel full and have mild cramps in the abdomen. Is this a sign of pregnancy?", "question_id": "795297"},
{"question_content": "I have a spinal disc herniation l4-l5 and a severe left leg pain. I'm trying to avoid surgery, doing  exercises, but will it heal on its own? Mri att", "question_id": "1306881"},
{"question_content": "Is it common to have mild trochanteric bursitis, sacroiliac degenerative arthritis and l5-s1 facet arthropathy? What is indicated by this combination?", "question_id": "1014653"},
{"question_content": "What does it mean if the neurosurgeon just recommended laminectomy for l5-s1 herniated disk w/leg sciatica?", "question_id": "223886"},
{"question_content": "Does a epidural injection for low back pain L5 s1 disk herniated usually help in patients? What is the procedure for having a epidural injection?", "question_id": "1025096"},
{"question_content": "Are there non steroidal and non surgical treatments for a l5-s1 disc hernia?", "question_id": "75354"},
{"question_content": "I have disc herniation on S1 and L5 , is surgery the only option, and does  discs  have to be fused?", "question_id": "1376772"},
{"question_content": "What are best the non cirurgical treatments for spinal disc herniation L5 s1?", "question_id": "253649"},
{"question_content": "Pelvic/Transvag sono on 8/22 showed partially ruptured ovarian cyst with small amount of free fluid. Would this cause bloating and abdominal fullness?", "question_id": "1483176"},
{"question_content": "I have tingling feet my MRI shows L5 -s1 bulging disc with mid atrophy of some muscles around l5-4-3 . My doctor tingling feet. Are because of  and this disc hasn't. Caused it. He gave me nortriptilin is my doctor right? I still have tingling feet and som", "question_id": "253223"},
{"question_content": "I had an l5-s1 fusion rev/hardware removal 1 year ago. Therapy done. Why do I still have aching pain in my lt/side hip/iliac crest (tender to touch)?", "question_id": "770461"},
{"question_content": "I started taking my new pack of birth control (yaz) a week late and had unprotected sex three days later. Could I be pregnant?", "question_id": "126082"},
{"question_content": "I did ultrasound and found out a small septated ovarian cyst at my right ovary is it dangerous?", "question_id": "950447"},
{"question_content": "I had a baby 5 months ago, i'm not breast feeding missed periods for 2 months( not pregnant), had brown discharge, i had a ultrasound and they found a cyst on my ovary and cervix. Could this be cancer?", "question_id": "930622"},
{"question_content": "Period 3 weeks late, had 2 days of spotting, cramps, thin milky discharge, abdominal cramps, fatigue. Negative tests. Can i still be pregnant?", "question_id": "1309187"},
{"question_content": "Didnt get my Depo-Provera 6 months ago and i wanted to get pregnant right away. The first month after i got my period and it was just brown and lasted 4 days. Now I am finally  bleeding normally. I tested for ovulation but can't seem to get pregnant. Why?", "question_id": "614901"},
{"question_content": "If you are sexually active and missed your period by 8 days, and you took 3 pregnancy tests that said negative, why wouldn't you  get your period?", "question_id": "1372297"},
{"question_content": "I did not get my periods for two months. I have enlarged and sore breasts, bloated abdomen, pain in upper back, lower abdominal cramping and inner thigh pain. My bloodtest was negative. What should I do?", "question_id": "945177"},
{"question_content": "Faint positive hpt w/ first morn urine, neg dr. Urine test later that day, blood test came back post. Why was drs urine test neg? Early testing?", "question_id": "950752"},
{"question_content": "Had intercourse sperm rubbed off inner walls of vagina but not inside I was two weeks early in period pinkish red but not normal could I be pregnant?", "question_id": "1434255"},
{"question_content": "I am breastfeeding; I do not get my periods. I have headaches, back pain, nausea, increased appetite, cramps, and I have become sensitive to smell. Is it possible that imight be pregnant again?", "question_id": "918160"},
{"question_content": "Really bad headaches (migraine?), dizziness, nausea, trouble concentrating, weakness in arms, changes in vision, etc... Could it be a brain tumor?", "question_id": "333133"},
{"question_content": "Can my girlfriend be pregnant after we had unprotected intercourse for less than 8 seconds? Her period came 1 week late and is light. Bright red blood", "question_id": "254119"},
{"question_content": "I havnt had a period for 9 month and I am not pregnant I have polycystic ovaries is this normal?", "question_id": "170328"},
{"question_content": "Have had spotting 15days before a period was due i'm due in 10days and have cramping in ovaries and nausea and also lower back pain and abdomen pain could this be pregnancy or just period symptoms?", "question_id": "950495"},
{"question_content": "I had unprotected sex 2 days ago, and after having sex im having watery,clear and oderless discharge is it a sign of pregnancy ?", "question_id": "6692368"},
{"question_content": "Very often I have bloody diarrhea with blood clots. I was diagnosed with ibs. Is this  normal or maybe, there's something  else?", "question_id": "559830"},
{"question_content": "I was without IBS symptoms for two years. Suddenly, I have lots of D again plus new problems including constipation, dark red blood with mucus, daily off/on abdominal pain, occasional fever and nausea. I had an EGD done and the GI doctor said no celiac. I", "question_id": "857961"},
{"question_content": "My breast are sore and tender. I have not had my period and my stomach feels fuuy. I took a pregnancy test but it was negative. Could I be pregnant?", "question_id": "71074"},
{"question_content": "Abdominal pain(right side/pelvis), back pain, nausea, weight loss, have hemorrhoids and have seen red blood on tp before. Could it be colon cancer?", "question_id": "1025663"},
{"question_content": "Can colonoscopy transfer cancer cells from a patient with colon cancer to a healthy person?", "question_id": "77169"},
{"question_content": "Every time I eat bell pepper I get bad stomach cramps and diarrhea. Is this a food intolerance?", "question_id": "1444995"},
{"question_content": "Constant watery diarrhea (about once every 30 minutes), fever, excessive sweating, chills, vomiting, dizziness, fatigue?", "question_id": "6732940"},
{"question_content": "My boyfriend and I had sex on 7/19, 7/23, on 7/24 is when I ovulated. I have been having cramping light spotting and extreme bloating am I pregnant?", "question_id": "1429075"},
{"question_content": "Many doctors have said that i might have bad gallbladder because of the chronic back pain, pain in the right shoulder and adominal gnawing. I have had a CT of abdomen and pelvis and ultrasound. Everything appeared ok. Should iget a hida scan done?", "question_id": "940654"},
{"question_content": "Could a \"full\" bladder on CT with contrast of abdomen & pelvis be confused or misread as bladder cancer/tumor/problems?", "question_id": "157754"},
{"question_content": "Can an abdominal CT to rule out kidney stones and other abdominal pain (w/o )contrast detect colon cancer?", "question_id": "1164193"},
{"question_content": "Would colon cancer show up in a abdominal CT scan ?", "question_id": "104794"},
{"question_content": "Constipation after appendectomy, I have my appendix out 4.5 weeks ago and had bad abdomen pain, cramping, like washing machine, wind my stools are loke rabbit pellets would this be my issue for pains?", "question_id": "6734613"},
{"question_content": "Abdominal cat scan show colon cancer?", "question_id": "116442"},
{"question_content": "Have bright red blood in stool, including a lg clot. Now feel nauseated, light headed, and dull pain mid back left side. Should i worry?", "question_id": "856942"},
{"question_content": "What does it mean when you use the restroom and it's blood and blood clots in your stool?", "question_id": "259063"},
{"question_content": "Pain in chest mostly left side. Pain can be dull or sharp . Rapid heartbeat. Pain in left  arm, neck and shoulder. My dr gave me Buspar for anxierty.?", "question_id": "499733"},
{"question_content": "I've had a cough and chest pain for six weeks. The coughing makes me dizzy and i taste blood. What could it be?", "question_id": "343093"},
{"question_content": "I'm due my period today but need to delay this till at least Saturday... Iv been taken Apple cider vinegar and drinking water with lemons in it help?", "question_id": "6707616"},
{"question_content": "Ok so I was like raising my eyebrows and then all the sudden I got what felt like a muscle cramp in my head. Is this normal? My muscle feel tight in my face also. Also got a headache.", "question_id": "6623582"},
{"question_content": "1st EKG abnormal during anxiety attack 2nd normal EKG when calm and normal chest xray showed no  enlargement and my heart was fine why did it say that?", "question_id": "508272"},
{"question_content": "My neck has brown spots, my chest is red and wrinkly, and my face has wrinkles, brown spots, and redness. Should I do fraxel laser or ipl?", "question_id": "906390"},
{"question_content": "Best med(s)/plan for headache:concussion and neck sprain from sports injury? Neuro seen, have tingling back of head, stiff neck, nausea one month later", "question_id": "678705"},
{"question_content": "I had a mild concussion a year ago still have lil symptoms sucn as spaciness, some back headaches, some neck pain. Head tingels will this go away?", "question_id": "200634"},
{"question_content": "Rear-neck/back pain for 2 mths, now less but get random daily tightness in front neck, face, jaw/teeth, arm tingling, headaches esp. When sitting long. Mostly gone when wake up and worsens gradually?", "question_id": "1230669"},
{"question_content": "Diagnosed with mild concussion in  february. Headaches have lessened but throbbing head, slight dizziness still there (can't  exercise) what to do?", "question_id": "881949"},
{"question_content": "Heart cath negative 2 years ago, ecg, ekgs countless visits to the ER and other drs.  Feel like i can't get a deep breath in. Even worse when trying t exercise.  Something more or just anxiety?", "question_id": "919258"},
{"question_content": "When 62, i fell, hit my head on the tub and had concussion.  Since, I have had neck pain. Told I have arthritis. Never had pain until this happened.  Is this normal?", "question_id": "1028449"},
{"question_content": "What can I expect after a wisdom tooth extraction for a tooth that’s a bony impaction? My oral surgeon says that means the tooth is surrounded by bone, so he’ll need to cut into my jaw bone. That sounds really painful. Will I have a long recovery? How wil", "question_id": "390784"},
{"question_content": "Was yesterday in the ER because. of chest pain, low diuresis and low BP(I have high BP).ECG normal, Troponins and Urine normal. Ended me home.BP persist low (105-65).What could that be? I don't feel dizzy.Txs", "question_id": "1196252"},
{"question_content": "Sternum feels tight little ache can't seem to fill my lungs also aches when I lean my head back and sometimes makes me cough ?", "question_id": "1440534"},
{"question_content": "What are the pros and cons of having a general dentist vs a oral surgeon to do wisdom teeth extraction?", "question_id": "361903"},
{"question_content": "Three concussions in past twelve months and  persistent headaches since the last one (two months ago), and painful ear pressure when I shake my head?", "question_id": "1337139"},
{"question_content": "I've been having really and headaches for a while then I hit my head and got a concussion & it's gone but I still have terrible head aches ?", "question_id": "1569103"},
{"question_content": "How do I get over my health anxiety..Particularly heart anxiety?..My ekgs..Echo . Stress test came back normal along with my blood work..Help?!", "question_id": "1028023"},
{"question_content": "Hello doctors. Can a biopsy of chest lymph nodes cause a collapsed lung?", "question_id": "338508"},
{"question_content": "8 year old with daily head aches, an e.E.G. Showing absence seizures; past head injury and concussion.  What to request from paediatric neurologist?", "question_id": "333843"},
{"question_content": "Took augmentin for 7 days then clindamycim for 7 days based on oral surgeon recommendation, still have tooth infection, what's next? See doc soon. Tks", "question_id": "6698061"},
{"question_content": "I have an infection that keeps coming back from broken teeth. I need to see a dentist but can't get in right away. Im on augmentin. The 4th med so far.", "question_id": "856728"},
{"question_content": "Tissues in face still swollen after a bad tooth infection. Augmentin helped infection in gums but face tissue still swollen.Why? How can I treat it?", "question_id": "1238827"},
{"question_content": "My brother in law is in the hospital with a collapsed lung. They put a tube in his chest and he is going for his second surgery tomorrow. ?", "question_id": "319714"},
{"question_content": "I found out during a CT heart angio in may that I have a 4 mm calcified nodule, possibly on my intrapulmonary lymph gland. I am worried that it's lung cancer. I did not do a follow up. What should I do?", "question_id": "919657"},
{"question_content": "I hear weird thumping sound in my ear. I don't think it's a sound of heartbeat, because it's usually very fast. Thoughts?", "question_id": "45927"},
{"question_content": "I am a lung cancer servivor of 15 years I have had bronchitus since mid july I have had a chest xray and a cat scan and my lungs are fine my cancer treatment was surgery to remove top lobe of left lung and 6 and a half weeks of radiiation?", "question_id": "285513"},
{"question_content": "Ct scan showed very small lung nodule. I've had 3 chest x-rays prior and nothing showed on them. What happens now? How to determine if it's cancer?", "question_id": "1030895"},
{"question_content": "Old silver tooth fillings have stained my gums. Is there a way to remove the stains?", "question_id": "532577"},
{"question_content": "Experiencing tooth sensitivity a week after I had two fillings replaced. Is this normal or am I experiencing this sensitivity due to my receding gums?", "question_id": "1330029"},
{"question_content": "Filling a month ago, sensitive to cold only. dentist said that is ok if not sensitive to hot also. does that sound right?", "question_id": "1389378"},
{"question_content": "I had a filling fall out of my tooth some months back and now I have noticed that my gums have filled in the hole is this normal i need to know whether or not this is bad my filling fell out and my gum seems to hav filled in the hold that the filling had", "question_id": "408119"},
{"question_content": "Almost 2 months after a tooth filling I have sensitivity only when i bite crunchy things no pain at all, is it normal?", "question_id": "1028928"},
{"question_content": "Dentist did a quick cleaning of tarter on my front teeth before doing filling else, updated_at = now() where. Now i find one of the front teeth has become very sensitive. What do I do?", "question_id": "598187"},
{"question_content": "My CT scan showed faint ild. I went to a lung dr and he said my pulmonary function test showed asthma not ild. What should I do?", "question_id": "884290"},
{"question_content": "Have pain in my shoulder, when i press it radiates to my head. Having  dull headaches in back of head...Brain tumor?", "question_id": "619623"},
{"question_content": "None productive cough 7week, no worse at night than day,smoke 1 day a week,chest xray all clear,some sneezing and heartburn age 30 scared lung cancer!", "question_id": "1507350"},
{"question_content": "My back teeth keep chipping.What would a dentist do to stop this.My wisdom teeth are 90% through.I have very good oral hygiene and have no fillings?", "question_id": "87735"},
{"question_content": "Why is the dental abscess getting worse during treatment? I have a tooth with a large cavity. It had a filling in it, but the filling got loose and before i had a chance to have it fixed i got a dental abscess.The filling was removed so the tooth could dr", "question_id": "401597"},
{"question_content": "Can fillings cause discoloration on my gums? I had a silver filling used to fill a cavity, and now the gum next to it looks like it is turning bluish or something. I don't know what's going on. Should i see my dentist?\n\n\n.", "question_id": "406194"},
{"question_content": "Does dental bonding work for filling in cavities? I've read that you can have a dental bonding procedure performed to fill in cavities. Is this true? Are there any advantages to it over regular fillings?\n\n\n.", "question_id": "398610"},
{"question_content": "I had MRI of throastic in june and in august chest x ray. Mid upper back still hurting. Could they of missed cancer?", "question_id": "331558"},
{"question_content": "Silver fillings in teeth have been sensitive,  does that mean cavities underneath?", "question_id": "216466"},
{"question_content": "My teeth are so sensitive it hurts to eat. I have no fillings or known cavities. What do I do?", "question_id": "628252"},
{"question_content": "I have tooth pain 3 mos. After cavity filling. Dr. Examined it, saw nothing wrong, but pain persists. Seems to travel since i can't tell which tooth is?", "question_id": "548544"},
{"question_content": "What can I do to treat tooth pain after getting composite filling into cavities?", "question_id": "235219"},
{"question_content": "Old root canal without crown now has cavity. Should i opt for crown lengthening with filling and crown or pull it and get an implant?", "question_id": "828291"},
{"question_content": "Sed rate 30. Cbc ok. Urine ok. Metabolic ok. Ana+ speckled 1:640. Serum protein ok. Up back pain one year w/ right flank pain. Could it be cancer? Lupus panel neg. Rheum drs dismissed me.", "question_id": "831160"},
{"question_content": "How does not filling a cavity lead to tooth loss?", "question_id": "201812"},
{"question_content": "13 year old has deep cavity... Dentist says she needs a root canal. Is that safe? She'd have to get a silver crown. Is it better to just pull it?", "question_id": "1053001"},
{"question_content": "I have been sick with a bad cold/cough for 10 days. Im on prednisone, amoxicillin, albuterol, nose spray & robittusin. I have asthma and a wheeze when i breathe/cough. What can I do to help it?", "question_id": "722131"},
{"question_content": "I have tightness in my chest and a dry cough that wont go away. Had xray pa said bronchitis. Given antibiotics Still no help. Could I have lymphoma?", "question_id": "1541892"},
{"question_content": "My 7 month old has an ear infection an seems to be getting worse. Now has a deep cough and sounds painful, runny nose and a fever and very fussy.", "question_id": "553178"},
{"question_content": "Hard to breathe, chest Xray \"clear\" but never heard back from dr, Advair helped, still need to take big inhales to breathe. No smoking. Lung cancer?", "question_id": "1455270"},
{"question_content": "Had 2 ekgs this year still having chest pains today on left side on the breast when i stand up and walk around like a tightening b pain burns a little?", "question_id": "1240084"},
{"question_content": "Sore throat cough mucous chest pain fever and chills \n?", "question_id": "1497248"},
{"question_content": "Is it normal to have mouth ulcer outbreak after a dental cleaning or cavity filling ?", "question_id": "113844"},
{"question_content": "I had a filling on 4-2. One on each side. I had no pain or issues and had no idea i had two cavities.  Since the fillings one side hurts when i chew.", "question_id": "678189"},
{"question_content": "Can you have breast augmentation if you have high blood pressure?", "question_id": "38078"},
{"question_content": "Am loosing wt(5 kg in 3mnths) have upper back and shoulder pain 2 mnths which gets better with massage and rest, pains on touch. Chest CT is normal, am a smoker, can this be lung cancer?", "question_id": "990555"},
{"question_content": "So my doctor prescribed me with Fluticasone and ProAir HFA Albuterol for easier breathing at night. I don't have asthma. Is it bad?", "question_id": "6739946"},
{"question_content": "Do i need to go to a doctor and get an antibiotic? Lymph nodes are swollen for about two weeks   no fever no redness   pain started in left ear two weeks ago   right side was swollen   about a week ago   the left side started swelling   there is drainage", "question_id": "394369"},
{"question_content": "Scared of cancer lumpy breast and numbness and tingling feels like there is movement in my breast right one itchy armpit and yellow discharge help?", "question_id": "1294070"},
{"question_content": "Why won't someone tell me what's wrong with me.Help night sweats 100 fever always hair falling out sore on head.legs heavy painful. Can't catch breath always tired. Memory going. Pain lump on shoulder?", "question_id": "1380050"},
{"question_content": "Pain in the shoulder, arm, and scapula as well as pain in the back while bendng the neck forward. ~3 minutes of chest CT scan, normal 2 months ago; smoker; worried about pancoast tumor. Is a repeat chest CT scan necessary?", "question_id": "1044463"},
{"question_content": "Light headache mid forehead, sore hips/low back,  and 101F fever for 1 day, trouble sleeping last 4 days, 1 swollen tonsil last 4 months.  Anything?", "question_id": "1442505"},
{"question_content": "I have had an earache in my ear for a while now. It is not painful, just a constant dull, warm feeling. I also havestiffness in my neck and shoulder. What could it be?", "question_id": "600220"},
{"question_content": "How can you tell a normal lump under a guy's nipple vs. A symptom of male breast cancer?", "question_id": "145564"},
{"question_content": "Abdomen pain, tender to touch for about a week, esp after eating. Bms seem normal. No nausea/vomiting. Burping has subsided. Some hunger after meals despite discomfort. Could this be an ulcer or what?", "question_id": "930553"},
{"question_content": "Hard and solid lump under my right nipple. Is this breast cancer?", "question_id": "105038"},
{"question_content": "I have a lump in my right breast. How can I get help quickly and not wait in a long line for a mammogram?", "question_id": "53656"},
{"question_content": "I have a breast lump on the outer right, by the year  2009 I have undergone  mammogram and found out the size was 4/4/10mm. Is there any cure for this?", "question_id": "598216"},
{"question_content": "My mammogram report results came back birads 4 but my sonogram report came back negative so why does my doctor recommend a  breast biopsy?", "question_id": "323732"},
{"question_content": "Ultrasound showed benign cysts on breast.. Will they go away? Any idea why they didn't show up on mammogram only ultrasound?", "question_id": "1069924"},
{"question_content": "What causes a sharp 5 second pain from center of chest between breasts straight across to right chest/breast?feels almost electric.PCP says not heart.", "question_id": "1479585"},
{"question_content": "Low back pain, no other sx.No uti, kidney stones, etc.Dr. Wants to send me for mri, but hasn't checked blood, etc.Is this standard for healthy 32 yo?", "question_id": "1052452"},
{"question_content": "Nero found lesions on my mri. Said i probably have ms. Tomorrow i'm having a cystoscopy for blood in urine. Are MS and bladder problems linked.", "question_id": "1262580"},
{"question_content": "I have very dense, cystic breasts. I just had my yearly digital mammogram and it was inconclusive. Should I write my will?", "question_id": "149922"},
{"question_content": "When should young women go in for a mammogram done to detect for breast cancer?", "question_id": "354083"},
{"question_content": "I think i may have a urinary tract infection. It hurts to urinate and my urine is faded and had a strong odor. What do I do?", "question_id": "370055"},
{"question_content": "My mother had breast cancer at 48. I  37 andy doctor recommended me to get a mammogram.   Is it a baseline check and or necessary?", "question_id": "848926"},
{"question_content": "Discharge thats thick n white  inches a lil could this be are yeast infection hurts a lil like a UTI I've only been with my husband shouldn't be std?", "question_id": "1522239"},
{"question_content": "Been to neurologist had clear blood tests, EEG and mri. Suffering from something undiagnosed which is similar to dementia and MS what else can be done?", "question_id": "1184670"},
{"question_content": "Had only little blood in urine. Bloodwork normal, CT scan normal. Dr at ER put me on antibiotics for uti? Been nauseous, ab pain, back pain, don't want to eat. How long til I get back to no nausea or pain?", "question_id": "182204"},
{"question_content": "Can mammograms detect all kinds of breast cancers?", "question_id": "39223"},
{"question_content": "Breast cancer is so rampant that i believe mammograms are the causation. Where could i verify this information?", "question_id": "745031"},
{"question_content": "Headache and dyasthesia for 1year. Neuro thinks migraines. Brain Mri normal and bloods. Liver Alt 67. Worried about ms. Would MS show on Mri?", "question_id": "1485895"},
{"question_content": "Could a mammogram before 40 increase risk for breast cancer?", "question_id": "703410"},
{"question_content": "I have been having some MS like symptoms. Mri shows brain stem lesions n fluid on optic nerve sheaths. Could this be ms?", "question_id": "261109"},
{"question_content": "Why do doctors ask for both mammogram and ultra sound for the breast?", "question_id": "1603386"},
{"question_content": "I had echo for a new heart murmur that appeared 6 months ago. I was told that I am fine. I have fatigue, fever, splinter nail hemorrhages and blood+protein in the urine. Could it still be endocarditis despite the normal echo?", "question_id": "789211"},
{"question_content": "How is a diagnosis of MS supported by an MRI of the brain and the spine?", "question_id": "22736"},
{"question_content": "Does MS lesions on the brain come and go?I am getting an MRI tomorrow tho i had an acute flare up a month ago", "question_id": "727723"},
{"question_content": "One nipple suddenly seems larger and I notice visible veins on that breast only.I'm only 39 and am not pregnant.Should I get a mammogram asap?Cancer?", "question_id": "1474506"},
{"question_content": "How do you do a mammogram on aa breasts?", "question_id": "95928"},
{"question_content": "What kind of physician should I see for a breast exam or mammogram?", "question_id": "215456"},
{"question_content": "Can your breasts to be too small to get a mammogram?", "question_id": "498171"},
{"question_content": "I had dreams that more lumps developed in my breasts. What should I do? Mammogram?", "question_id": "107353"},
{"question_content": "Should i get a mammogram i'm 27 and i been having pain in one of my breast and its usually off and on but it goes away but lately it hurts more?", "question_id": "329771"},
{"question_content": "Is clinical breast exam needed before mammogram? Considering cost, I think should be done.", "question_id": "94195"},
{"question_content": "I have lhermitte's but normal neuro and brain/neck mri. Neuro says its not ms, but symptom intensifies with exercise. Is this ms?", "question_id": "918245"},
{"question_content": "Can having too much sex cause a yeast infection? I was having sex 2 to 3 times a day (young and a newlywed). I did pee after to prevent uti.", "question_id": "1445639"},
{"question_content": "Doctors can you tell me how often should women get a mammogram?", "question_id": "95105"},
{"question_content": "When stage 4 breast cancer has mets to lung, brain, adrenal, and now liver with no chemo how long can one live w/o chemo and radiation?", "question_id": "856691"},
{"question_content": "Is it likely that this is breast cancer if they call you back for x-rays after a mammogram?", "question_id": "107492"},
{"question_content": "Would signs of breast cancer show up on a regular chest ex ray or would that only show up on a mammogram?", "question_id": "634208"},
{"question_content": "Advanced lobular breast cancer. What is the success rate when a mastectomy, 3rd generation chemotherapy and radiation is done?", "question_id": "613167"},
{"question_content": "Can a high fever for several days with no other symptoms be an MS exacerbation?", "question_id": "87998"},
{"question_content": "I have a family history of breast cancer and would like to know when my mammograms should start?", "question_id": "116315"},
{"question_content": "Could pain under the right rib cage radiating to the back be liver trouble?  I had gall bladder removal about 7 years ago.", "question_id": "548080"},
{"question_content": "Should I have a mammogram? I am 31, have had a fibroadenoma removed several years ago and no family history of breast cancer.", "question_id": "1226888"},
{"question_content": "Diagnosed with breast cancer at 23 and had a double mastectomy at 25. What can I do to prevent my panick attacks?", "question_id": "544199"},
{"question_content": "Since Nov. LLQ pain on palp. near hip bone, intermit trace blood and protein in urine, intermittent upper abdomen pain , fatty liver, low back pain. CT scheduled, worried about pancreatic. cancer or other. ideas?", "question_id": "626936"},
{"question_content": "My mother has stage 4 rare breast cancer, just got double mastectomy, i've read about the incredible benefits of coq10, input?", "question_id": "633201"},
{"question_content": "My left breast is sore, im 22, not pregnant not on period not on borth control, my grandmother died of breast cancer at 60, how do I check for it/what could be wrong?", "question_id": "320302"},
{"question_content": "Abdominal pain for a few months nothing is helping gagging nausea vomiting stabbing pain right and middle upper abdomen Elevated bilirubin no appetitefor 6 going on 7 days can't hold food down at all?", "question_id": "1319044"},
{"question_content": "Painless throat swelling w/ diff. Swallowing w/hard swollen painless lymph nodes at multiple sites, airway feels obstructed.Other symptoms incl. Dry eyes+pain+photophobia, dry mouth, joint pain. Help?", "question_id": "628686"},
{"question_content": "My 2 yr daughter has a fever and has swollen lymph nodes and red throat with white spots and now has mouth sores. Does that sound like strep throat ?", "question_id": "174381"},
{"question_content": "Swollen glands with severe pain, dry mouth, and difficulty  swallowing?", "question_id": "492048"},
{"question_content": "Is it safe to get the flu and pneumonia shots at the same time or do they have to be given seprately? I am 6 months pregnant and have severe asthma.", "question_id": "903794"},
{"question_content": "I am 30w pregnant, just had my flu + pneumonia shots. The p.A. Recommended for me the dtap shot for whooping cough too. Should i get it?", "question_id": "939412"},
{"question_content": "Slightly sore throat, body achs, runny nose, ears hurt ...Flu or cold?", "question_id": "1162708"},
{"question_content": "My husband has asthma and is sick with high fever and vomiting could he have the flu and should he go to the hospital?", "question_id": "6612681"},
{"question_content": "How is it that I can get the h1n1 swine flu vaccine if I have an egg allergy?", "question_id": "20264"},
{"question_content": "I am being told not to breast feed for 64 hours after my nuclear stress. Do i need to pump the milk out or will it cycle out?", "question_id": "1007706"},
{"question_content": "What is the harm in feeding my baby breast milk and one formula milk at night?", "question_id": "338935"},
{"question_content": "My daughter is 3 months old and I am exclusively breast feeding. Have had bad uterine cramps but having no period. Is this normal?", "question_id": "1479577"},
{"question_content": "My son has mild jaundice, now 2 weeks his age and still didn't go. Weight still same as 2.7 kg. Wet diapers 4 per day. Stool irregular. Exc breast milk?", "question_id": "344835"},
{"question_content": "Anyone with a stye like thing on your eye during pregnancy. It is a small red lump/spot near my tear duct. I've been prescribed fusidic acid ointment?", "question_id": "1221519"},
{"question_content": "Since having asthma and ankle trauma in October I have trouble sleeping due to chest tightness and pain which have seen several doctors over the period but still nothing helping was fine before?", "question_id": "6612744"},
{"question_content": "I had UTI several times. I experience pain in my testicles after urination and sometimes there is swelling in the veins on my testes. I got a culture done and it had E.coli; there are pus cells in semen and urine. Any treatment?", "question_id": "951330"},
{"question_content": "I had UTI several times. I experience pain in my testicles after urination and sometimes there is swelling in the veins on my testes. I got a culture done and it had E.coli; there are pus cells in semen and urine. Any treatment?", "question_id": "1039252"},
{"question_content": "I am on a topical antibiotic for my eye. I have now developed 2 styes, same eye. The stye on my lower lid has a swollen pouch under it, what is it?", "question_id": "507992"},
{"question_content": "My sister is 14 almost 15 and she has two internal styes one in each eye they've been there for about a week do you think she should see a doctor?", "question_id": "1232154"},
{"question_content": "I have penile discharge, feel like I have to pee! STD tests came out neg. Also negative on culture & sensitivity exam. Can it be trich? If not what?", "question_id": "714969"},
{"question_content": "The urine tube in me penis is itching-burning\nWhat medicine can Inuse?", "question_id": "1455668"},
{"question_content": "Is there a correlation between asthma and eczema?", "question_id": "58011"},
{"question_content": "I've had several echos, stress tests, ekgs, and mri. Is that enough testing to find out if I have heart failure?  I have pvcs, tachy & new symp sob.", "question_id": "281751"},
{"question_content": "I am 32 years old and was told that I have age related macular degeneration. Is there a way that I can save my vision?", "question_id": "30295"},
{"question_content": "What exactly is macular degeneration?", "question_id": "14378"},
{"question_content": "My four year old has always had sensitive skin. At times, she breaks out with a flat pink/red dry looking rash clustered mostly on her face, behind her knees, legs and in the folds of her arms on the front side of her elbows. Could it be pediatric eczema?", "question_id": "388188"},
{"question_content": "My scalp is very itchy. I have used every dandruff shampoo at the drug store and it makes it worse. I do have very mild psoriasis on my knee and foot. Could they be related?", "question_id": "848440"},
{"question_content": "Is there a difference between macular degeneration and age-related macular degeneration?", "question_id": "14379"},
{"question_content": "Lumps on the scalp that are very itchy also dandruff any explanation?", "question_id": "1199426"},
{"question_content": "I have an enlarged lymph node near my jaw. I have earaches and I also feel pain in my legs, arms, feet, and hands.  Could it be HIV or some other dise?", "question_id": "252857"},
{"question_content": "I seem to get a red blotchy rash on my chest everyday and it get really warm and can't seem to find the cause of it ?", "question_id": "1556249"},
{"question_content": "Itchy pink blotches on scalp for 3 weeks. Dermatologists don't think it's psoriasis & it doesn't really look like psoriasis. Have used steroid cream for 2 weeks but it hasn't changed. What could it be", "question_id": "1292429"},
{"question_content": "Could type two diabetes cause a maculopapular rash on your face arms and legs that is occasionally itchy?", "question_id": "864225"},
{"question_content": "I have numbness, tingling and pain in my face, feet and arms. My feet fall asleep several times a day. My eeg, emg, brain and cs MRI were negative. Why did my nerve tests show normal?", "question_id": "511289"},
{"question_content": "My son has rashes on his tummy, back, arms, and also has little red spots on his face. He has had the chicken pix vaccine. He has fever and bad cough ?", "question_id": "131665"},
{"question_content": "HAVING RIGHT LOWER BACK PAIN.URINE TEST SPECIFIC GRAVITY 1.030 BLOOD MODERN  PH 5.5 UROBILINOGEN 2MG/DO DR SAID POSSIBLE KIDNEY STONES.  WAITING CT?", "question_id": "1402530"},
{"question_content": "Just had normal mri/mra of neck, carotid, posterior fossa - now numbness face, then arm, now legs. Should i worry about stroke?", "question_id": "1210643"},
{"question_content": "I have athlete and fungus feet but now my heel is itchy and has red bump or rash looking and itchy why?", "question_id": "957248"},
{"question_content": "Chance of MS if MRI w/ and w/o contrast was negative1 year ago? And can one still live a full almost ordinary life with ms? I have p.O.T.S but ? Ms , tingly feet, left hand, twitching, neg for neuritis", "question_id": "1069861"},
{"question_content": "Can shingles normally on left shoulder, but  without an outbreak right now, cause the arm to go numb and cause dizzy, light-headedness?", "question_id": "6625640"},
{"question_content": "I have a bruise like blotch that seems to be under my skin, it appeared over night on the top of my breast, what are the symptoms of skin cancer etc?", "question_id": "1025804"},
{"question_content": "I have a itchy circle on my leg it's red and it has 3 bumps in the middle.... What could that be?", "question_id": "1222235"},
{"question_content": "My daughter has a bunch of small bumps on her belly there not red or itchy there not blisters, more like pencil head size, lots of them and they look kinda of like white bumps any idea what this could be?", "question_id": "398322"},
{"question_content": "Stuffy nose started of as a sore throat throat still feels a little dry not to bad but now I have a cough and really light green mucus?", "question_id": "1552296"},
{"question_content": "Why isn't my doctor concerned about my current blood pressure reading of 180/110? I feel okay, with no headache or dizziness but I am under significant stress.", "question_id": "1052023"},
{"question_content": "Will it be visible to the people around me that i've had a mesotherapy treatment? I work as a news anchor, so my appearance is very important. I'm hoping to get rid of some acne scars and wrinkles on my cheeks. Will mesotherapy leave any bruising? If so,", "question_id": "383621"},
{"question_content": "I've been feeling dizzy while sitting and walking for months. Can this be a ear infection? Stress? Or optical? Blood pressure is controlled", "question_id": "1164252"},
{"question_content": "I have a constant reoccuring ear infection that causes frequent ringing. Leading to dizziness and motion sickness. What home remedies are there?", "question_id": "55200"},
{"question_content": "I have had migraine headaches for years. My last 3 headaches have come with facial numbness and dizziness, a new symptom for me. Is this normal or should I be alarmed?", "question_id": "193700"},
{"question_content": "Need to know..what is syphilis risk of a guy touching his penis with sores and then fingering you?", "question_id": "1571648"},
{"question_content": "Besides ringworm what kind of rash can cause a red circle  with a wart like skin tag on the breast area? It showed up over night", "question_id": "55161"},
{"question_content": "My 8 year old son is having seasonal allergies. I am giving him childrens Claritin but was wondering if he can also have childrens Benadryl ?", "question_id": "91989"},
{"question_content": "Can fibroadenomas turn into breast cancer?", "question_id": "24862"},
{"question_content": "Is a fibroadenoma a type of breast cancer?", "question_id": "24982"},
{"question_content": "My breast been feeling itchy \\u0026#40;Nipples\\u0026#41; I've been having the mild cramps I've been takin naps more than offend VERY thirsty 10DPO could I be pregnant?", "question_id": "1433005"},
{"question_content": "Is it normal to feel a little itchy by the vaginal area before a period? I am not having any discharge at all. Is it a yeast infection?", "question_id": "1165374"},
{"question_content": "I have got my first period since my delivery; I am 12 months post partum, after my third child. I have been bleeding foralmost three weeks. Now, my vagina is swollen shut and is itchy. I did not have any sexual contact. What's wrong?", "question_id": "926586"},
{"question_content": "What is the best way to treat a vaginal yeast infection/ itching/burning?", "question_id": "123065"},
{"question_content": "Itching Inside and around vagina have small bumps and feel sore wit a larger bump is this herpes?", "question_id": "1401759"},
{"question_content": "Reoccuring 1 canker sore in the same spot, I got tested for herpes 2 months ago and they came back negative, what is it?", "question_id": "1422117"},
{"question_content": "I have Autioimmune disease not sexually active  I'm a virgin I have what I think is a genital boil it fills with puss when it pops blood comes out of it very little white pus I currently had  one it popped I got another right below help??", "question_id": "6751758"},
{"question_content": "Have one sore red spot on the inner lip of my vagina. It hurt lots initially but is better after a few days. Could it be herpes or would it get worse?", "question_id": "128345"},
{"question_content": "How long can I put triple antibiotic on a popped pus pimple?I am also on oral antibiotics. There is a red bump on my lower back and it itches after 3 days.", "question_id": "357363"},
{"question_content": "A girl gave me a blowjob, then she kissed me, then i gave her oral sex. My penis never touched her vagina and i ejaculated in her mouth.  Could she be pregnant? Her period ended last monday.", "question_id": "1251763"},
{"question_content": "I have found a pea sized lump on the outside of my vagina at the bottom. what could it br? its not sore no redness", "question_id": "1401924"},
{"question_content": "I have small extremely itch bumps leaking yellow and crusting around my nose, chin, forehead a bit on my cheeks. my neck itches around jawline. ideas?", "question_id": "6643401"},
{"question_content": "Besides breast cancer/lymphoma, what else causes a hard, immovable, non-tender lump under collarbone in area of infraclavicular node on left side? Thx", "question_id": "1413393"},
{"question_content": "Appt scheduled but having vaginal discharge,  slight odor & bad itching/burning around prepuce of clitoris but no burning when urinating, STD maybe?", "question_id": "1453479"},
{"question_content": "My son is 6years old he has a swollen finger it's red and warm. He said it itches. What should I do?", "question_id": "850688"},
{"question_content": "A girl gave me a blowjob and i came in her mouth. Could she be pregnant?", "question_id": "1505539"},
{"question_content": "I am 36.2 weeks pregnant with boy/girl twins, and have puppp all over my body, what can I use or do to control it. ?", "question_id": "486518"},
{"question_content": "I noticed a white spoy on my iris. It itches and is very red my eye also wont stop watering. Is this an emergency?", "question_id": "693418"},
{"question_content": "Tbree days ago eyes hurt.Last nite got migraine.Imitrx helped.Now back of head and neck feels like it burning hot.What is it? Body is freezing", "question_id": "1006475"},
{"question_content": "I am weaning off Klonopin and have Lupus. I have had a severe headache for a week. My temples, eyes, the region below the ears and the back of head hurt. I have never had this before and it worsens in light. Should I see a doctor or wait for it to pass?", "question_id": "810355"},
{"question_content": "I've been dealing with strange headaches for years. The pain is on the top and around my head. I also have ear as well as neck pain. What should I do?", "question_id": "917288"},
{"question_content": "My friends left ankle is swollen to the point it caused splitting and red tenderness on the ackelise tendon he also have red dots that look like ingrown hairs or pimples spreading upwords between ball of foot and lower shin painful feels better or at leas", "question_id": "6740324"},
{"question_content": "I am 19 years old and I have been shaving my private area since I was was 16 and it has left me with ingrown hairs which caused scarring. It definitely makes me insecure about going swimming or even changing clothes . Do you know of any way to get rid of", "question_id": "6705676"},
{"question_content": "Can a cardiac issue cause everyday head pressure, throbbing vessels in the back of head, and numb brain feeling?  Or should I stick with neurology ?", "question_id": "760185"},
{"question_content": "I have neck pain, fluid behind ear, swollen glands in neck and cold sore all on the right side.  Dr. Put me on amoxil and steriods. Is this normal?", "question_id": "1273448"},
{"question_content": "I've had a lump in my neck for 4 years. It causes a sharp pain in my ear & headaches. My gp and an ENT recommended just ibuprofen. It doesn't help so?", "question_id": "788946"},
{"question_content": "Intermittent throbbing headache for +48 hours after tennis, seems connected to neck (can rub neck and recreate).  What is best treatment:  heat, ibuprofen, flexeril?", "question_id": "819554"},
{"question_content": "High blood pressure, diabetes and sleep apnea, i'm having pain around my right kidney.  Urine output has increased.  Should i be concerned?", "question_id": "994177"},
{"question_content": "Can not being able to breath out my nose at night due to septum issues cause sleep apnea and would it have the same risks? I have high blood pressure", "question_id": "950065"},
{"question_content": "I have really bad chest pains, light headed, dizziness yet feel really heavy... Tingling sensation in my left arm?", "question_id": "992985"},
{"question_content": "Sore eyes/discharge/eyes stuck together/ red eyes -what is it? And should she stay off school?", "question_id": "1223287"},
{"question_content": "Headache on left side(temple to teeth, down to neck) and nausea in spurts for 4 days. I've had migraines in the past but usually sleep them off in a day. Can an office visit do anything?", "question_id": "960902"},
{"question_content": "I have been having constant numbness in my left arm andhand. My shoulder and neck had pain, but now i havenumbness in my arms and hands. What should I do?", "question_id": "311819"},
{"question_content": "I've had a nausea for 3 days that won't go away. Now, i feel a pressure in my neck that runs to the back of my head. Also.My forehead and left cheek feel a little numb and my left eyeis blurry. What should I do?", "question_id": "529795"},
{"question_content": "The day before yesterday my heart rate dropped to 40 bpm, yesterday I started feeling pressure on my chest and left arm discomfort?, could it be the beta blocker or should I run to the ER for a heart attack.", "question_id": "589267"},
{"question_content": "What are treatment options for a detached retina on the lower part of the eye?", "question_id": "606570"},
{"question_content": "My wife has 6 week old medial meniscus root tear in knee (mri). Symptoms have been unique. No pain in knee but thigh and ankle muscles seize up if she walks 50ft+ or sits for 60mins. Any advice/ideas?", "question_id": "1163407"},
{"question_content": "Mri revealed tear in medial meniscus in right knee. Doctor says that clinically there is nothing all pain is due to pfs. Is that possible?", "question_id": "559316"},
{"question_content": "What is the main difference between osteoarthritis and rheumatoid arthritis?", "question_id": "28075"},
{"question_content": "Had a barium swallow report said there are moderate anterior vertebral osteophytes at c5/6 c6-7 where on earth is that? Now they say endoscopy.Had test for post nasal drip issues so now I am confused", "question_id": "1290458"},
{"question_content": "Mri shows  disc bulges in upper and lower spine and spinal stenosis  in both areas.  Told before I have  peripheral neuropathy .  Are they related ?", "question_id": "597380"},
{"question_content": "I am a 32 yr old male and planning to take depo-provera for hair growth and sexual urge reduction. Good idea?", "question_id": "6740822"},
{"question_content": "I recently had a cerival mri. Impression:large disc protrusion at c5-6, severe stenosis. Is this myelomalacia?", "question_id": "1176223"},
{"question_content": "UTI symptoms for a few days then today my period came... sexually active. what's wrong with me?", "question_id": "1440190"},
{"question_content": "Can't sleep, is it ok to take melatonin supplements?", "question_id": "674844"},
{"question_content": "How can I reduce pain in leg, calf and foot due to osteoarthritis  in l2, l3,  L4 and L5 vertebrae ?", "question_id": "273236"},
{"question_content": "Is lamictal the best thing to take for bipolar disorder?", "question_id": "224178"},
{"question_content": "C5-6, C6-7 spondylosis, bone spur. Conservative treatments for 2 years. No relief. Daily neck n shoulder pain. No weakness. Surgery only option?", "question_id": "1568681"},
{"question_content": "Do i need a neurologic exam? Closed-head injury as a child w loss of consciousness and temp paralysis (no medical care).  I suffer frequent headaches -some migraine- and have bipolar disorder. I currently take lithium, lamictal, serequel, zoloft, and levo", "question_id": "376817"},
{"question_content": "Current smoker for 13yrs.  Intense burning sensation in my head and back last week and a half. Normal bloodwork. Swollen lymph nodes. Do I hv cancer?", "question_id": "1488295"},
{"question_content": "I have had swollen lymph nodes in my neck for years now. I had a CT scan which did not show further abnormalities, but i'm scared i could have cancer?", "question_id": "690989"},
{"question_content": "I had a swollen salivary gland. I was put on antibiotics for 10 days, for infection. The gland is still swollen. Whatshould i do?", "question_id": "397726"},
{"question_content": "25f have back pain most days and now my arms/hand/fingers are hurting/tingling/numb, headaches too!", "question_id": "557272"},
{"question_content": "3 weeks since infected tooth pulled swollen gland under jaw 2 months day 4 clindamycin finally reduced inflammation how many more days before normal?", "question_id": "1424294"},
{"question_content": "I saw a dentist for a tooth abscess. I have been taking Amoxicillin for three days. My face and jaw have swollen and my face is turning yellow. I have started taking 2500 mg of Co-codamol approximately every 4-5 hours. What should Ido?", "question_id": "1157730"},
{"question_content": "I have a lump in my neck, under the jaw, near my ear.Could it be cancer?", "question_id": "942052"},
{"question_content": "Can an MRI determine if your at a risk of having a stroke in the future?Been having sore neck and head pressure, head MRI had done was normal, tension?", "question_id": "864424"},
{"question_content": "Wisdom tooth on lower left side of jaw visibly growing in. Swollen, soar & annoying discomfort in area as well as gums. Safe to eat normally?", "question_id": "1126208"},
{"question_content": "Had neck fusion in 2009.  I now have numbness in shoulder and neck pain.  Can't lift my head in bed either.  What's wrong?", "question_id": "1047289"},
{"question_content": "My gum gets swollen with fluid from time to time where my wisdom tooth is in the bottom left side what is the problem?", "question_id": "261519"},
{"question_content": "I've had vertigo/nausea or intense back/neck pain, headaches. It's always 1 or the other.  Mri of brain/spine normal other than 1 bulging disc l4.  Labs normal. Pt for 3wks no improvement. What next?", "question_id": "1270194"},
{"question_content": "I have a large cold sore, swollen glands  in my neck and sever mouth/tooth pain. What is going on and what doctor do I see?", "question_id": "317880"},
{"question_content": "Pins&needles on head.switches sides daily.pain on jaw,neck,unbalanced.hard to swallow.is this tmj?brain&neck MRI clear.brain feels foggy.help!!", "question_id": "6640066"},
{"question_content": "Every time I stand up my vision blurs and gets dark, I feel weak everywhere and my head starts heating up,  I get very dizzy as well, why is this?", "question_id": "1422129"},
{"question_content": "The gums near my left wisdom tooth is swollen and spit hurts. What's wrong?", "question_id": "150051"},
{"question_content": "Where r the areas in your head where they would hurt if u have tmj? Mines hurts on top & n front of my ears! MRI of brain normal 4-18-13 lots of ha", "question_id": "1041580"},
{"question_content": "How to control hormonal changes & testosterone level which is causing bad severe acne & pimples, please explain both in detail.Should i stop masturbating?", "question_id": "508296"},
{"question_content": "Can a painless pea size swollen inguinal lymph node be a sign of a std? If so which ones and how Common is this? Anything to worry about?", "question_id": "1569286"},
{"question_content": "Hi it's been six days since I had sex. The lower part of my stomach is very sore almost like bad cramp. I have been dizzy could I be pregnant?", "question_id": "1423247"},
{"question_content": "Sharp, lasting pain in front through back of head. Dizziness. Vertigo, with nausea/vomiting. Ongoing for over a month. Not sinuses. Help?", "question_id": "1424457"},
{"question_content": "I got angina when i was 18 years old; now I am 22. I had stress ecg, ecg, 24 hour ecg, echo, cardiac mri, and cardiac mra done. My heart is structurally perfect. Is there any point in getting any other testing done at a young age?", "question_id": "821859"},
{"question_content": "I have dysautonomia and woke up short of breath-i can walk and all just feel like need more air, this happened b4 had spiral ct/xray chest, and heart echos/stress test evthing ok, but how can I help it?", "question_id": "945620"},
{"question_content": "Every morning, right after i wake up i start sneezing, and have an itchy nose and watery eyes that sometimes itch. What could i be allergic to?", "question_id": "677126"},
{"question_content": "I have lump in throat causing right ear pain nausea head and neck pain severe fatigue and problem wirh my balance no health insurance chokeing on food as well hard to breathe laying down?", "question_id": "993917"},
{"question_content": "Im scared I have brain annurisim. Headache in back of head all day asprine helped some eye pain nausea eye flashes. Should i go to er?", "question_id": "951289"},
{"question_content": "Moveable painless lump in front of neck between my r ear and chin. No other symptoms. Been there 5 plus years.  Should I be worried that its cancer?", "question_id": "1422797"},
{"question_content": "I'm scared I might have cancer. I have looked on google. I have a lump behind my ear and my throat is kinda tightish.. I also have pains in my neck and all over . I am seriously worrying so much and think I might have anxiety about cancer. I'm a young tee", "question_id": "1461877"},
{"question_content": "My 6 yr daughter gets bronchitis symptoms every winter only not summer stuffy nose congestion wheezing   antibiotics make it go away what can it be.", "question_id": "1554717"},
{"question_content": "I finished 2 rounds of zpacks for bronchitis/ wheezing cough & was still sick.  Then was prescribed prednisone & advair by diff dr.  I've been peeing every 2 hrs at night. Normal for these meds?", "question_id": "593674"},
{"question_content": "My thyroid is swollen, my neck feels tight, I have trouble swollowing and its like there's a lump in my throat. Also, iexperience some pain in my ear. What should I do?", "question_id": "365835"},
{"question_content": "Is it normal to have increased sciatica pain after starting a round of prednisone for bronchitis? The pain seems to be nerve pain.", "question_id": "559855"},
{"question_content": "Getting bad headaches for months at top of head with pressure feeling, my head feels sore to touch, like my hair is sore, what could it be?Serious?", "question_id": "483603"},
{"question_content": "How many dosages of prednisone does it take before my leg from sciatica will feel better - i'm on a 6 day prescription ?", "question_id": "311266"},
{"question_content": "Can peripheral vascular disease cause eye pain?", "question_id": "33680"},
{"question_content": "Should i get checked for copd? Been a smoker for 3 years and no serious medical conditions. However, cough phlegm and occasional shortness of breath.", "question_id": "902187"},
{"question_content": "What do I do now? I have had a swollen lymph node in my neck for about 6 weeks now. Sometimes it is easily felt but other times it is not so pronounced, but is always larger than the right side.  I recently went to the doctor due to this and pain in my sp", "question_id": "385057"},
{"question_content": "Can we rule out COPD if there is no cough at all. Mucus actually comes frm nose. But shortness of breath n slight chest discomfort. Had chest infectio?", "question_id": "124799"},
{"question_content": "I was around a lot of smoke sat night. Today I have no voice, tight chest, and get short of breath easily should I be seen at er. I'm asthmatic. \n?", "question_id": "1543999"},
{"question_content": "19, hard to get/maintain erection, low sex drive, try to stay active but always sleepy after meals, little to no chest hair/ patchy facial hair?", "question_id": "1210906"},
{"question_content": "Are chest tightness, tiredness, shortness of breath, and light headedness early, mid, or late asthma attack symptoms?", "question_id": "760666"},
{"question_content": "Can studying too much and sleeplessness lead for headache (like pressure on head) and nervousness and insomia and dizziness ? Or counsult a physician", "question_id": "731474"},
{"question_content": "I went to the ER for very high BP and bad headache/headpressure. Before i left, my readings were 146/94, 142/92 and 123/83. I was only given pain medicines at the er.Was BP the cause of the headache/head pressure?", "question_id": "894734"},
{"question_content": "I have anxiety and ADD. I take Zoloft and klonopin for anxiety but it is affecting my concentration. Is it safe to add ritalin to the mix?", "question_id": "6718480"},
{"question_content": "When taking Zoloft & klonopin for depression, anxiety, panic disorder, I know  you should avoid alcohol, caffeine, chocolate. What about cigarettes& sugar?", "question_id": "249546"},
{"question_content": "Is it ok to take Lyrica and Neurontin? I use Neurontin to help me sleep at night. Won't take together just same day", "question_id": "1500420"},
{"question_content": "What causes painful joints (fingers, elbows, knees) & low back pain?", "question_id": "893545"},
{"question_content": "I'm on 100mg trazodone, 100mg Zoloft 1000mg Depakote 2mg risperal & seroquel XR 150mg at night. I feel high 30minutes later should this be happening?", "question_id": "1195610"},
{"question_content": "I am taking cymbalta for neuropathy, I take 2 mgs of klonopin for anxiety.I've been taking one 5mg oxycodone for pain a day.can I take more for pain.what amount is cconsidered safe for a day?", "question_id": "1359833"},
{"question_content": "Other than Neurontin what are acceptable pain meds to treat severely painful diabetes neuropathy?", "question_id": "61548"},
{"question_content": "Are there any side effects switching from Neurontin to lyrica?", "question_id": "1411389"},
{"question_content": "I have been taking Neurontin for peripheral  neuropathy because i was told it will stop nerve damage from progressing.  Is that true ?", "question_id": "543315"},
{"question_content": "I have had hives for 3 weeks. I thought it was a reaction to a new acne cream I had tried (benzoyl peroxide), but that would have to be out of my system by now. I have had psoriasis on my knees and elbows, but these hives seem to be exacerbating the psori", "question_id": "6740327"},
{"question_content": "I have a vitamin B12 deficiency with leg cramps and anterior shin splint .Will it get cured forever or not .Will I be able to jog henceforth?", "question_id": "58625"},
{"question_content": "I came off mirtazapine over a week ago. I am depressed again and want to get back on them. Will they work immediately since it's only been that long?", "question_id": "1112229"},
{"question_content": "I have small fiber neuropathy and i'm taking 900 mg of gabapentin for my foot pain. Not helping at all. What's the chance the max dose will help?", "question_id": "753152"},
{"question_content": "I have painful neuropathy in my feet, lyrica didn't help, gabapenten didn't work, would a small dose of both combined work?", "question_id": "1274072"},
{"question_content": "Is it safe to take ibuprofen with metoprolol, lisinopril hctz, and Klor-Con 10?", "question_id": "1184903"},
{"question_content": "My son is 9; plays out in the sun for 1 hour during the afternoon daily. He gets ankle pain. his blood test showed vitamin D3 at 9ng/ml. Is something wrong with him? How much supplement does he need??", "question_id": "6672053"},
{"question_content": "Deep ache in ankles and feet as well as  neuropathy. Feet are turning blue and purple and feel cold but turn red in the shower. What  is this?", "question_id": "581348"},
{"question_content": "I'm getting blood drawn in the morning but I drink alcohol last night blood test for my medicine that I take?", "question_id": "6658793"},
{"question_content": "How sensitive is the biopsy test for small fiber neuropathy?", "question_id": "1347369"},
{"question_content": "Went to the for burning tingling in my feet they checked me for diabetes and a vitamin deficiency.  No diabetes my vitamin d low could this be cause?", "question_id": "1123511"},
{"question_content": "Can vitamin d deficiency cause fatigue or depression/anxiety?  I am especially concerned with the fatigue. My blood level was a 10.", "question_id": "640419"},
{"question_content": "What vitamins should I be taking to increase my chances of conceiving I am currently on B6 and folic acid?", "question_id": "1445610"},
{"question_content": "Can vitamin and protein deficiency be the cause of depression?", "question_id": "735216"},
{"question_content": "What should I eat, and what not, if I have a prostate cancer? Do I have to avoid sugar? Is drinking glass of red wine ok, or is it dangerous for me?", "question_id": "60771"},
{"question_content": "My sister just got diagnosed with liver cirrhosis from years of drinking and abusing prescription medication.  Does it ALWAYS lead to liver cancer?", "question_id": "1331973"},
{"question_content": "Taking warfarin for heart, have hepc n cirohsis, gall stone...can I take walnuts ?", "question_id": "1461575"},
{"question_content": "Why do dr check your ferritin levels and vitamins if your hemaglobin is down a bit is just to see if your health ok?", "question_id": "1437180"},
{"question_content": "Wbc 3.6 RBC 2.99 PLT 107. Hgb 9.9 hct 34.1 mchc 29.0 MCV 114.2 RDW 17.5 what is wrong with me, I am weak& dizzy. With shooting chest pain..", "question_id": "819804"},
{"question_content": "Aching/burning - both feet, mostly below the balls.  Hurts after periods of rest. First steps not painful  & no heel pain. Hi arches/105lbs/40 yrs.", "question_id": "586969"},
{"question_content": "What can I do for a sprained foot and contusion ? Can put pressure on heel but not the rest aches , throbs, bruised on top", "question_id": "793978"},
{"question_content": "Ankle sprain 4 months ago. Did mri. Everything normal. Still have pain doing heel and calf stretch and turning foot to r with hand. What's wrong?", "question_id": "695352"},
{"question_content": "What is neonatal jaundice?", "question_id": "2153"},
{"question_content": "I sprained my ankle 4 days ago and it is still quite swollen and very bruised. Wondering if I should get it checked for a hairline fracture?", "question_id": "321326"},
{"question_content": "My ankle has hurt for 7 months, isn't red or swollen, could this be a heel fracture?", "question_id": "36045"},
{"question_content": "I sprained my ankle/foot 3 weeks ago and i still get bad swelling, bruising and pain. What should I do?", "question_id": "340369"},
{"question_content": "Surgeon did a \"scope\"  test recently for colostomy removal/reversal.  Will this test reveal any signs of diverticulitis?  I know it shows pollyps etc.", "question_id": "140179"},
{"question_content": "I have ligament damage due to an untreated ankle fracture the bones have healed, will the ligaments heal or do I need surgery?", "question_id": "239493"},
{"question_content": "I hurt my ankle badly 30 days ago my doc said it likely wasn't a sprain and got an x-ray. It wasn't fractured its still sore fast should I be worried?", "question_id": "1012435"},
{"question_content": "My sister is 4month pregnant, she pass out suddenly very often, her ketone, sugar and blood pressure is normal, what's the cause and what to do?", "question_id": "1443382"},
{"question_content": "I sprained my ankle 3 months ago and it is still swollen bruised and hurts my mom wants to take me to a specialist what would be done + witch one im15?", "question_id": "940660"},
{"question_content": "I sprained my ankle over 3 months ago in rugby i'm playing again it is still swollen bruised i can run but it i turn it wrong it hurt is it ok to play?", "question_id": "951254"},
{"question_content": "4 aligned foot fractures (so no surgery). Doctor removed the fiberglass cast for the 3rd-week Xray, then prescribed the walking boot. Is it TOO EARLY?", "question_id": "1412646"},
{"question_content": "3 years go=broken ankle & screwes sprained my akle playing tennis in auguet and it's still swollen. Had me in a cast. Is this normal?", "question_id": "1152008"},
{"question_content": "I had 4 metatarsals fractured, I wore a cast 4 weeks. Now its removed and the doctor told its healed. Is it normal I have pain, so cant walk properly?", "question_id": "1403386"},
{"question_content": "Had stress fracture in foot. Wore boot  1 mo. 4 mo. Later foot still swollen tho doc said bone healed. No pain just noticeable swelling not improving.?", "question_id": "278206"},
