{"question_content": "Constant tingling leg pain what could it be. I am a diabetic, for the last three months I have been having this tingling pain from my buttocks all the way down to my foot, but only on the left side. It hurts for me to sit or lay down.", "question_id": "400830"},
{"question_content": "Both of my legs are swelling of from my knees down to my feet , and tender to the touch . What could this be?", "question_id": "72460"},
{"question_content": "-psoriasis on elbows/knees\r\n-recently used apple cider vinegar (orally) & olive oil/acv baths\r\n-now many bright red spots on thighs and lower leg\r\n-help!", "question_id": "557898"},
{"question_content": "I've had blood in my stool diahrea constipation abdominal pain lower back pain from cyst increased urinary frequency abnormal periods abdominal bloating frequent fevers night sweats horrible cough none of my docs can find anything wrong i had an endoscopy", "question_id": "490687"},
{"question_content": "I have a light brown/tan  (little bit darker in center), dry, raised, irregular  spot on side of breast. Size of a dime. Recent breast itchy & hot?", "question_id": "6717973"},
{"question_content": "2 weeks ago swollen glands, post nasal drip, cough. Got a z-pack- better. Swollen glands are back so is drip. Bad throat pain. Have seas. allergies to?", "question_id": "1387408"},
{"question_content": "My 14 year old daughter is being treated for a sprained knee but her feet and lower leg are ice cold.  Should I ask for sonogram to rule out dvt?", "question_id": "149177"},
{"question_content": "I have swollen glands in my neck, a sore throat,  ears ache and my tonsils areinflamed and covered in white patches. Is this strep throat?", "question_id": "642596"},
{"question_content": "Stomach cramping, diarrhea up to 10 times a day, nausea, dr found occult blood in stool and mucous, high esr. Gallbladder ultrasound next week. Grandma has IBS brother has uc. What could be the cause?", "question_id": "637524"},
{"question_content": "Hi just of hospital after suffering minor head injury getting headaches minor dizziness +pressure in head should I go back or is tha normal.", "question_id": "598266"},
{"question_content": "Constipation after appendectomy, I have my appendix out 4.5 weeks ago and had bad abdomen pain, cramping, like washing machine, wind my stools are loke rabbit pellets would this be my issue for pains?", "question_id": "6734613"},
{"question_content": "What's the best allergy medicine? Allegra, Claritin or Zyrtec?", "question_id": "6698145"},
{"question_content": "I take fenofibrate lipid regulating agent,thus it trigger allergy.eg.sneezing watery nose,redness of both eyes,itchiness of tongue with preckles ontop?", "question_id": "1380387"},
{"question_content": "21 m old boy, 2 ear infections, high fever, bad cough, runny nose, congestion, irritability, sore throat. Loss of appetite on amoxil for 3 d no change?", "question_id": "504579"},
{"question_content": "I had two neg. D dimer tests, but my legs are killing me. I never had a DVT ever but is it worth it to get an ultrasound to be sure?", "question_id": "877967"},
{"question_content": "Sore throat on one side, swollen lymph gland, hard to swallow, and back teeth very painfull with swollen gum? Is that from cavity?", "question_id": "223383"},
{"question_content": "Streak of bright red blood on stool.  Some pain after bowel movement.  What could cause this? Worried about cancer.", "question_id": "1473496"},
{"question_content": "I have sore throat, headache, bodyache, mild fever. Is it a bacterial or viral infection?", "question_id": "195815"},
{"question_content": "How do I distinguish pain from my sciatica in both legs from a blood clot?I get scared because the pains I Get from hip to foot.Pain similar 2 dvt?", "question_id": "1382646"},
{"question_content": "How long could it take swelling in leg to go down after DVT diagnosis and warfarin started?", "question_id": "29257"},
{"question_content": "I have a very, very bad sore throat, a fever consistently between 99-101 degrees, a headache, a slight cough, and a stuffed nose it all came on quite suddenly on sunday. What could this be?", "question_id": "380710"},
{"question_content": "Does pus covered swollen tonsils mean bacteria or virus? Had fever, chills and aches for 1 day with extreme sore throat.", "question_id": "1227858"},
{"question_content": "Possible i could have oral cancer?  but would your tongue and throat hurt at same time?  i also have ear pain, jaw pain, throat stings hard to swallow", "question_id": "1378609"},
{"question_content": "Sore throat to the point where its painful to swallow, ear ache in both ears but mainly the left, a stiff neck and headaches on off Had for 7 days?", "question_id": "1465605"},
{"question_content": "Is this my allergies? i woke up this morning blowing my nose its stuffy stopped up a little my throat hurts its itchy my eyes has water running down", "question_id": "1457680"},
{"question_content": "I am having problem from runny nose and itchy eyes, itchy throats, I took medicine cold n flu but didn't work my nose is still running. Please help me?", "question_id": "253407"},
{"question_content": "I have a cold for about a 9 days. It is not going away. Green mucus from nose and throat. Blood in nose. Facial pain and cough. Sinus infection?", "question_id": "1553687"},
{"question_content": "How likely am i to be diagnosed with ms? I originally went to the doctor for numbness and tingling in my hand and foot and have gotten severe pain in my opposite arm and hip on two occasions.  One white spot was found on my brain mri, minor degenerative c", "question_id": "392752"},
{"question_content": "Do I have cold or sinus infection? Runny/stuffy nose, itchy scratchy throat, top right teeth seem sore, and my front right tooth has become super sensitive to temperature over night, now I seem to be feeling very cold, a dry cough and very chapped lips", "question_id": "277901"},
{"question_content": "I have a muffled left ear with pain on the inside, down my neck and jaw line.  I cannot feel anything swollen in any of these areas, no redness or any lumps.  Could this be an ear infection?", "question_id": "6628040"},
{"question_content": "I have bulging at l4-5 and l5-s1 and severe pain in hips and lower legs. What should I do?", "question_id": "908267"},
{"question_content": "I had l5-s1 spine fusion and a L4 foraminotomy in several months ago, is there a way to relieve back pain radiating down my left leg?", "question_id": "219919"},
{"question_content": "Body aches/diarrhea/no fever. Saw md this am, got steroid shot. Flu&strep came back negative. Could this be contagious? I have a 7mo old at home!", "question_id": "1269997"},
{"question_content": "I have issues with my l4 l5 and s1 I also have sacroilits,scoliosis and now developing neropothy in my legs.any segestions on treatment.no MRI yet....", "question_id": "6644381"},
{"question_content": "L4-s1 fusion 10 weeks ago. Some symptoms better but now new severe r. Back pain x1mo.  L5,  on the spine to r.  Pain10/10 turning in bed.  Leaning to l. 2° pain. Xrays ok, they insist it's muscle spasm?", "question_id": "696980"},
{"question_content": "Migraines nausea fatigue diarrhea sharp stomach pains inner trembling loss of appetite. Began 5dys ago after vertigo in shower/vomiting. Period in 2wk?", "question_id": "1443822"},
{"question_content": "For 3 weeks, I have had constipation, bloating, gas, distended abdomen, nausea, headache, extreme fatgue, dizziness. Tested & not pregnant.  Advice?", "question_id": "530164"},
{"question_content": "Hemorrhoid after every bowel movement reason to see dr about, no bleeding, not  painful but feel pressure, i can push it back in, use suppositories?", "question_id": "870379"},
{"question_content": "I have been bleeding from my butt. No hemorrhoids, no tears, no constipation, it's coming from inside. It's bright red.", "question_id": "1216868"},
{"question_content": "I have hemeroids and am use to a lil rectal bleeding but what would make u soak toilet paper with a bright red blood. Other than ibs?", "question_id": "820850"},
{"question_content": "Abigail has had headaches, stomach cramps, and diarrhea for over 24 hours. Not much urine output. When should I worry and/or head to the hospital?", "question_id": "6781628"},
{"question_content": "Can you get c-diff without a colon? My fiance is in the hospital right now. He's having serve diarrhea, stomach pain, and headache along with extreme nausea. The doctor said that he has c-diff but the thing is he got his entire colon removed back in 2010.", "question_id": "391213"},
{"question_content": "Pain on R low abdomen and worse during sex. acid reflux daily and bouts of diarrhea constipation nausea. Had diarrhea Saturday and stopped up since ?", "question_id": "6718626"},
{"question_content": "Sharp, lasting pain in front through back of head. Dizziness. Vertigo, with nausea/vomiting. Ongoing for over a month. Not sinuses. Help?", "question_id": "1424457"},
{"question_content": "Do colon cancers continue to bleed or do they stop? Haven't had rectal bleeding for over a year but did have bright red rectal blood before. I'm 26.", "question_id": "513631"},
{"question_content": "I am 33 years old. My symptoms are: bloated all the time, chills, headaches, nausea, lower back pain, swollen abdomen and lots of gas. I feel dizzy in rare cases. What could be the problem?", "question_id": "365457"},
{"question_content": "Before and after my gallbladder removal my bile duct has been dilated even still a year later, this causes a lot of pain, will this go away itself?", "question_id": "169919"},
{"question_content": "What fact i have high SGOT,SGPT,GGT. But not hepatitis.  As now my liver test is back to normal but my ESR 51. I worry ,the infection recurred. ?", "question_id": "1527162"},
{"question_content": "My problems started with pain and swelling in my left testicle. Then i had problems urinating and had back pain. Mt urine and blood tests were clear and showed no infection. The veins are prominent in my scrotum. Thoughts as to what this could be?", "question_id": "623997"},
{"question_content": "My dr 2 days ago run urine culture to check for bladder infection. No blood in urine. Dr sent me to ER to check for appenditicis. Ct scan normal, bloodwork normal, but had urine in blood 2 days later. Why does this happen? Do I actually have uti?", "question_id": "182206"},
{"question_content": "I think i may have a urinary tract infection. It hurts to urinate and my urine is faded and had a strong odor. What do I do?", "question_id": "370055"},
{"question_content": "Two weeks ago i had surgery for a left inguinal hernia and hydrocele (marsupialized).   The left testicle is now positioned at the top of the scrotum.  Will it drop into the normal position later?", "question_id": "1026339"},
{"question_content": "I'm 4weeks pregnant.I want to have a medical abortion cos i had a surgical one 3mths ago.Wat do I take & I have  uterine fibroids.", "question_id": "532286"},
{"question_content": "Are there certain medicines or types of meds that cause hot flashes in men? I take meds for bp, prevention of kidney stones, diabetes & depression.", "question_id": "824397"},
{"question_content": "Are these  panic attacks or seizures  1.Muscles jumping sometimes like in shoulder or arms 2.Dizziness 3.Headaches in temple 4 andrenaline rushes?", "question_id": "245381"},
{"question_content": "I have neck pain, fluid behind ear, swollen glands in neck and cold sore all on the right side.  Dr. Put me on amoxil and steriods. Is this normal?", "question_id": "1273448"},
{"question_content": "Does distilled water and orange juice help kidney stones prevention? I can't find solid info for each way.", "question_id": "6699164"},
{"question_content": "I've got a cavity in a tooth, may be infected because of the pain, headache, earache, and swollen glands  it's causing.  Can't function without pills.", "question_id": "6705646"},
{"question_content": "What is it? I have a black dot on the bottom of my last mole the one before my wisdom teeth i'm 21 year old female i recently went to the dentist and had x-rays and they said i had no cavities and that everything was good this was a month ago what could b", "question_id": "391550"},
{"question_content": "Can a cavity in the wisdom tooth make tmd symptoms worse?", "question_id": "352476"},
{"question_content": "Sir, I am 25. I have hydrocele problem for the past few years and I am actually afraid of surgery because i don't know whether it will affect my married life or not. What should I do?", "question_id": "511806"},
{"question_content": "I'm having tingling and numbness in my hands and feet on a regular basis. Fibromyalgia?", "question_id": "226549"},
{"question_content": "Just came from hosp- bad flank pain a lot of blood in urine.  All my kidney stones still in kidney, no infection in urine & bw came back ok. What could this be?  I have to fu with urologist.", "question_id": "644173"},
{"question_content": "What gets done first, cavities filled or wisdom teeth pulled?", "question_id": "911558"},
{"question_content": "I used to have sick white discharge from my vagina,white plaques.Now there's also white liquid.really itches me and my anus.is this yeast infection?", "question_id": "1450194"},
{"question_content": "Got upper right wisdom tooth removed because of infection/cavity 5 days ago. Been on augmentin (3/day)for 7 days. Infections is back in location of wisdom tooth. Have doc appoint in 2 days.what wrong?", "question_id": "6690063"},
{"question_content": "Swollen lymph node,headache, left eye pain,sore throat,hard to breath especially outside,heart racing,heart racing,joint pain,weight/hair loss,nosleep?", "question_id": "6729795"},
{"question_content": "Woke up to terrible burning in chest between breasts, dry cough, feeling of bubbles in the throat.  What causes this?", "question_id": "1443893"},
{"question_content": "My ectopic pregnancy got miscarried on its own and my hCG was130. A week after, bleeding stopped. I am having on and off brown discharge and now its bleeding like light period. Why could it be?", "question_id": "503106"},
{"question_content": "Painless throat swelling w/ diff. Swallowing w/hard swollen painless lymph nodes at multiple sites, airway feels obstructed.Other symptoms incl. Dry eyes+pain+photophobia, dry mouth, joint pain. Help?", "question_id": "628686"},
{"question_content": "Yes , I have a vaginal discharge that is brownish , and cream color , i bathe daily sometimes 3 times a day but my vagina has this fart smell . Std?", "question_id": "351313"},
{"question_content": "Can a girl be pregnant if she is virgin but penis get inside vagina half only in which penis got up and down around 8 times without releasing sperm ?", "question_id": "6719304"},
{"question_content": "Can non-food allergies cause sore throat, that seems to resonance in the ear, jaw, chest, and mouth?", "question_id": "278305"},
{"question_content": "Do drs check for STDs such as gonorrhea and chlamydia if a CBC is ordered?", "question_id": "1410507"},
{"question_content": "Tested positive  chlamydia & negative hiv, gonorrhea &syphilis  was given  one time 2 tablet treatment of azithromycin & week supply erythromycin with serve pains in stomach, pooping & urinating help?", "question_id": "673585"},
{"question_content": "I got tested last week for std's. I received txt to say syphilis negative however nothing regarding HIV test or chlamydia yet.Is this a negative sign?", "question_id": "1216490"},
{"question_content": "Darkened nipples, light tingly(gas maybe?)like cramps, nausea, food cravings, dizziness, nosebleeds, & sore breasts PMS or pregnancy?Also light bleeding", "question_id": "817656"},
{"question_content": "Bad headaches for 2 weeks on and off, nausea, dizziness (not vertigo), fatigue, increased heart rate (at times). Blood tests normal. Not pregnant.", "question_id": "940971"},
{"question_content": "How long should I wait to get tested after having receptive anal sex? In particular I want to get tested for RECTAL chlamydia+gonhorrea+syphilis.", "question_id": "1567888"},
{"question_content": "My period is 23 days late. I had sex 2 days before the expected start date and missed the last 2 birth control pillsin pack. I have all the symptoms, but have negative serum hcg. Could i be possibly pregnant still?", "question_id": "359864"},
{"question_content": "Can you get a girl pregnant if you have low sexual binding globulin?", "question_id": "1015685"},
{"question_content": "I have protected sexual intercourse with a csw after one year i test HIV PCR test result was viral load less than ldl(ldl-10 copies/ml) what mean help?", "question_id": "1032744"},
{"question_content": "I missed my period for 34 days.I did pregnancy test four times & results showed negative.I am 48 yrs old, sexually active. Am i pregnant or menopaused?", "question_id": "6729520"},
{"question_content": "If you are sexually active can you miss a period and not be pregnant?", "question_id": "229759"},
{"question_content": "Headache, fatigue, cramping, bloated, constipation, tender nipples, back pain, dizziness. Last period started June 3. Am I pregnant?", "question_id": "1400993"},
{"question_content": "I had a negative blood pregnancy test after missing my period after an iui. Is it possible for me to be pregnant but be too early to detect because it has only been 2 weeks since ovulation?", "question_id": "564950"},
{"question_content": "I'm 47 with regular cycles. I had sex on the ovulation day. The day after, one day before my aunt flo was due, i got a lot of creamy cervical mucus. I feel tired, my breasts feel full and have mild cramps in the abdomen. Is this a sign of pregnancy?", "question_id": "795297"},
{"question_content": "What if you have the implanon and the Depo-Provera at the same time, can you have a baby\n?", "question_id": "1443761"},
{"question_content": "Does a CT scan rule out brain aneurysm? 6 months pain behind right ear and upper neck with dizziness/blurred vision. CT normal. What to do next?", "question_id": "6711728"},
{"question_content": "I have question with my bladder. I have frequency, urgency, and occasional incontinence. No uti, no bladder or pelvic floor prolapse. ?", "question_id": "118745"},
{"question_content": "Blurred vision can't focus, dizzy, nausea, heart feels like fluttering ear and jaw pain right side, blood work good cardio test good but slow heart beat?", "question_id": "1244979"},
{"question_content": "Does pelvic prolapse cause incontinence?", "question_id": "271287"},
{"question_content": "How often does vaginal birth cause incontinence and pelvic organ prolapse? How common are these problems after a normal birth?", "question_id": "747747"},
{"question_content": "I suspect I may have a prolapse. I am 45, have had 2 children and my mother and grandmother both had prolapses of the uterus. My symptoms are long term ( ie the last year or so)  feeling of pressure low down, discomfort and stress  incontinence while exer", "question_id": "276362"},
{"question_content": "How does vaginal child birth lead to stress incontinence in women?", "question_id": "27430"},
{"question_content": "Is part of having kids stress incontinence?", "question_id": "140379"},
{"question_content": "What is stress urinary incontinence?", "question_id": "23861"},
{"question_content": "What could cause tender multiple swollen lymph nodes on left side of body in the neck and armpit with headaches and fatigue?", "question_id": "338078"},
{"question_content": "How come I have stress incontinence, but nobody else in the family has it?", "question_id": "86144"},
{"question_content": "What is self stress incontinence?", "question_id": "216640"},
{"question_content": "Can sore nipples and tender breast mean breast cancer or swelling in the breast? No period coming and not pregnant what is it?", "question_id": "65868"},
{"question_content": "3 yr old has a big swollen lymph node on one side of neck that has been there formonths. Blood work normal.purple circles under eyes?possibilities?", "question_id": "6788402"},
{"question_content": "I have a swollen left breast that is painful, with nipple discharge & blood, it itches, and lymph node under armpit is tender...see my PCP or ER.?", "question_id": "1313587"},
{"question_content": "I have a wet toilet paper like discharge. It is very thick vaginal dryness. No STD or yeast. What is this?", "question_id": "1244221"},
{"question_content": "Discharge thats thick n white  inches a lil could this be are yeast infection hurts a lil like a UTI I've only been with my husband shouldn't be std?", "question_id": "1522239"},
{"question_content": "I have TMJ problems and i think wisdom teeth problems.Dizzy, headache, pressure in molar area, tests by physician and ER came back fine.Could it b teeth?", "question_id": "1227918"},
{"question_content": "Will a OTC mouth gaurd help till i get to see TMJ doc- can't see him for another 3 weeks sick of ear fullness/ dizziness, ENT says its prolly tmj?", "question_id": "1070644"},
{"question_content": "Sticky vaginal discharge that makes itching around the vaginal area.swab test normal no infections no yeast.pelvic test normal.plz help its annoying?", "question_id": "1433382"},
{"question_content": "Can studying too much and sleeplessness lead for headache (like pressure on head) and nervousness and insomia and dizziness ? Or counsult a physician", "question_id": "731474"},
{"question_content": "I was diagnosed with fibromyalgia in 2005. Now, I have got severe blurred vision in the left eye, numbness in limbs, dizziness, a little incontinece and memory loss. What should I do?", "question_id": "1190808"},
{"question_content": "Can an impacted wisdom tooth cause dizziness and aches?", "question_id": "354704"},
{"question_content": "What is diabetic heart disease? Are dizziness, shortness of breath, cold tips of finders and chest pain strong indicatros of diabetic heart disease?", "question_id": "370617"},
{"question_content": "I'm 26 weeks pregnant & just found out I have a basal cell skin cancer.  Do I need to be concerned?  Had a mole biopsied that came back as basal cell.", "question_id": "149305"},
{"question_content": "Is it possible to have Lyme go undignosed  for a long time& evolve into MS ? I've tested positive for both.", "question_id": "330575"},
{"question_content": "My asymmetrical mole on my foot was removed today. It has been growing the past few months and im pregnant. Could it be cancer? Im scared", "question_id": "6743587"},
{"question_content": "Do I still have to worry for my chest pain even if I have normal 2deho Jan 2013, ecg, treadmill stress test I'm always thinking of heart attack/stroke?", "question_id": "1027564"},
{"question_content": "I just developed a halo mole. Do i need to be concerned? I just had stitches removed from having a squamous cell cancer mole 3 days ago.", "question_id": "337828"},
{"question_content": "Aafter walking I am belching, chest pain, I am so nervous that I think I have heart attack but I hav normal ecg, 2dechoe, and stress test stomach bloated?", "question_id": "274543"},
{"question_content": "My last blood test results included these: albumin 3.9, total protein 7.0, alkaline phosphatase 165, ast/sgot 31, alt/sgpt 86, bilirubin, total 0.5, bilirubin, direct 0.2;  any hint of a liver problem?", "question_id": "1119837"},
{"question_content": "I stopped using cocaine but i tried it again..I took 4 hits and after 10 min i start to feel my heart pounding, dizziness, nausea etc?", "question_id": "1295158"},
{"question_content": "Can anxiety cause dizziness and feeliing faint without feeling as if im scared or having a panic attack at the moment?", "question_id": "137846"},
{"question_content": "I have the worse anxiety when going to see a doctor. I always except the worse  diagnosis . My heart rate is always high like 140  plus and my blood pressure is always up. How can I calm myself  enough to go see  doctor?  This anxiety makes me avoid going", "question_id": "261585"},
{"question_content": "My mom passed away due to liver cirrosis & hepatitis b, hepatitis e. My dad also has hep b. Do i stand chance? I have the vaccinations done.", "question_id": "678247"},
{"question_content": "Is a blood pressure 141/86 with a pulse of 76 bad? I'm diabetic and feeling palpitations also. How can I differentiate heart vs. anxiety?", "question_id": "1390259"},
{"question_content": "I believe I have myocarditis. I have been known to suffer from anxiety but I have had palpitations that reccur every so often also coughing because I feel mucus. I have periods of being fatigued and am not willing to get up from bed every morning.", "question_id": "6705577"},
{"question_content": "My sister just got diagnosed with liver cirrhosis from years of drinking and abusing prescription medication.  Does it ALWAYS lead to liver cancer?", "question_id": "1331973"},
{"question_content": "I've been nauseated/dizzy/having headaches for about a week. No doctors think its brain tumor. What are the odds of having one with this  knowledge?", "question_id": "490387"},
{"question_content": "What is the sensitivity of EKGs, echocardiograms, and cardiac MRIs for detecting previous heart attacks? Would a normal echocardiogram signal good prognosis in the event of a previous heart attack?", "question_id": "1606517"},
{"question_content": "I have pain over my right eye, my nose and my forehead, I am also feeling disoriented. I have never had any sinus problems. I do have lupus, high blood pressure and have had heart bypass in the past. It even hurts when i put on my glasses.", "question_id": "382981"},
{"question_content": "I have had a constant headache on the right side of my head and behind my eye for about 2 weeks now. It is throbbing pressure, nothing helps, besides coffee or water sometimes. Advice|recommendaaction?", "question_id": "645808"},
{"question_content": "I check my heart,  done a lot's of tests, egc, echo, holter, stress test, all say my heart is fine, but today I feel a heavy pain in my chest, and it'?", "question_id": "6620385"},
{"question_content": "Weekly Migraine headaches normally triggeredby certain foofoods, direct sunlight. Managing by inducing vomiting drinking warm water & skipping 2 meals?", "question_id": "1421896"},
{"question_content": "I get chronic headaches, even tho im healthy, drink plenty of water, nd most of the time the headache turn in migranes, what can I do?", "question_id": "61706"},
{"question_content": "Left shoulder ache. Twinges of pain into left arm. Left fingers cramp. Happens on right side too. Good EKG, xray, and heart enzymes. Heart issue? 21yr", "question_id": "1442634"},
{"question_content": "Can sinus cause teeth to ache.Lower and bottom have dull  ache.Bad gums, fibro, herniated disc,  headache, runny nose. Should i see ENT or dentist.", "question_id": "767664"},
{"question_content": "Mild random chest pain on left side of chest.. usually under breast. Almost feels like ribs. Had EKG, bw, stress test, ECHO and xray..all normal?!", "question_id": "1379805"},
{"question_content": "I've had a bad headache across my forehead, ear and neck pain and what feels like a tooth ache for about 8 weeks. I went to the doctor and he gave me antibiotics that didn't work. I went to a dentist and she said there's nothing wrong with my teeth but do", "question_id": "286797"},
{"question_content": "How many visits does it take for molar root canal? I visited the same dentist more than10 times and still the tooth is sore. I went to a different doctor to get it sealed but it is still painful. What should I do?", "question_id": "823599"},
{"question_content": "I have had a sore jaw line for a week now, at first i thought it was my wisdom tooth getting infected again but that seems fine. Should i see a doc?", "question_id": "540320"},
{"question_content": "Sore painful tooth, sore jaw and swollen glands on same side.  Will antibiotics help?  There is no swelling of the gums or around the tooth.", "question_id": "1053684"},
{"question_content": "It has been roughly a month since my wisdom teeth wereremoved. I am now having swelling, tenderness, and heat in my jaw area. Is it possible that my bone is infected?", "question_id": "66074"},
{"question_content": "Is it unsafe to have an apicoectomy of tooth #19? My dentist has made X-ray and found the infection under the root canal. I had my root canal done 3 years ago and just got a new crown. I had an appointment with oral surgeon today. He said that there is a", "question_id": "394863"},
{"question_content": "I have a few tooth abcesses with facial swelling, puffy eyes, and swollen lips. I went to the emergency room and they said that it hasn't spread. They switched me to a different antibiotic. Is it okay to do so?", "question_id": "1127280"},
{"question_content": "Badly infected tooth had failed root canal & apicoectomy had it pulled tues novacaine,  on doxy since sat, feeling nauseous and dizzy since last night?", "question_id": "719764"},
{"question_content": "Dentist prescribed antibiotic/pain med for tooth abscess yesterday, today I am still in pain/face is swollen/gum and lip are now numb is this normal?", "question_id": "1258438"},
{"question_content": "Hey all. Got a sore, red, swollen gum on the left side. No tooth pain or discomfort. Have sinus issues though. Could a sinus infection cause it?", "question_id": "6691103"},
{"question_content": "Every morning i wake up with a migraine it seems like.  I have a headache almost 4-5xweek can this be from sleep apnea?", "question_id": "906769"},
{"question_content": "Toothache can cause headache and dizziness? I'm experiencing these symptoms during the day. My tooth pulses and i can hardly chew. What should I do?", "question_id": "995164"},
{"question_content": "Can excedrine migraine be taken daily for constant bad headaches affecting right eye? Doctor said eyes look fine.", "question_id": "729706"},
{"question_content": "Chronic fatigue, tiredness, general \"out of it\" feeling, back/flank pain, GERD, IBS, migraine headaches, palpitations, waking from sleep with racing heart, low vitamin d levels, ferritin level of 14, TSH fluctuations; what could this be?", "question_id": "6731820"},
{"question_content": "Added 10 mg nortriptyline (nummular headache) to 50 mg trazodone (insomnia) with 60 mg cymbalta (migraine). Felt dizzy, drugged & weak so stopped trazodone. Feel better, but can't sleep. What to do?", "question_id": "691108"},
{"question_content": "I've had a productive cough for nearly 6 months, as well as chest pain on left side of breast bone. 27 year-old male, who smoked for a year. Cancer?", "question_id": "674186"},
{"question_content": "I've had constant migraines and headaches for 6 years and doctors don't know why but lately when I get a migraine I get realy bad chest pain too ?", "question_id": "91071"},
{"question_content": "I had a periodontal cleaning on my front teeth nd a regular cleaning on the rest.. My gums are extremely swollen and very tender is this normal?", "question_id": "1533115"},
{"question_content": "My gums/left cheek is swollen! I have decay wisdom tooth and the dentist doesn't want to remove it because it still swelling. How many days does it last?", "question_id": "1178780"},
{"question_content": "I had a headache from 4 pm - 5 am. I didn't take anything. I took Excedrin around 4 am but it didn't help. Then I took Maxalt MLT around 5 am and it helped. Can you take Excedrin and Maxalt for migraine?", "question_id": "959406"},
{"question_content": "I have a small bump on my gum underneath my tooth. It looks like a blister but has been there for over a month now. It does not hurt or changed size.", "question_id": "1407031"},
{"question_content": "Seeing neurologist, had CT scan, seen ophthalmologist to rule out serious conditions. Any suggestions to help reduce lingering eye pain after migraine?", "question_id": "600024"},
{"question_content": "Im wondering if this pea size bump in the bottom of my mouth is caused by rotten teeth?", "question_id": "622155"},
{"question_content": "I am 7/8 weeks pregnant and have a massive headache. I'm sure it's caffiene withdraw. What can I do besides ice and a 1 pop a day? Very migraine-y.", "question_id": "152127"},
{"question_content": "I have swelling in one of my wisdom teeth and the pain is unbearable I can't afford to go to the dentist will I get the necessary help at the clinic?", "question_id": "6793318"},
{"question_content": "Am i in any serious trouble i had five teeth pulled 15 hours ago and at least two of them had an abscess. The dentist could not drain them before pulling because the pus was still hard. I have been on anti biotics for 41 hours. Now the pus is draining ove", "question_id": "405085"},
{"question_content": "Could the carotid arteries clear themselves or with massaging my neck?", "question_id": "33741"},
{"question_content": "24 weeks pregnant, feeling like im going to passout, K level 3.2, nausea, left arm hurts and feels as if it wants to go numb.  Should I be concerned?", "question_id": "1354154"},
{"question_content": "Can i pop a dental abscess? I think I have a dental abscess. It's soft and squishy. It doesn't really hurt but it's annoying. Already had the tooth drained or whatever dentists do. Can i pop it if I use a sterile needle?", "question_id": "396537"},
{"question_content": "My front tooth abscess just drained.Is biotene wash ok to use or anything else?Waiting to go to the dentist.", "question_id": "920932"},
{"question_content": "I have a bad abcess tooth doc gave me 15 days of Antibiotic tooth is still infected  can vitamin C help fight the infection?", "question_id": "1582865"},
{"question_content": "Is it painful when they drain a dental abscess at the dentist office?", "question_id": "96345"},
{"question_content": "25f have back pain most days and now my arms/hand/fingers are hurting/tingling/numb, headaches too!", "question_id": "557272"},
{"question_content": "I had my wisdom tooth extracted  yesterday the dentist stitched up the hole it stopped bleeding last night how will i know if it is clotting ok?", "question_id": "848534"},
{"question_content": "What is the best method to drain a dental abscess?", "question_id": "343879"},
{"question_content": "Dental abscess leaking? I have a dental abscess which was drained two days ago. I'm on antibiotics and was told to come back in a week. I was laying down today with heatpack because my jaw was sore and tasted something weird. When i looked in the mirror t", "question_id": "404682"},
{"question_content": "Swollen cheek, jaw and gum on left side. Dentist has provided me with amoxicillin and metronidazole. No toothache... What's wrong with me?", "question_id": "1216531"},
{"question_content": "Tooth abcess since sat,face swole & hurts. Takin 500mg amoxicillin & 50mg Tramadol since sat. Not helpin, still big, dentist appt mon. Should I go Now?", "question_id": "1499451"},
{"question_content": "Neuro exam,EMG, MRI of brain normal.  No spinal MRI done.  Weak, shaky legs and dizzy a lot.  Off balance.  Fatigue, fascilations. MS? GAD?Neuro?", "question_id": "1348809"},
{"question_content": "I can feel pressure in the area of my infected tooth but no pain. Used up my antibiotics, is it safe to have it pulled out?", "question_id": "6709588"},
{"question_content": "For 3 days, i've had a severe headache, severe back/neck/joint pain, dizzy, bad fatigue, no fever. Had meningitis 19yrs ago. Worried as it's no better?", "question_id": "1215805"},
{"question_content": "Im 17 having jaw pain over 9 weeks moms a dentist says its TMJ due to stress but she never looks at my jaw had wisdom teeth out already hurt to open.", "question_id": "1038621"},
{"question_content": "I have really bad chest pains, light headed, dizziness yet feel really heavy... Tingling sensation in my left arm?", "question_id": "992985"},
{"question_content": "I have lost my voice for two months. it started with pharyngitis. my tooth was extremely sore too. A few weeks ago... I found out my tooth was abscessed. It was removed yesterday and I was given antibiotics? Will my voice come back? Is it likely the infec", "question_id": "6736922"},
{"question_content": "Hi, I recently had my bottom back right tooth removed because an abcess had formed in my jaw it had been there at least 10 days but wasn't giving me any pain just abit sore to touch, the dentist has removed this tooth and said the abcess should go down an", "question_id": "6776285"},
{"question_content": "Had root canal filling nearly 12 mth ago. Now have an abscess under tooth. Face swollen etc and now neck seems to be too.Taking amoxicillin on day?", "question_id": "1156967"},
{"question_content": "Wisdom teeth impacted and will be extracted in the meantime for the past week i have been having bad jaw pain & ear ache. Is this tmj or wisdom teeth?", "question_id": "6748339"},
{"question_content": "Burning, achy pain behind upper wisdom tooth. Tooth is fine. Dentist says tmj. Motrin or Tylenol doesn't help. Can tmj cause this achiness? Miserable!", "question_id": "6709663"},
{"question_content": "Endodontist says i don't need a root canal, dentist says i do.  I have pain and sensitivity to cold on tooth.  Now what do I do.", "question_id": "1310336"},
{"question_content": "A family friend had an infection in her wisdom teeth , amoxicilin 500 mg capsule was prescribed by her dentist .Now she has rash on the face is it ok?", "question_id": "794800"},
{"question_content": "When is an unfinished root canal ready for filling? My tooth/jaw pain has subsided, but lymph nodes still swollen, ok to finish?", "question_id": "319523"},
{"question_content": "Can TMJ cause ear pain. Soreness under ear and a little discomfort in front of ear. Ear pain is a deep ache. Jaw opens crooked and pops. Comes & goes.", "question_id": "1305613"},
{"question_content": "Swollen cheek jaw Pain, ear sensitve started overnite,treated antibiotics thinking lymph nodes swelling,but no use.seen dentist,xrays teeth fine ,help?", "question_id": "1518318"},
{"question_content": "Is mitral valve prolapse really asymptomatic? I have a congenital mitral valve prolapse and a heart murmur. When i started feeling dizzy, fatigued and developed mild chest pain i went to see an  cardiologist, because i read on www.Mayoclinic.Com that thes", "question_id": "389265"},
{"question_content": "33wks. Pregnant,  having a bad toothache, tylenol not working and cannot see ob or dentist until.Tuesday. Is it safe to take motrin for the pain?", "question_id": "238702"},
{"question_content": "TMJ left side. i go 2Dentist regularly-Dull left ear/jaw/cheek ache @ times.  TMJ or something serious? Had unknown HPV type in 2005. Cancer? no lumps", "question_id": "6614094"},
{"question_content": "With all my different medicine I take for my heart can I take amoxicillin 875 mg tablet  for mi teeth the dentist gave me?", "question_id": "279723"},
{"question_content": "Have a horrible toothache and Tylenol is not helping. Can I take 600mg ibuprofen a couple days while taking 20mg of lisinopril for past 2 weeks.", "question_id": "6739903"},
{"question_content": "What could cause my emg of my right leg to show significant nerve damage, but the MRI of my back to be normal? I've had no injuries to either area..", "question_id": "564196"},
{"question_content": "I have an implant now and I haven't been to the dentist since. Recently my left cheek started swelling and my left lymph node underneath my jawline is swollen and not painful. What could be the cause?", "question_id": "1593372"},
{"question_content": "Tmj will cause salivery gland swelling and pain?Because last month i hurted my jaw with clenching  last few day i feel swelling at my ear on cheek", "question_id": "581367"},
{"question_content": "Can TMJ also cause stiff neck?Jaw line aches, ringing in ears, stiff neck, slight vertigo jaw stiff but can move it fine.Jaw click/cracks is their help", "question_id": "1061385"},
{"question_content": "The side of my jaw is hurting right below my ear, and cannot open my mouth all the way plus sounds like sand inside could it be tmj?", "question_id": "1402436"},
{"question_content": "Where r the areas in your head where they would hurt if u have tmj? Mines hurts on top & n front of my ears! MRI of brain normal 4-18-13 lots of ha", "question_id": "1041580"},
{"question_content": "Can't tell, but left jaw right at back at curve may be ever so slightly swollen, no swollen glands anywhere else, having some  TMJ issues,  concern?", "question_id": "1170123"},
{"question_content": "I have tmj. My jaw shifted to the left and i can make sound of my left jaw. There is no pain. I also have a swollen pea sized growth in front of my left ear. What should I do?", "question_id": "548461"},
{"question_content": "Can abcessed tooth cause pain in ear and axillary lymph node swelling?", "question_id": "1020354"},
{"question_content": "While waiting several weeks to get into a hand specialist , what should I do to alleviate the morning extreme pain and stiffness in my fingers?  Been tested for ra. If tendons should I wear wrist guard? Already tried voltaren gel.", "question_id": "212705"},
{"question_content": "2 left neck lymph nodes swollen after 3 months.Also, pain when touched under portion of right jawline.Have tmj, sinuses, allergies.Bloodwork normal.?", "question_id": "620086"},
{"question_content": "How many years can a tumor that is benign turn into malignant ? Becouse I have a tumor in my parotid gland for 2 years but it never increase it sizes", "question_id": "858856"},
{"question_content": "How useful is total joint replacement in case of chronic ankylosing spondilitis? Best remedy/suggestions to deal with chronic ankylosing spondilitis", "question_id": "950606"},
{"question_content": "I had an adverse reaction to bactrium. I started getting flu like symptoms, visibly swollen lymph nodes in neck thatmoved to hives and swollen tongue. I am still gettingintermittent hives/swollen tongue, 9 days after the last pill.Is it normal?", "question_id": "757986"},
{"question_content": "Swollen lymph node under jawline one side 2 months antibiotics not working doesn't get better or worse can this be a throat cyst?", "question_id": "1425144"},
{"question_content": "8 weeks ago my finger started burning. Then 4 weeks later I woke up to a stiff painful finger.  Stiffness spread to three other fingers in the morning and they sometimes have a snapping movement. The index finger remains sore all day. Saw an orthopedic an", "question_id": "212605"},
{"question_content": "Does this sound like cracked tooth syndrome? When i bite or chew hard things, it hurts in the left rear of my mouth and my dentist couldn't find anything on the x-ray. He said there was no cavity, and i can't figure out any other reason it would hurt.\n\n\n.", "question_id": "406228"},
{"question_content": "I have very painful and swollen joints in both wrists and ankles. I occasionally have red marks on my face, arms, chest, and legs. Ra or lupus?", "question_id": "1223187"},
{"question_content": "If you have a fungal infection or bacterial infection on your penis will your groin lymph nodes swell ?", "question_id": "1223550"},
{"question_content": "My tonsils are swollen and hurt like i have a needle in my throat. I saw a yellow thing coming out from one of the holes in my tonsil. What can it be?", "question_id": "6636517"},
{"question_content": "What causes my swollen , hard, and painful gland on the left side of the groin?", "question_id": "347554"},
{"question_content": "Itchy red pustules on scalp after going to hair salon 6 yrs ago.Now all over body except face.Allergy or follicultis.Allergy meds & prednisone no help?", "question_id": "1420697"},
{"question_content": "Did my ingrown toenail develop into a skin abscess? I've always had irritation from ingrown toenails. Lately, I have even more redness and swelling on my toe near the nail. I clipped the nail several days ago there is still swelling. I actually went to my", "question_id": "384191"},
{"question_content": "I have severe itchy spots on my arms, fingers, back of my knees/hands & ankles. After scratching i get white elevated nickle-sized spots. What is it?", "question_id": "728241"},
{"question_content": "I get a bubble on my eyeball after a sever allergy attack. Is this a normal reaction? I'm allergic to cat dander and when i'm exposed to them my eyes get itchy and watery. However over the past year i've noticed a bubble of fluid on my left eyeball while", "question_id": "387651"},
{"question_content": "I picked dry skin around my earpiercing (had for15yrs), now it's red,swollen,hot,itchy&draining. Salt water sol helps with draining but neosp doesnt?", "question_id": "1555671"},
{"question_content": "My eye when i wake up in the morning has yellow crust on my upper eyelid and the side of my left eye is red and sore i thought it was pink eye and i asked my school nurse and she said it wasn't help me please thank you", "question_id": "389144"},
{"question_content": "I took colostrum for 1.5 months and began shedding hair. My scalp is very itchy now. I have stopped taking it from today. Will the hair loss stop and my hair regrow? I have heard that the igf-1 is the cause.", "question_id": "813817"},
{"question_content": "White raised lines in cheek for 6  weeks now,  red bumps at back of tongue, node under left jaw now sore. could this be oral cancer?, hiv?", "question_id": "6644127"},
{"question_content": "I have a very sore little toe on my left foot. Its very red, sensitive to touch, itchy and rather swollen. I am unsure as to what it is?", "question_id": "628122"},
{"question_content": "My scalp is very itchy. I have used every dandruff shampoo at the drug store and it makes it worse. I do have very mild psoriasis on my knee and foot. Could they be related?", "question_id": "848440"},
{"question_content": "Getting bad headaches for months at top of head with pressure feeling, my head feels sore to touch, like my hair is sore, what could it be?Serious?", "question_id": "483603"},
{"question_content": "I'm over 70, and i'm seriously considering a hair transplant to cover my bald spot, but am i too old? Does age play a part in whether a hair transplant is successful? Is there a certain age group that make the best candidates or does it work well at any a", "question_id": "390185"},
{"question_content": "One of my moles recently started to bleed. Is that a sign of skin cancer? I'm a red head with very pale skin.", "question_id": "613333"},
{"question_content": "I have some itchy white bumps in my scalp.  Is it safe to color my hair?", "question_id": "286092"},
{"question_content": "What are some over-the-counter meds for joint pain (ankles, knees, wrists, etc)?", "question_id": "1106815"},
{"question_content": "Does masturbating cause permanent hair loss or raise DHT causing one to lose hair permanently?", "question_id": "1464883"},
{"question_content": "Help! my doctor say excessive ejaculation/masturbation increases hormone levels & DHT production in body which cause baldness in me.Depressed  ?", "question_id": "1032792"},
{"question_content": "I've had a small bump my shoulder for awhile, recently it appears to have a freckle/mole on it(reddish/brown)& at times itches. Should I be concernd?", "question_id": "59531"},
{"question_content": "If i did chemical peeling for my skin , will the acne scars go away?", "question_id": "870131"},
{"question_content": "I want to have a fraxel laser treatment on my severe acne scars. Is this effective?", "question_id": "158918"},
{"question_content": "Had a vulva biopsy on a mole, something went wrong, I have elevated skin that is painful- i was told it was not a keloid scar, but may need to see a plastic surgeon- what happened to result in this..", "question_id": "612574"},
{"question_content": "Is changing positions during sex a way to get a bacterial infection through the vagina.", "question_id": "597468"},
{"question_content": "I'm have these small red bumps towards my vagina and it itches from time to time and i didn't shave. What can this be?", "question_id": "1244709"},
{"question_content": "Is there any laser treatment for acne scars?", "question_id": "93856"},
{"question_content": "I had a skin infection (staph/mrsa) above my eyebrow if I kiss my boyfriend can he get MRSA even if im taking clindamycin?", "question_id": "1555008"},
{"question_content": "My 16 yrs old daughter has been bothered by chronic yeast infection after taking a very strong antibiotic 3 yrs ago.I've tried cranberry juice, probiotic and OTC product. Her new pediatrician prescribed a 1 dose oral antifungal which did not work, now rec", "question_id": "6771824"},
{"question_content": "I have staph/suspected MRSA on neck..Its covered, treated w meds topical n oral...C as n child sleep in same bed if I lysol sheets before?", "question_id": "84600"},
{"question_content": "My husbands brother had malignant melanoma, is there an increased chance that he would get it ? Or our children ?", "question_id": "824135"},
{"question_content": "Biopsy shows spitz nevus cells under another type of benign mole. Melenoma can't be ruled out yet. Can melanoma grow under a benign mole?", "question_id": "285540"},
{"question_content": "How can I tell if an existing mole is melanoma?", "question_id": "15240"},
{"question_content": "What does the scar from skin cancer vs mole removal look like?", "question_id": "93672"},
{"question_content": "Can my subungual melanoma spread to the bottom of my foot I have a new small brown lump on bottom of foot  looks like a small mole wasn't there before?", "question_id": "290085"},
{"question_content": "How often do pathologists miss melanoma? I have a mole that grew back and although the pathology was normal, i still want the regrowth removed. But it would require excision which is a bit excessive.", "question_id": "571376"},
{"question_content": "Are  mole removing creams harmful? I wanna remove a natural mole. But can I be at higher risk of getting skin cancer for doing this? Im 16.", "question_id": "569578"},
{"question_content": "Could I have melanoma. I have a mole on my ribs that is very big and dark in the center. ?", "question_id": "94186"},
{"question_content": "What does melanoma look like as I have just seem a black mole on my upper back?", "question_id": "876423"},
{"question_content": "I have a black mole and has been there for a while. Could I have skin cancer?", "question_id": "561566"},
{"question_content": "I have a asymmetrical mole with different shades and a small black tubular growth crossing it.I used a pic of it for my profile. Is it melanoma.", "question_id": "850944"},
{"question_content": "Is it common for cyst to form under nipple in male? Swells up oneday , next day smaller. Should i be worried about male breast cancer? 27 yr old male", "question_id": "762314"},
{"question_content": "When do you get regular mammograms? Breast cancer does not run in my family, but i want to make sure i'm doing everything to stay in good health. At what age do you recommend women start getting mammograms?", "question_id": "370754"},
{"question_content": "If mammograms slightly increase my risks of breast cancer, why does everyone say to get them?", "question_id": "14950"},
{"question_content": "Is a two colored mole pr definition melanoma?", "question_id": "758546"},
{"question_content": "Needle aspiration on cyst right breast which didn't collapse 2nd asprtn 2 test cells.Unsure result.Biopsy done results fri....Cancer?", "question_id": "124831"},
{"question_content": "How often should I receive a mammogram I am 29 years old. I have had a knot in my right breast since 2007, my dr says it is caused of caffine but it gets sore sometimes the first knot i had i had it removed it came back non cancer and no cancer cells wher", "question_id": "399388"},
{"question_content": "What to expect when going for a fine needle aspiration biopsy of the breast?", "question_id": "124340"},
{"question_content": "Does a breast cyst always need a needle biopsy  radiology doc just suggest to do a follow up u/s and mamm in 6 months to make sure cyst has not grown?", "question_id": "583841"},
{"question_content": "Is it unusual to not have a fine needle biopsy of breast before surgery?", "question_id": "149389"},
{"question_content": "If you have a fever then take antibiotics and the fever goes away but you still have a big painful lump could this be inflammatory breast cancer?My", "question_id": "943426"},
{"question_content": "Stage 2B idc breast cancer, triple positive. Us shows 6mm thyroid nodule with calcifications next to carotid. Should i insist on fine needle biopsy?", "question_id": "894555"},
{"question_content": "How many days does it take to get blood culture results of a breast abscess?", "question_id": "943460"},
{"question_content": "Breast biopsy report said that they took 4 biopsies but pathology report said \"3 cores measuring 8-9cm each\". Why aren't there 4 cores?", "question_id": "789196"},
{"question_content": "My 4 year old has itchy little red bumps on the side of her face and arms and feet. I believe it's chicken pot does she need to go see the doctor?", "question_id": "1472674"},
{"question_content": "Had breast biopsy 2 months ago that was benign lactational changes. I feel like i can feel a tiny lump there now --can this be the clip they put in?", "question_id": "754908"},
{"question_content": "I have breast cancer, can I do a sentinal lymph node biopsy before i decide on which procedure to do (lumpectomy or mastectomy)?", "question_id": "548779"},
{"question_content": "Should there be little or no pain after a needle breast biopsy?", "question_id": "92818"},
{"question_content": "Mom (46y/o) has small, hard, circular immovable&painless lump on the forehead which appeared during her 20s & diagnosis multiple benign cyst on breast. Help.", "question_id": "1443530"},
{"question_content": "I had lumpectomy for breast cancer then had to have chemo now drs want me to have radiotherapy   i don't want to have anymore treatment  should i?", "question_id": "489698"},
{"question_content": "Do i need a pet scan after surviving breast cancer? I had breast cancer (stage 1) and treatment was successful.  I just had a mammogram and there was no cancer.  Treatments were chemotherapy and radiation.", "question_id": "386024"},
{"question_content": "Are prophylactic antibiotics required for patients whom have had heart valve surgery when having open incision procedures such as breast core biopsy?", "question_id": "746929"},
{"question_content": "Might i still breastfeed with the nipple incision breast augmentation?", "question_id": "898627"},
{"question_content": "I have a lump in my right breast. How can I get help quickly and not wait in a long line for a mammogram?", "question_id": "53656"},
{"question_content": "How can a patient still have cancer after lumpectomy? Cant find good surgeon (even if rich celebrities)? Not fair to need mastectomy vs radiation, etc", "question_id": "54935"},
{"question_content": "When you get genital warts removed with liquid nitrogen, will it leave dark spots on the skin.?", "question_id": "714550"},
{"question_content": "White bump inside the lips of vagina. Got all 3 HPV vaccine shots. Could this be a wart? Does not hurt and there is only one bump for 2 days now.", "question_id": "1547520"},
{"question_content": "My breast cancer came back after 13 years - has radiation and chemotherapy improved since then?", "question_id": "39358"},
{"question_content": "I have a breast lump on the outer right, by the year  2009 I have undergone  mammogram and found out the size was 4/4/10mm. Is there any cure for this?", "question_id": "598216"},
{"question_content": "I'm a factory worker and my job requires me to stand for 8 hrs and sometimes carry heavy things I have breast cancer stage 3 but i 've already done with my chemotheraphy  and radiation last  feb of this year but still have 4 sessions of herceptin. Can i g", "question_id": "506298"},
{"question_content": "If cancer comes back in the same breast after having a breast-sparing surgery, will I need a mastectomy then? Will I be able to have breast reconstruction even though I have had radiation?", "question_id": "39971"},
{"question_content": "Is it true that breast lump or tumor have been in your breast for a year or two and a mammogram can see them?", "question_id": "647378"},
{"question_content": "Hey i have genital warts the doctors told me that i might be HIV positive it's 99% of being positive ?", "question_id": "1525028"},
{"question_content": "Gyn doctor only, what's partial hysterectomy? Does it mean that uterus is left/cut in half ? I have fibroids which needs surgery & want to my organ.", "question_id": "948735"},
{"question_content": "Is it likely that I have breast cancer if the doctors took a mammogram, then an ultrasound, then a breast mri?", "question_id": "250771"},
{"question_content": "Why do doctors ask for both mammogram and ultra sound for the breast?", "question_id": "1603386"},
{"question_content": "My mammogram report results came back birads 4 but my sonogram report came back negative so why does my doctor recommend a  breast biopsy?", "question_id": "323732"},
{"question_content": "Comparison to fordyce spots/warts/herpes: fordyce spots occur in larger numbers (50-100's) whereas herpes/warts are fewer in number? Is this correct?", "question_id": "6717395"},
{"question_content": "Mom was at stage 4 breast cancer, done w chemo and double mastectomy, healing for radiation. Natural supplements that will fight or stop/slow spread?", "question_id": "633467"},
{"question_content": "Is raloxefene the only breast cancer treatment that helps the bones against osteoporosis and does it build new bone, & prevent hip and spine fractures?", "question_id": "766528"},
{"question_content": "Should I be seeking a second opinion when the radiologist stated an area on my baseline breast scan to be within normal tissue after a repeat mammogram and ultrasound? He would like to see me again in 6 months to compare scans.", "question_id": "253915"},
{"question_content": "I'm 68 I have visible blue veins in my left breast, nothing in my right. Had mammogram 4 mos ago and breast exam by doc 3 mos . Are veins sign of bc?", "question_id": "1034457"},
{"question_content": "I had a lump in my left breast about 7 months ago and i had a mammogram the doctor said it was nothing lately it has enlarged significantly ?", "question_id": "633858"},
{"question_content": "Is nipple sparing mastectomy safe for brca 2?", "question_id": "169538"},
{"question_content": "Are dense breasts a problem? My doctor sends me to do mammograms every year. But I am afraid of too much radiation! is this a problem?", "question_id": "602251"},
{"question_content": "What could my breast lump be? It is oval with a horizontal point, about the same size as a green grape, movable, and sore to touch.", "question_id": "817964"},
{"question_content": "Radiologist or Gyn question: During a digital mammogram, can a radiologist see Seborrheic Keratosis on the breasts? I have 3 large and 3 small. Will she know what they are or mark them as suspicious?", "question_id": "1332040"},
{"question_content": "What does angelina jolie's brca test, double mastectomy and oophorectomy mean for the average woman?", "question_id": "771121"},
{"question_content": "Can an area of dense breast tissue just appear within a year of a mammogram and can the area disappear?", "question_id": "643254"},
{"question_content": "Scheduled for diagnostic mammogram of one of my breasts, and a possible sonogram, should I be worried?", "question_id": "142507"},
{"question_content": "Is it possible to have breast cancer cells in lung cancer?", "question_id": "236002"},
{"question_content": "My mom is 72 has breast cancer that spread to her brain she is reciving hyperbaric oxygen therapy has these large knots in her upper thighs im concern?", "question_id": "1037101"},
{"question_content": "Should i get a mammogram i'm 27 and i been having pain in one of my breast and its usually off and on but it goes away but lately it hurts more?", "question_id": "329771"},
{"question_content": "Can radiation therapy treat breast cancer that has come back in the lung?", "question_id": "39254"},
{"question_content": "My mother had a breast cancer surgery 3 months ago and is now taking arimidex. She has lost about 2kg of weight. Any problems?", "question_id": "960175"},
{"question_content": "Is brca genetic testing a simple blood test?", "question_id": "904397"},
{"question_content": "Should both mammogram and sonogram be done forlarge breasts?", "question_id": "98840"},
{"question_content": "Long term effects of radiation therapy for breast cancer vs surgery?", "question_id": "304447"},
{"question_content": "For breast which is best digital mammogram or sonogram?", "question_id": "149919"},
{"question_content": "I'm a 16year old. I have a very sore lump under the skin of my right breast. It is located beneath the nipple. I'm terrified, what could this be?", "question_id": "1446277"},
{"question_content": "Is mammogram or ultrasound best for early breast cancer detection?", "question_id": "303906"},
{"question_content": "Can breast cancer recur after radiation therapy?", "question_id": "39211"},
{"question_content": "What is the difference between a breast ultrasound and a mammogram?", "question_id": "185558"},
{"question_content": "How soon after breast reduction surgery can you begin taking phentermine on average?", "question_id": "650507"},
{"question_content": "I go soon for an diagnostic mammogram. Will I need a breast ultrasound?", "question_id": "176706"},
{"question_content": "Life expectancy for lung cancer gone to brain. Pet scan shows no other cancer now, only 1 tumor on brain. Surgery and whole brsin radiation will be?", "question_id": "528742"},
{"question_content": "Would a deep plane face lift leave me with less sensation in my face? I had a breast lift years ago, so i know that cosmetic surgery can cause some loss of feeling in the treatment area. I'd like to reduce the sagging in my cheeks and around my mouth with", "question_id": "383294"},
{"question_content": "Why do I need mammogram and a breast ultrasound?", "question_id": "106560"},
{"question_content": "I am worried about cancer due to radiation because I have had 4 brain CT scans in a year.Plus a heart CT before brain surgery.Plus 3 contrast dyes.", "question_id": "946162"},
{"question_content": "If my head CT scan radiation gonna cause a brain cancer to me i  need to start worry about it after 5 years or 20 years and more after the scan?Scared", "question_id": "583262"},
{"question_content": "Radial artery occlusion. How do u know if u have good vascular blood supply or circulation in fingers and hands. What tests determine this.", "question_id": "863187"},
{"question_content": "Can I find out if a breast cyst / tumor is malignant through a breast ultrasound and mammogram?", "question_id": "237562"},
{"question_content": "How might i go about finding doctors who have a specialization in breast augmentation and cosmetic surgery?", "question_id": "784543"},
{"question_content": "What is the value of a breast ultrasound vs mammogram?", "question_id": "173022"},
{"question_content": "I am a lung cancer servivor of 15 years I have had bronchitus since mid july I have had a chest xray and a cat scan and my lungs are fine my cancer treatment was surgery to remove top lobe of left lung and 6 and a half weeks of radiiation?", "question_id": "285513"},
{"question_content": "Are aspirin, acetaminophen and ibuprofen equally good at preventing heart attacks?", "question_id": "35732"},
{"question_content": "Is breast ultrasound as effective as a mammogram?", "question_id": "366195"},
{"question_content": "I've had on/off fever for months, but now it's been 11 days w/o relief with aleve/tylenol. Begins a few hours after i wake and i feel terrible. Ideas?", "question_id": "1244758"},
{"question_content": "Parkinsons symptoms in brain--does it cause dementia or depression?", "question_id": "119966"},
{"question_content": "Can I take an Advil for headache after taking a low dose aspirin?", "question_id": "35735"},
{"question_content": "May be far fetched but can plavix cause depression or reduced the effectiveness of wellbutrin?", "question_id": "819923"},
{"question_content": "I take, as directed, hydrocodone 10-325 with Tramadol 10 mg. I am out of Tramadol. Can I use Advil or alleve instead. If so how many? thanks", "question_id": "6732950"},
{"question_content": "How is smoking and drinking alcohol related to breast cancer?", "question_id": "14961"},
{"question_content": "Is vascular dementia worse than alzheimer’s at the end stage?", "question_id": "111973"},
{"question_content": "Any better alternative to risperidone, given its side effects, for me to discuss with my mom's doc?  She had a TIA and developed occassional hallucinations. She has lewys body dementia/parkinsons.", "question_id": "1039854"},
{"question_content": "I have a severe allergy to ibuprofen as well as aspirin. Is vicodin safe to take for a serious migraine?", "question_id": "1509551"},
{"question_content": "I have severe neuropathy pain as a result of radiation & chemo for colorectal cancer Stage IIIB. Taking Neurontin. Tried Lyrica. Nothing is helping.", "question_id": "1496130"},
{"question_content": "I took 2 zyrtec 10 mg and I was around 2 dogs for several hours. I'm wheezing and chest feels tight. Is it safe to take benadryl?", "question_id": "1475088"},
{"question_content": "When blow nose, mucus is bloody.  Lots of yellow-green postnasal drip. Some wheeze. No fever.  Take Dymista, Allegra, singulair, qvar, and Ventolin. It's not allergy. Sinusitus?  Go see primary care or wait it out?", "question_id": "1530970"},
{"question_content": "Is it ok to alternate zyrtec(prescribed) and Benadryl (otc) for a few days for an allergy attack. Would be z in am and b at pm. 17mth old male", "question_id": "277695"},
{"question_content": "I went to the doctor two days ago for sore throat and congestion, I was given amoxicillin but now I chest congestion, phlegm, and productive cough.", "question_id": "1464282"},
{"question_content": "Can you donate blood if you are taking prescription medications?  Klonipin , cymbalta, 1 mg folic acid, singulair, qvar, Ventiolin , nasonex, latuda, trazodone, as well as Allegra, and a multivitamin .", "question_id": "1595118"},
{"question_content": "My son has just had his 4 year old immunisation needles & his right arm has swollen up & has a red rash. He says its itchy & is getting worse?", "question_id": "687537"},
{"question_content": "My first day of taking Zoloft and last night I took trazodone for sleep, I took half a Zoloft and have had a dull headache all day. Is this normal?", "question_id": "60061"},
{"question_content": "Is it ok to take Lyrica and Neurontin? I use Neurontin to help me sleep at night. Won't take together just same day", "question_id": "1500420"},
{"question_content": "I've taken flonase, allegra, and Mucinex as prescribed for 4 days and my symptoms seem to be getting worse. What should I do?", "question_id": "1555024"},
{"question_content": "Are there any side effects switching from Neurontin to lyrica?", "question_id": "1411389"},
{"question_content": "Hi I am really embarrassed at the moment I am 37 weeks pregnant n have an itchy clitoris n it's quite sore when I scratch it also red n a little swollen what's wrong with me?", "question_id": "6652476"},
{"question_content": "I just had a brain aneurysm coiled. My BP has been as low as 88/46 and pulse 100 with daily headaches and dizziness. What should I do?", "question_id": "788773"},
{"question_content": "Stiff neck, weird numb feeling in forehead right at eyebrows and temples for a month. Doesnt actually hurt. Bloodtests and 2 CT normal.Aneurysm?stroke", "question_id": "1531075"},
{"question_content": "If you only have a herpes outbreak in your anus but never noticed a vaginal outbreak, can you still spread herpes through vaginal sex or just anal?", "question_id": "1016700"},
{"question_content": "I just started celexa 40 mg 4 days ago.  My anxiety has increased the last couple of days.  Can i take Xanax to take the edge away and calm me down?", "question_id": "502956"},
{"question_content": "Why the skin of my anus is irritated itchy, and the anus skin is cut, open , pealed skin, broken little spots about 2or 3 months, is frustrating?", "question_id": "1225116"},
{"question_content": "What type of herpes simplex virus causes cold sores?", "question_id": "11795"},
{"question_content": "If I take melatonin regularly each evening to successfully to treat insomnia and miss a dose, will I experience sleep disruption?", "question_id": "190738"},
{"question_content": "How long is  the coxsackie virus/hand, foot, mouth contagious 4? Is just when they r running a high temp or until the rash disappears?", "question_id": "182234"},
{"question_content": "If one can't sleep without trazodone, but can sleep with trazodone, does that count as sleeping? Have hang over for long while after waking up", "question_id": "960780"},
{"question_content": "What is the definition or description of: herpes simplex i/ii IgG and igm?", "question_id": "488234"},
{"question_content": "2yr old snores really loud at night & sometimes gasp for air. Could it be large adenoids or sleep apnea?  He also have iron deficiency anemia. Thanks", "question_id": "564415"},
{"question_content": "Have you ever heard of a doctor prescribing blood pressure meds for a four year old for sleep along with ADHD meds?", "question_id": "848644"},
{"question_content": "What are normal breathing sounds for 92 yo? All night long has gasps, lapses, loud breaths, not typical snoring. Never noisy before. Sleep apnea?", "question_id": "319950"},
{"question_content": "If you get cold sores, can you transmit hsv1 to someone genitally through oral sex when you don't have a cold sore?", "question_id": "1165353"},
{"question_content": "I had sleep study done as a child nothing was found sleep apena was diagnosed today i think my TMJ and seroquel changed it i breath can I talk to pcp?", "question_id": "1100914"},
{"question_content": "Insomnia, frequent waking, very heavy snoring, unrefreshing sleep, fatigue every day. Sleep study confirms no sleep apnea present. What could it be?", "question_id": "854973"},
{"question_content": "Hsv 1. My partner 30 year old shows HSV 1 IgG detected. Igm  negative. She says she has not had cold sores since childhood. Can she tramit HSV 1 to me?", "question_id": "131698"},
{"question_content": "Hi... Is there any way to get rid of snoring.. My mom has a srver problem of snoring...", "question_id": "1068136"},
{"question_content": "I have history of elevated blood protein(8.3-8.7 since 09). Recently did spep with elevated gamma globulin. Why would pcp refer me to hematologist?", "question_id": "965608"},
{"question_content": "How to stop my snoring?", "question_id": "267892"},
{"question_content": "Can there be some ways to reduce the loudness of someone snoring or completely stop their snoring?", "question_id": "1106201"},
{"question_content": "My son 22 months old has a cold, nasal congestion. Is there any nasal decongestant spray that would help. I am using the saline spray and OTC zyrtec. ?", "question_id": "151009"},
{"question_content": "Can anything be done to reduce or eliminate snoring?   My husband doesn't have sleep apnea but his snoring prevents us from sharing a bed.", "question_id": "792448"},
{"question_content": "My 7 yrs old has enlarged adenoids. His ENT has given him nasonex spray  for  2 months two times. After treatment he stopped snoring. But he starts snoring again after couple of weeks after stop med.", "question_id": "1015574"},
{"question_content": "Had botox for TMJ spasms month ago. I know botox weas off, but is it possible that it'll give muscles chance to heal & effects can b more longterm?", "question_id": "1159440"},
{"question_content": "How i can stop from snoring? Is there treatment to stop it? What should I do? I feel ashamed when i sleep with my friend.", "question_id": "970997"},
{"question_content": "My hubby always congested, uses nasal spray nightly despite the directions! snores very loudly due to sleep apnea, cpap didn't work for him. Advice?", "question_id": "124785"},
{"question_content": "21yo female, STD free. Small pimple like sore on lower right vulva. Was prescribed clotrimazole with betamethasone. Its been 2 months and no change?", "question_id": "1237393"},
{"question_content": "What do you do if you have lots of ear and jaw pain after a tonsillectomy?", "question_id": "271756"},
{"question_content": "How long will it be after my tonsillectomy until I can eat real food?", "question_id": "37191"},
{"question_content": "My 9 year old daughter appears to have a sinus infection( facial pain, stuffyness, cough for a week, we have been to the pediatrician twice  and she is now on antibiotic but the past three night prior she has been vomiting on when lying down and trying to", "question_id": "344677"},
{"question_content": "I have sharp pains in temple, jaw clicking, pain radiates up side of face, into ear and back of head. Sometimes a \"toothache\". Could this be tmj?", "question_id": "6624568"},
{"question_content": "I cough up clear mucus everyday, for about 6 months now. I often am wheezing until after I use an albuterol inhaler.This is all worse in the mornings.", "question_id": "1450818"},
{"question_content": "I had a normal MRI of the head. would that have shown any tumors that could cause symptoms in ear? (i.e. pressures, whooshing sound when swallow)", "question_id": "1424988"},
{"question_content": "Iv had 5 doctors and one says I have TMJ amd fiur say its glue ear could it be both and my dentist can feel my jaw is clicking?", "question_id": "559741"},
{"question_content": "Is it considered cosmetic surgery if I get my front teeth aligned?", "question_id": "255870"},
{"question_content": "Filling a month ago, sensitive to cold only. dentist said that is ok if not sensitive to hot also. does that sound right?", "question_id": "1389378"},
{"question_content": "I have a headache with ear ache and a swollen jaw, what could this be?", "question_id": "528847"},
{"question_content": "How do i know if my infection tooth is spreading I'm on amoxcillin. I now have a sore ear and throat. Is it spreading? I don't see an abscess. HELP!", "question_id": "6705207"},
{"question_content": "Can ear infection cause intense tooth ache where a tooth has been extracted along lower jaw line . And i can't bear to eat or touch the area. ?", "question_id": "533059"},
{"question_content": "No cough or sputum but I have a wheeze and tight chest. Pred. Value spirometry is 83%. Is this COPD or late onset asthma?", "question_id": "675293"},
{"question_content": "The left side of my body sometimes feels weaker or stiffer than my right, and sometimes i get headaches on the right side of my head. I have health anxiety. Wondering if this sounds like a brain tumor?", "question_id": "869379"},
{"question_content": "Right ear ache, right side of jaw hurts as well as the right side of my throat. Day 4 of taking amoxil still no relief. Pain caused by infection?", "question_id": "690961"},
{"question_content": "Jaw pain, headache and ear pain and pressure? Also have painless lumps under chin and jaw not sure if related? No fever. Pain relievers not helping", "question_id": "1222809"},
{"question_content": "Okay so yesterday went to kiss my bf when he was sleeping and he wokeup and his head hit my nose it made a loudcrack it has a bump tender pressure?", "question_id": "90888"},
{"question_content": "I have had a tooth distracted 1 week ago n still hurt really bad in my head, ear n through, went back to dentist but still hurt! is that normal?", "question_id": "612741"},
{"question_content": "Can a brain tumor grow within 6mths i'm worried cuz i get pains n my head & headaches it's like a everyday thang i've had MRI & CT 4mths ago i'm scare?", "question_id": "600113"},
{"question_content": "Hi, I've got a few red prickly spots on my soft palate and a mild sore throat over the last 2 days. A similar thing occurred a few months ago. ?", "question_id": "1447916"},
{"question_content": "My question is, I have a bad sharp headache that wakes me up at night, but im not sure what it is. My symptoms are, dizziness, lightheaded, i feel loss of balance, i feel weak and tired have trouble concentrating, have tingling in my head when it hurts. B", "question_id": "386027"},
{"question_content": "Rash on the inner top of my foot. It is red, dry, it itches and hot water hurts so bad. Eczema or possibly athletes foot?", "question_id": "79184"},
{"question_content": "Aching pain in arms, hands, legs, feet w/occasional tingling. Did not fall, but have back pain with feeling of pressure on lower spine. Ruled out diabetes, aids, nutritional def. I'm 28. Any ideas?", "question_id": "640740"},
{"question_content": "I have normal blood pressure even though i'm overweight. For several months now, I have been getting lots of swelling in my legs and feet daily. What should I do?", "question_id": "329999"},
{"question_content": "Can you have strep throat but with no symptoms? I do have swollen tonsils, white spots, and a sore throat, but no fever, aches, etc. I feel fine..", "question_id": "1380683"},
{"question_content": "Lump under cheek bone, like a firm sac, runs in direction diagonally from ear to mouth deep down. Could it be anything to do with a tooth/jaw infectio?", "question_id": "1285692"},
{"question_content": "I have a strawberry look like tongue with sore throat(pharyngitis) but i only had low fever during night, what is this disease?What cause it?", "question_id": "530137"},
{"question_content": "My son s tonsil is very swollen, bleeding it has some white spots.He has a sore throat but no fever.Should we take him to doc or will antibiotics work?", "question_id": "513678"},
{"question_content": "What is the best medicine for anxiety? I'm on celexa and it doesn't work. I have a constant fear of having a heart attack like my father.", "question_id": "1189507"},
{"question_content": "Having wooshing? Sound in ear like i can hear my heart beat for about a year.Dr keeps saying ear infection but not going away&ha some bad can't do muc", "question_id": "676908"},
{"question_content": "Hidden white bumps under left tonsil, post-nasal drip, ear pain, tinnitus, pain swallowing, sleep apnea, ear barotrauma, blurry vision, sore throat. ?", "question_id": "1222122"},
{"question_content": "I hear a sound in my ear when i'm swallowing. I also can make the sound everytime i want. The sound somehow like \"click\" sound. Is it normal?", "question_id": "323800"},
{"question_content": "Brief episodes of pulsatile tinnitus left ear only upon standing up? . Multiple normal 3t mri/a cta head neck for headaches. Normal BP and weigh.", "question_id": "1214669"},
{"question_content": "How many cortisone shots are too many to treat my tennis elbow?", "question_id": "28185"},
{"question_content": "Dad had bad pain, at and below elbow (wrist, fingers). Neuro diagnosed with ulnar nerve entrapment. No improvement after 1 week. What to do for pain?", "question_id": "855176"},
{"question_content": "The left side of my throat is swollen, along with the feeling of slight pressure in the lower jawline and inside the ear when i swallow. Concern?", "question_id": "636845"},
{"question_content": "I fell on my elbow; X-ray n not broken, MRI shows ligament damage, cortisone shot n no pain. 4 months later extreme pain - do I need surgery?", "question_id": "174274"},
{"question_content": "Felt ill.  Chills and bad sore throat.  Maybe a cold? Same today. Noticed small discoloration on tongue on side (no black) and bump near back. CANCER?", "question_id": "6715960"},
{"question_content": "50y 85k.  Ht.5'6\" s chol 197 hdl. 42 LDL 109 vldl 19 tryglyceride 96.   Is I am heart patient? My BP 150/90.", "question_id": "664973"},
{"question_content": "My 2 1/2 yo was treated w/ amoxicillin for an ear infection. As soon as finished med he spiked another  fever. Is it possible that amox  didn't work?", "question_id": "595179"},
{"question_content": "Is it normal to have tingling in my hands after carpal tunnel surgery?", "question_id": "34159"},
{"question_content": "Should my hand still swell after having carpal tunnel surgery 7wks ago?", "question_id": "951452"},
{"question_content": "I have an LDL 131 mg/dl, HDL 54 mg/dl and trig 115 mg/dl. I eat plenty of fruits and vegetables, exercise, don't smoke/drink and have a BMI of 21. ?", "question_id": "748732"},
{"question_content": "I have to select a surgeon for inguinal hernia surgery. One has lower degree but performs mostly hernias. But lately, too many patients come back with infection. Other has asuperior degree, but mostly performs on upper abdomen and has least post surgical", "question_id": "343042"},
{"question_content": "Is it normal for black and blue on the palm of your hand and wrist post carpal tunnel surgery.  It's been 5 days. ?", "question_id": "819160"},
{"question_content": "Dr. Says hard lump mid. Of arm above elbow to the right feels like swollen lymph node. Doesn't think cancer, wants sonogram. Wht else could it be?", "question_id": "217901"},
{"question_content": "I was told today by my surgeon that I have a weakend spot in my abdomen wall where he was unable to bridge the mesh during my hernia surgery in july.  Will a hernia form at the weakend spot ?", "question_id": "511270"},
{"question_content": "I have a hernia on my groin and I have basketball tryouts today. Is it safe for me to tryout? Its on my right side and its really close to the crease where my thigh meets my vagina", "question_id": "382289"},
{"question_content": "I packed a hand wound with paper and now it's gone. Hand is swollen (size of an egg) lots of pain, red, and tender. Should i go to urgent care or er?", "question_id": "1289426"},
{"question_content": "I had open inguinal hernia surgery 3 weeks ago and was told by my surgeon not to lift anything over 30 lbs. Two days ago, i lifted a grocery bag which weighed about 15 lbs. Can this affect anything?", "question_id": "750092"},
{"question_content": "I have a sore in my mouth, looks like a little line of yellow. It's by my gums but on the upper part of my cheek,  doesn't hurt but keeps coming back?", "question_id": "1425882"},
{"question_content": "Cut myself with a kitchen knife on tuesday. Yesterday i woke up with sore throat and difficulty swallowing, today stiffness in jaw do I have tetnaus or another infection from the cut?", "question_id": "1068332"},
{"question_content": "I bumped my elbow hard today on something. No bruising or swelling but really hurts! Should I ice it? Or what?", "question_id": "1519979"},
{"question_content": "My son may have ringworm of the scalp. His skin is flaking - and a sore on his scalp.  It's itchy and he has a stomach ache, headache and sore throat?", "question_id": "1555739"},
{"question_content": "I have major GI issues and feel stuff getting stuck in throat I am ANA positive no skin issues or raynauds but think i may have scleroderma , advice? So scared see dr. Chittajee tomorrow. Im only 27!", "question_id": "832528"},
{"question_content": "I have pain on the right side of my palm wrist area radiating up my arm is this carpal tunnel ?", "question_id": "869108"},
{"question_content": "My fingers turn white when i get cold and I have a lump on my  wrist - could this be carpel tunnel? Nothing hurts yet - i sleep on my hands too.", "question_id": "575544"},
{"question_content": "Is florastor probiotic good for maintenance of IBS related symptoms? Also, by it being a yeast, is it safe for someone who has been in remission from C.diff colitis? Lastly, when taking florastor, is it normal to have stomach rumbling and extra gas if you", "question_id": "1544197"},
{"question_content": "I have a fear of getting lukemia or lung cancer from one chest CT scan which i had one month ago. Is it dangerous to have CT scan? Can i get cancer ?", "question_id": "1287470"},
{"question_content": "I had a wasp sting yesterday in my toe and during the last two hours it has swollen double size but does not hurt. What should I do?", "question_id": "249152"},
{"question_content": "Pain in upper back with painful spots to touch b/w shoulder blades and spine, 1.5 months, chest CT normal. Am a smoker, can this be lung cancer", "question_id": "959243"},
{"question_content": "Can bee stings make your whole leg swell, even if you're not allergic? I got stung by a bee medial to my left knee about 36 hours ago, i never saw the bee, i just had to assume by my symptoms that it was a bee. The sting has been swelling non-stop since i", "question_id": "379810"},
{"question_content": "Can extremely tight jeans cause DVT (blood clots) in legs?", "question_id": "868591"},
{"question_content": "I have a fractured finger and my doctor used the method of taping it with the finger next to it with tape, can that cut the circulation of blood to it?", "question_id": "1230871"},
{"question_content": "Pain upper left near ribs. Fluttery on right near ribs. Nausea.Sensitive breasts.Pelvic discomfort/pain. Dark areas on areola.\n Negp 10 days ago?", "question_id": "94751"},
{"question_content": "I am 10weeks pregnant and I don't feel any pain in my breasts I can't even feel if my belly is growing is it normal? I even did't had any special need", "question_id": "238485"},
{"question_content": "After sleeping heavily medicated, I have had a numb upper left arm for 1.5 days non-stop. I am a type 1 diabetic. Do I ned to see a doc or wait for it?", "question_id": "1407400"},
{"question_content": "Why do so many mds assume depression/anxiety when they can't find the problem?My former md did this and missed my lupus diagnosis.I wasn't depressed!", "question_id": "642085"},
{"question_content": "On BC. Lost virginity 3 days ago. Breast tenderness, lower abdominal pain, pain behind ribs. Got diagnosed with UTI today. No burning in pee. Preggo?", "question_id": "1446074"},
{"question_content": "What causes a vibrating, pounding sensation in legs when lie down.  Also have slightly swollen ankles and leg muscle cramps.  Ty?", "question_id": "946077"},
{"question_content": "I have all the symptoms for lupus or ra, but tests came back negative. Can I still have either?", "question_id": "55211"},
{"question_content": "Poor posture/tense when asleep/grind my teeth at night /possible lupus or depression/Slightly low iron how to determine cause of fatigue/Weakness?", "question_id": "1419909"},
{"question_content": "Which birth control method is least likely to cause depression/fatigue/weakness?", "question_id": "290582"},
{"question_content": "I have chest pain. Is above my breast, left side and only feel the pain when I take deep breath. It happen on and off. Worry.?", "question_id": "278909"},
{"question_content": "I have small fiber neuropathy and i'm taking 900 mg of gabapentin for my foot pain. Not helping at all. What's the chance the max dose will help?", "question_id": "753152"},
{"question_content": "How sensitive is the biopsy test for small fiber neuropathy?", "question_id": "1347369"},
{"question_content": "39 year old woman with mild/moderate rheumatoid arthritis.  Cbc done - hemoglobin, hematocrit, MCV levels low, but iron is in normal range?", "question_id": "1170926"},
{"question_content": "Mother in icu. Skin infection from mid back to left breast. Red, hot, raised, with blisters and dark purple streaks. Kidney level 15. Cardiac enzyme high. Chest pain. Short breath. What to expect?", "question_id": "686837"},
{"question_content": "I gave birth a week ago and got an epidural. And now my leg and feet are numb and tingling. How long will this last? And what can I do to fix it?", "question_id": "197889"},
{"question_content": "I've been dealing with strange headaches for years. The pain is on the top and around my head. I also have ear as well as neck pain. What should I do?", "question_id": "917288"},
{"question_content": "Ten days out surgery to repair both meniscus in left knee, ankle and foot swollen. Sonogram for clot negative. What to do for normal?", "question_id": "823203"},
{"question_content": "I have bad knee pain, doctor said it might be my meniscus and said it might be the cartilage. Does that seem right?", "question_id": "1464136"},
{"question_content": "I have pain in my upper buttocks and my hip joint when moving the leg sideways. Is this a hip problem or sciatica? Groin pain too but could be hernia", "question_id": "851925"},
{"question_content": "While running at high speed i experience chest pain in the lower left side.Why? I am a healthy  guy with no history of heart condition.", "question_id": "1556825"},
{"question_content": "Have produding disc l5s1 with sciatica in buttocks and leg, hip and testicle pain. Im lately feeling fatigued all the time. Is this linked to disc?", "question_id": "986839"},
{"question_content": "Weird feeling in back of knee almost like hitting funny bone..tingling also. Radiates down to foot with pain in foot and sometimes calf also. What could this be? no swelling", "question_id": "6699115"},
{"question_content": "Fell down hurt my knee. Swollen & bruised. 1 week later side of foot has started turning black & blue & hot to the touch.Should i be concerned?", "question_id": "842687"},
{"question_content": "Is it normal for dominant arm bicep and triceps to be slightly large than my left arm. Muscle imbalance? no weakness. neuro for EMG to check ALS?", "question_id": "1521530"},
{"question_content": "Unexplained  bruising all over body, fatigue,  wieghtloss, headaches, loss of appitite, body aches, mild dizziness, weak legs.What going on with me?", "question_id": "1475068"},
{"question_content": "After having a DVT where clot is behind knee, is it better to wear compression stockings below knee or above?", "question_id": "29227"},
{"question_content": "My bicep is sore and it is occasionally twitching. Is this serious, or could it be a pulled muscle? Could it be ALS?", "question_id": "1475017"},
{"question_content": "What causes hip and knee joint pain in someone who is in their early 20s?", "question_id": "61825"},
{"question_content": "I slept off and on last night, yesterday I had a  horrible anxiety attack that lasted all day. Took .5 ativan at 730 8pm and another at 3am. Could that be why I'm so tired? Heads full and heavy. Dizzy", "question_id": "6742055"},
{"question_content": "Will 2mg valuim help me fall asleep? I've been talking ativan and took 1mg early morning and got maybe 2 or 3 hours of sleep off and on.. my therapist said to try the valuim. I just really want to zzz", "question_id": "6743273"},
{"question_content": "Haven't been getting good sleep for the past few days, anxiety is very bad, everything seems like a dream, talked To therapist and ER told me to take ativan amd sleep. Very nervous about taking it.", "question_id": "6742735"},
{"question_content": "Is it true that you can gave benign fasciculations of the tongue? My tongue twitches a few times a week, is it more likely als? No other symptoms.", "question_id": "1441081"},
{"question_content": "I've had chronic sinusitis for many years. 2  fess surgeries, allergy shots & all the antiinflammatory/histamines, nasal rinse have not worked. Maybe balloon sinuplasty, or could it be a fungal prob?", "question_id": "569515"},
{"question_content": "I tweaked my right knee playing basketball last year and now when I put pressure on it at certain angles, it just gives out. What could this be?", "question_id": "76149"},
{"question_content": "Can there be chronic allergic sinusitis with only significant nasal congestion and malaise without any apparent mucus or nasal discharge?", "question_id": "54962"},
{"question_content": "I smoked for twenty years and recently quit, I have allergies and post nasal drip. No matter what I do I can not get rid of the post nasal drip and subsequent bad breath, quitting smoking has helped somewhat but not really, I use saline nasal spray and a", "question_id": "274119"},
{"question_content": "Is a saline nasal spray safe to use with asthma and allergies? Thanks.", "question_id": "360746"},
{"question_content": "What's the best OTC medication for nasal congestion due to sinusitis infection?", "question_id": "175894"},
{"question_content": "I had a decompressive laminectomy at the l3/l4, l4/l5, and l5/s1 on 9/25/12 now when i try to sleep, i wake up everu hour in horrible pain. Why?", "question_id": "524316"},
{"question_content": "I had endoscopic sinus surgery.  How long do I have to wait before I start doing weights?", "question_id": "176931"},
{"question_content": "Will using a salt water nasal spray help prevent developing a perforated septum?", "question_id": "100845"},
{"question_content": "I noticed when i squat my knee joints make a weird cracking noise . It doesn't hurt it sounds like i'm cracking my knuckles. I strech almost daily.", "question_id": "1050637"},
{"question_content": "Will using a nasal spray help treat a deviated septum?", "question_id": "107957"},
{"question_content": "What is the recovery timeline for arthroscopic knee surgery?", "question_id": "30690"},
{"question_content": "I have femoral neuropathy after having simple arthoscopic knee surgery. My doctor tells me it's from the nerve block?How common and long this last?", "question_id": "323383"},
{"question_content": "Pain from knee down... On my feet for 9 hrs. Walking, bending and squatting.... When i'm at rest tends to hurt at its worst.  Shin and calf aches-pain?", "question_id": "486834"},
{"question_content": "Besides surgery is there an alternative for knee pain?\n\nBecau 88 year old female. Good health but fear of a possible  stroke if she has surgery. Has tried\nmany pain relievers but nothing seems to help. She also has neuropathy in her feet. She is not a dia", "question_id": "402666"},
{"question_content": "Would toddler have symptoms w/ skull fracture? He bump heads w/bro. There's a soft red swollen bump on forehead for 3 days. Touch doesn't bother him.", "question_id": "589623"},
{"question_content": "What do you recommend if I had wisdom teeth xrays taken couple days ago, lowr right area very sore, hurts wen eating/drinking. wut to do?", "question_id": "1323262"},
{"question_content": "My knee keeps swelling it hurts, I dislocated it bout 4 years ago...What can I do? Its feels like its turing over when I walk! I've used ice an heat", "question_id": "181934"},
{"question_content": "I need a opinion i had knee surgery 1 year ago for plica resection I am still having a lot of pain what could it be? Was told no arthrtis", "question_id": "613052"},
{"question_content": "Is a little pus on my partial knee replacement sight where the stitch is anything to be concerned about a month after surgery?", "question_id": "233537"},
{"question_content": "What are the chances of  the surgery changing from a partial knee replacement to a full knee replacement?", "question_id": "196980"},
{"question_content": "Should i request a pet scan? For the past seven months I have had a sharp, aching pain in my shin right on the bone near my knee that has progressively gotten worse.", "question_id": "603986"},
{"question_content": "I have neck and knee arthritus, i want my whole.Bone structure evaluated. What is the type of doctor that does this called?", "question_id": "1170358"},
{"question_content": "Does anyone know, after hallux valgus-hammer toe correction surgery, doctor arranged plaster of paris bandage upto knee.?", "question_id": "1103209"},
{"question_content": "Can knee surgery cause swollen foot?", "question_id": "954008"},
{"question_content": "Why is my foot so swollen after knee surgery?", "question_id": "57322"},
{"question_content": "Big toe broken.One doc (podiatrist) says it's not displaced, the other (sports med surgeon) it is slightly. They agree in no surgery by now. Agree?", "question_id": "315046"},
{"question_content": "I have a ruptured L4 L5. I have recently started having groin pain I had two epidurals 2 weeks ago. leg pain stopped. not groinhave a injured s1?", "question_id": "6729603"},
{"question_content": "Are there non steroidal and non surgical treatments for a l5-s1 disc hernia?", "question_id": "75354"},
{"question_content": "Can you tear acl/ MCL if a knee cap dislocation, x3weeks later still can't bend knee past 45*  I've dislocated b4 and can't remember recovery last4ever.?", "question_id": "72973"},
{"question_content": "Could sleep apnea cause autonomic neuropathy ? Doctor is telling me it can ? Any idea ?", "question_id": "930247"},
{"question_content": "I get painfully intense itch only on the middle toe of each foot.If the toe is dry, it is okay, but if it is sweaty, it itches. Its likeath-ft but it never spreads, always on the same toes. Theath-ft medicines are useless. Sometimes it is so badthat i wis", "question_id": "966097"},
{"question_content": "I have recently had an ACL surgery 5months ago and i  am starting to experience knee crackles every time i bend it. Is this normal?", "question_id": "323935"},
{"question_content": "Dermatology or pediatrition only please.  5 wk old baby redness and small tiny bumps on face and a little on neck. Acne? What else? Treatment?", "question_id": "618390"},
{"question_content": "I've had ACL reconstruction and the foot on that leg tingles and hurts really bad. Nothing else is bothering me, no pain in the knee. What could the reason be?", "question_id": "342655"},
{"question_content": "Had an appendectomy 2.5 weeks ago. Did heavy lifting 2 days ago; now abdomen hurts. More pain plus gas and bloating after eating now. Should i worry?", "question_id": "612345"},
{"question_content": "Upper left abdominal pain for a year- went to doc 6 months ago had us \"didn't see anything\" should I go again? Super busy & don't want unecessary bill", "question_id": "1219903"},
{"question_content": "My father's leg became very red hot and swollen from the knee down and was hurting, Dr. Said he had been bitten by something, what could cause this?", "question_id": "1402511"},
{"question_content": "Why are my legs red almost like a sunburn, from my knees to my ankles? They aren't swollen & they don't hurt.", "question_id": "728449"},
{"question_content": "I cut my foot years ago now theres a hard lump, maybe calcium buildup, may not. After resting for a while it really really hurts just a walk.", "question_id": "1238576"},
{"question_content": "I have bumps like zits on the rim of the head of my penis there white and I have had them forever never paid attention but this is not normal what wro?", "question_id": "1068721"},
{"question_content": "Do you think a 16yr old that has bloating and feeling pressure in abdomen for 4 weeks have stomach cancer?", "question_id": "856527"},
{"question_content": "A week ago my right big toe started to hurt so bad. I could barely walk on it.  Since thanksgiving it has been, red, swollen and painful. Ingrown toe?", "question_id": "488760"},
{"question_content": "Why does my foot hurt bad after it got the ingrown toenail removed by a doctor befour the nail even grew all the way back a sharp pain?", "question_id": "596142"},
{"question_content": "I have a callous on the inside of my baby toes.  It hurts really bad. How did i get it? How do I get rid of it?", "question_id": "754614"},
{"question_content": "How do I remove a painful callus underneath my toe?", "question_id": "325099"},
{"question_content": "I have like a callous in between two of my toes. It hurts whenever it kind of bumps into something. This small hard part hits the flesh and it hurts.", "question_id": "641668"},
{"question_content": "I got a callous between my baby toe and the next toe , i've tried to scale it down but can't get all the way to it ..It there anything I can do ?", "question_id": "87542"},
{"question_content": "I have corns and calluses on my feet, and sometimes suffer from athletes foot. The sides of my feet are bright pink in colour and flaky, what is it?", "question_id": "615798"},
{"question_content": "Keep getting callus in same area of sole under 3rd toe. Area hurts even if i stand still?", "question_id": "1438535"},
{"question_content": "How to remove corns and calluses on your feet?", "question_id": "811815"},
{"question_content": "Is sucking on a pacifier any better for a baby's dental health than sucking on a thumb? Our daughter sucks her thumb all of the time, and we've heard about the damage it can do to a child's teeth. Since pacifiers are softer, we were hoping we could someho", "question_id": "400155"},
{"question_content": "I have pelvic pain, spotting between periods and bloating could it be cysts in ovaries?", "question_id": "1571254"},
{"question_content": "Can you have a urinary tract infection without pain? My only symptoms are light pink bleeding and horrible pressure as if I have to push to urinate", "question_id": "1440609"},
{"question_content": "Can a single pimple around the vaginal area consider to be an std?", "question_id": "61033"},
{"question_content": "What's the relationship between interstitial lung disease and pulmonary fibrosis?", "question_id": "37080"},
{"question_content": "If i had unprotected sex on 2-2-13, could a pregnancy have been mistaken as a cyst on my right ovary on 2-20-2013?", "question_id": "761587"},
{"question_content": "If I have cystic fibrosis and get a lung transplant, will the disease eventually invade my new lungs?", "question_id": "39498"},
{"question_content": "I've pcos, I got a cyst over R. ovary, it ruptured, it came back this month,during my period I got ultrasound it's gone,ovary is enlarged a lot+pain ?", "question_id": "6708310"},
{"question_content": "I am 19 years old and 5'4\" tall. I have seven stones. I have had chest pain, fast heartbeat, shortness of breath evenwhile eating/talking and palpitations. I've had ecg, cbc, chest X-ray but could find nothing. What should I do?", "question_id": "926668"},
{"question_content": "My doctor give me a urine test and they found infection  last yr nov got antibiotic went back jan found out I have urine infection again got antibiotic went today found out i UTI again what can this be?", "question_id": "637401"},
{"question_content": "Today i'm having more productive cough due to the pulmonary fibrosis which was caused by the lung radiation. Can you help me in getting this  under control without a hospital stay?", "question_id": "262407"},
{"question_content": "Fluid on lungs after gb surgery.Has dementia and cannot walk around much or cough up phlegm. What is the treatment and outlook? Still in hospital.", "question_id": "1237448"},
{"question_content": "My doctor said I had UTI symptoms and prescribed antibiotics without performing a urine culture. Should I be concerned?", "question_id": "7544"},
{"question_content": "Can u have hida scan 7% ef with pain nausea. Negative  CT u and ultrasound and not be gallbladder? Surgeon  and go unsure. Rt rib shoulder neck  press", "question_id": "660598"},
{"question_content": "I had a hida scan that came back at 74%. Is that too low for a hyperactive gallbladder?  I'm experiencing pain under right rib, nausea, and vomiting", "question_id": "358348"},
{"question_content": "What are symptoms of ovarian cysts and ectopic pregnancy? I have nausea pain on left pelvic area and pressure and tightness. Have to unbotton jeans", "question_id": "74487"},
{"question_content": "Could pain under the right rib cage radiating to the back be liver trouble?  I had gall bladder removal about 7 years ago.", "question_id": "548080"},
{"question_content": "My wife recently has had 3 miscarriages - 2 of them chemical pregnancies, one at 7 weeks. I am a marijuana smoker (2-3 a week)  - is there a chance the weed is to blame? We have a 2 year old daughter", "question_id": "1008600"},
{"question_content": "I'm 36 weeks pregnant and have an itchy rash on my arms and thighs. I also itch under my belly where my pants sit..", "question_id": "961027"},
{"question_content": "I have this nagging soreness above my left rib cage- right below my left breast. It only bothers my when i cough or blow my nose. ?", "question_id": "644627"},
{"question_content": "I was hospitalized for 2 days due to my abdominal pain. Doctors told me i had a complex 7cm ovarian cysts. Will it go away, or do I need surgery?", "question_id": "1271177"},
{"question_content": "Can a hernia in your stomach cause an uncomfortable chest feeling, similar to the coming of a heart attack?", "question_id": "1244729"},
{"question_content": "When I start to feel overwhelmed i feel like I can't breath and there is a lump in my throat I start to panic what is wrong with me?", "question_id": "1399987"},
{"question_content": "How do I tell the difference between  chest pain from a hernia and pain from a heart attack?", "question_id": "574307"},
{"question_content": "I wanted to know if u think I had a panic attack. The other day when me and my husband were fighting my throat felt like it was closing and my chest was hurting and I couldn't hardly breath.?", "question_id": "190670"},
{"question_content": "I had unprotected sex 2days before period then i had my period regulary, now i have some brownish discharge,im on the pill can i still be pregnant?", "question_id": "1608250"},
{"question_content": "I have a white milky discharge but I have taken Monistat for 7 days....so im ruling out a yeast infection. but what could it be?", "question_id": "1400318"},
