{"question_content": "What is the definition or description of: reactive arthritis?", "question_id": "499198"},
{"question_content": "Can I get diisability for arthritis?", "question_id": "276802"},
{"question_content": "Where do I go if i think I have psoriatic arthritis like my?", "question_id": "1158119"},
{"question_content": "Can mild arthritis of the lower back cause significant sciatica pain? Mri done in july. Pain is getting worse. On gabapentin and meloxicam. Thanks!", "question_id": "1045905"},
{"question_content": "Which medicine for arthritis is most effective?", "question_id": "95392"},
{"question_content": "If i had psoriasis does it mean I have psoriatic arthritis if I have arthritis?", "question_id": "763075"},
{"question_content": "I have a sciatic nerve injury due to being shot  in the leg. I  have done  much treatment, but my foot is numb. Can you recommend a doctor or further treatment?", "question_id": "346824"},
{"question_content": "I have pain in my hips , knees , ankles and feet . What could b causing it? My blood test came back clear. My doctor says it's plantar fasciitis. I", "question_id": "726461"},
{"question_content": "Having's trigger thumb surgery left hand  w carpal tunnel already had carpel tunnel on my right is the trigger thumb surgery the same, please expln?", "question_id": "1045373"},
{"question_content": "Can a 70 yrs old diabetic patient with proneinurea use methotrexate to treat psoriasis?", "question_id": "1110716"},
{"question_content": "Had 4 teeth extracted yesterday was prescribed ibuprofen 600mg n vicodin can I take both at one time?", "question_id": "6740329"},
{"question_content": "Is there a surgery for arthritis in thumb joint? I had carpal tunnel surgery almost 6 months ago this came afterwards", "question_id": "1130338"},
{"question_content": "I know you can have a knee and hip replacement, but can you get a ankle replacement?", "question_id": "118559"},
{"question_content": "After I had lower back surgery, my left foot is numb. Doctor said I have poor circulation and that the pulse in my left foot is slower than my right. He said it could be too much fat being absorbed.", "question_id": "393717"},
{"question_content": "I have had tennis elbow for over a year and had multiple treatments for it including cortisone shots, tens.And ultrasonic. My doctor said surgery. ?.", "question_id": "73829"},
{"question_content": "I am consulting a doctor for heart failure and aortic valvereplacement. I have a feeling of fluid on the ball of my left foot and my big toe feels a little numb. What could be thereason?", "question_id": "336967"},
{"question_content": "Does any type of inflammatory arthritis attack the thumb? Or is it usually osteoarthritis?", "question_id": "1226106"},
{"question_content": "I fell on my elbow; X-ray n not broken, MRI shows ligament damage, cortisone shot n no pain. 4 months later extreme pain - do I need surgery?", "question_id": "174274"},
{"question_content": "Child on methotrexate and plaquenil for jra but since being on plaquenil she has been getting a lot of headaches  is this a side effect?", "question_id": "943328"},
{"question_content": "My leg hurts on the side as long as.My foot it feels tight. Hurts when i walk.Pain only on side umder calf dwn to side of foot the other side of ankel?", "question_id": "857215"},
{"question_content": "I was diagnosed two years ago with sudden hearing loss. Maybe because of s virus. Maybe because I used Vicodin the night before it happened. My question is that after reading that both ibuprofen and acetaminophen can cause hearing loss, what is safe to ta", "question_id": "6788284"},
{"question_content": "Age 16, i hurt my shoulder 2 months ago. Physical therapy and cortisone not helpful. Mri shows rotator cuff tear and bone spur. Should I have surgery?", "question_id": "625300"},
{"question_content": "I have a cyst on my shin near ankle and pain from my knee to my foot on the front side of my leg. Please help me figure this out.", "question_id": "602345"},
{"question_content": "I am not on any medications, tremors in head hands and legs for over a month. Constant dizziness and trouble speaking now, also hair loss. Any ideas?", "question_id": "83742"},
{"question_content": "How long until my knee feels better after total knee replacement surgery?", "question_id": "27941"},
{"question_content": "I have severe pain on the ulnar side of my elbow.  Could this be attributed to psoriatic arthritis?", "question_id": "726377"},
{"question_content": "How can you sleep on side after total knee replacement surgery?", "question_id": "28758"},
{"question_content": "Is it wise to walk for 30 minutes a day/5 days a week, 6 months after a total knee replacement surgery?", "question_id": "34486"},
{"question_content": "For 5+yrs IV had progressive/extreme fatigue joint/neck/back pain headaches rash on knees/elbows, tingling/burning/pain legs feet arms hands. Ideas?", "question_id": "543301"},
{"question_content": "How useful is total joint replacement in case of chronic ankylosing spondilitis? Best remedy/suggestions to deal with chronic ankylosing spondilitis", "question_id": "950606"},
{"question_content": "I was diagnosed with a torn meniscus last year and itsettled without surgery. I went dancing last night and nowthe left side of my left knee is hurting. What could be the reason?", "question_id": "757008"},
{"question_content": "Can you also get tingling/pins and needles in your arms, legs, neck, hands, feet and face due to sinus infection/headache?", "question_id": "367732"},
{"question_content": "What causes painful joints (fingers, elbows, knees) & low back pain?", "question_id": "893545"},
{"question_content": "Mri shows I have torn ACL & meniscus tear. Tear was repaired in oct'13. My knee keeps giving out & i keep falling. I am 68.Is ACL surgery safe for me?", "question_id": "1131366"},
{"question_content": "I started walking 3 weeks after microfracture knee surgery. I was suppose to wait 5 weeks before weight bearing but i didn't. Is that bad?", "question_id": "1027763"},
{"question_content": "Is physical therapy important after knee microfracture surgery? My doctor told me i could just rehab it my self.", "question_id": "1031241"},
{"question_content": "Why is my foot so swollen after knee surgery?", "question_id": "57322"},
{"question_content": "Ra tests all negative emg and nerve test negative also pain in neck shpulder blades elbows wrists knees and ankles could it be possible fibromyalgia?", "question_id": "770477"},
{"question_content": "5 year old son woke up with hives all over his body (arms, abdomen, back, buttocks, legs, feet, hands, ears, neck, face) yesterday (monday) morning. i?", "question_id": "6742934"},
{"question_content": "Problems with knee instability a year after ACL surgery. What should I do?", "question_id": "567577"},
{"question_content": "I had knee  surgery on august 13 2012 and my foot  is swelled up after knee surgery when does the swelling go away. I have been doing the ice machine.?", "question_id": "262996"},
{"question_content": "Do I need pt with my knee after having a patellar graft ACL reconstruction?", "question_id": "95504"},
{"question_content": "Can inhaling an allergen (pollen/dust) cause hives like symptoms on the skin (like on arms, legs, waist, neck)?", "question_id": "611956"},
{"question_content": "How likely am i to be diagnosed with ms? I originally went to the doctor for numbness and tingling in my hand and foot and have gotten severe pain in my opposite arm and hip on two occasions.  One white spot was found on my brain mri, minor degenerative c", "question_id": "392752"},
{"question_content": "I twisted my right knee and ankle on 7/26/12. I had an MRI on 4/29/13, after the birth of my son. The MRI showed an injury to meniscus. Why is the pain worsening after physicaltherapy? What should I do next?", "question_id": "773435"},
{"question_content": "Ankle sprain/avulsion fractured talus - 1 wk later still slight swelling, pain if bearing weight - foot turns purple & throbs when standing.  Normal?", "question_id": "988814"},
{"question_content": "I had hole in meniscus and torn ACL had surgery 4 years ago I felt worse after surgery. Pain is bad still poping locks up I fell and think I re injur?", "question_id": "1386908"},
{"question_content": "Does a torn ACL always have swelling? Can a torn ACL hurt to twist you knee right to left when standing? I have a lot of instability in the knee.", "question_id": "130773"},
{"question_content": "Swelling in legs and ankles I have seen drs here and went to physical thereapy, had a lift put in my shoe, and wear the support socks  and my legs from the knee down swell. They put me on water pills and that did no good. Now when i walk i feel pain from", "question_id": "373062"},
{"question_content": "My knees \"crack\" when i bend down or get up off the floor. It feels like they're about to dislocate. Sometimes i can't walk. Do you know what's wrong?", "question_id": "724113"},
{"question_content": "Knee pain is now swelling up a month ago it felt like what a sprained ankle felt like except it's in the back and lower part of my knee.  This morning it swelled up. What can I do about pain and swelling?\n\nBy the way I have cerebral palsy and possible art", "question_id": "387809"},
{"question_content": "2 back surgeries in ~1 month. Wondering if increased swelling@L5-S1 from overdoing it could cause severe burning/cramping pain behind knee, in calf/ankle, & thigh? Have to lie down & hard to walk/sit.", "question_id": "1388488"},
{"question_content": "Outside of rt knee is sore after bball 3 weeks ago. Not swollen but hurts with certain mvmnts & pivots. Lat meniscus tear? But can still walk. Dislocated knee three yrs ago. How do I test injury/rehab?", "question_id": "598264"},
{"question_content": "Recent CBC: RBC 4.48, Hgb 11.8, Hct 38.1, MCV 85.0, MCH 26.3, MCHC 31.0, RDW 15.8, Plt 503. How \"abnormal\" is my Plt in relative terms? What is likely the cause of high Plt (poss iron deficiency?)?", "question_id": "1353134"},
{"question_content": "Since 2007 my mch, mcv, hct, hgb, and baso tests have come back low. Now my RDW is high, potassium is low and CRP level has doubled.  Why?", "question_id": "959201"},
{"question_content": "Today is the27th. My periods were supposed to start on the24th but i got one brownish spot on the 24th. I still have sore breasts, light cramps in abdomen and leg, i pee a lot, have acne, fatigue and i feel sleepy. What should I do?", "question_id": "547121"},
{"question_content": "Sore throat and swollen glands on right side. No fever no tonsils. Took antibiotics and now have swollen jaw on right side. What's wrong with me?", "question_id": "1287801"},
{"question_content": "I am confused about my recent blood work. What is the hemoglobin, hematocrit, mcv, mch, mchc and rdw?", "question_id": "172789"},
{"question_content": "Sore throat and the gland directly under the jaw bone hurts and the area is swollen. My ear is sore at times. Should I be worried about cancer?", "question_id": "1583618"},
{"question_content": "19 weeks pregnant sore throat, swollen glands, killer headache with body ache congested runny nose, sneezing, coughing.Organic marijuana vs Advil n such?.", "question_id": "1171794"},
{"question_content": "I noticed I have a swollen lymph on the back of my neck just before the hairline should I be worried? I've had a dry cough since last week with body aches and a sore throat. My cough has calmed down a bit my body aches are gone my throat still hurts a lit", "question_id": "400436"},
{"question_content": "I've had a fever, sore throat, cough with green, blood tinged mucus for a few days. Also a mild pain at the bottom of my chest.  Should i go to my dr?", "question_id": "507305"},
{"question_content": "I think I have yeast infection but  I have  small blisters inside  my vagina  and it itches and hurts  and I have it also  around my anus  .What is it?", "question_id": "288522"},
{"question_content": "Can STDs such as Gonhorrea, Syphilis, Chlamydia, or Hepatitis cause moderate to severe intestinal spasms/cramping and loose burning stools?", "question_id": "1377894"},
{"question_content": "Sore throat cough mucous chest pain fever and chills \n?", "question_id": "1497248"},
{"question_content": "I have a sharp pain in my groin area on the right side no other symptoms. Just a burning stabbing pain. History: htn pcos zestoretic provera ?", "question_id": "1123468"},
{"question_content": "I've had a cold for the past 3days. Now just a dry cough & im losing my voice. Do I kneed antibiotics, what should I do? No sore throat, fever, headache.", "question_id": "114561"},
{"question_content": "I went to the doctors 2 weeks ago and got STD check up and yesterday my doc told me I have chlamydia. I dont know how long i had it maybe a month. Should I get tested for PID? I want kids in the futur", "question_id": "6791679"},
{"question_content": "I was told i had gonorrhea and a yeast infection and i was treated for it. Now I have sime bumps, a clearish-white discharge and itching. What is it?", "question_id": "636177"},
{"question_content": "My doctor gave me azithromycin for chlamydia 6/11. I took them and also got a shot at the ER to prevent gonorrhea 6/19 . When does itching go away ?", "question_id": "1380347"},
{"question_content": "I woke up with a sore throat, headache and fever. Strep throat is going around st school. I really do not have money to go to doctor. Is there anythin?", "question_id": "83405"},
{"question_content": "How long does it usually take for one dose of 1,000 mg Azithromycin to clear up a RECTAL Chlamydia infection? I still have minor symptoms 11 days later after taking Azithromycin. Should I re-check?", "question_id": "1483520"},
{"question_content": "I am wondering on why an individual would be on azithromycin 10 day and twice daily treatment? And if this will cure chlamydia?", "question_id": "749193"},
{"question_content": "Triglycerides 453 hi. Glucose 132H.Bun 26H. Hemoglobin 11.7 low. Hematocrit 37.5 L. Mchc 31.2 L. RDW 15.5 H. MICROALB CREAT 240 H. VitD 22 L. Father60 and Diabetic . Rest of Cbc and othere normal. What could this be?", "question_id": "1191084"},
{"question_content": "Hemoglobin test in urine came out positive. Should I be concerned?  I do have Crohn's Disease that causes vaginal fistulas, but it is not active.", "question_id": "1424601"},
{"question_content": "How long should I wait to get tested after having receptive anal sex? In particular I want to get tested for RECTAL chlamydia+gonhorrea+syphilis.", "question_id": "1567888"},
{"question_content": "I got treated for chlamydia with 2 500mg azithromycin tabs and had sex with a condum 3 days later. Is it possible that I am infected again?", "question_id": "1446722"},
{"question_content": "Is bright blood in the stool normal for hemmoroids?", "question_id": "1557056"},
{"question_content": "Took plan b on Thurs. and I have blood test on Mon. for glucose random,vitamin d,25-hydroxy, hemoglobin ,insulin and c-peptide will plan b show up ?", "question_id": "6753581"},
{"question_content": "I have had ulcerative colitis for 13 years. A recent colonoscopy showed a cancer tumor in the right side of colon. Should i go for a full or partial colon removal ?", "question_id": "857245"},
{"question_content": "Tested positive for RECTAL chlamydia, took 1000 mg Azithromycin, no sexual contact at all, but still symptoms. Re-tested 3 weeks later, if it's positive again should I ask for a different antibiotic?", "question_id": "1505141"},
{"question_content": "I was diagnosed with Chlamydia 9 days ago and I took Azithromycin (4 pills) at once. I never had any odors, itching or burning but I had a slight increase in discharge and thats why I went and got checked. Anyways, I took it nine days ago and the discharg", "question_id": "6737802"},
{"question_content": "I had chlamydia &my doc prescribe  antibiotic &metronidazole. & i'm stil seeing discharge in my underwear.What can I use to get rid of it? Please", "question_id": "979748"},
{"question_content": "Treated Chlamydia, had symptoms again, results came back that there were traces of it left, treated again. Now burning w peeing, & itching/irritation?", "question_id": "6716390"},
{"question_content": "Pain in anus woke me..Bowel movement brought relief.Felt no lump in anus but when i pushed in a bit on the right i felt a small bb sized .Lump not inside anus but from anus i can push in and feel  it?", "question_id": "625683"},
{"question_content": "Hemorrhoid after every bowel movement reason to see dr about, no bleeding, not  painful but feel pressure, i can push it back in, use suppositories?", "question_id": "870379"},
{"question_content": "Had an external hemorrhoid burst this morning, bleeding has stopped.  Afraid that tomorrow's bowel movement will cause it to bleed again. What to do to minimize potential bleeding? Have to go daily :)", "question_id": "889016"},
{"question_content": "Vaginal itchiness, redness, and slight irritation?  Is it always yeast?  Not sexually active.", "question_id": "107777"},
{"question_content": "Is mitral valve prolapse really asymptomatic? I have a congenital mitral valve prolapse and a heart murmur. When i started feeling dizzy, fatigued and developed mild chest pain i went to see an  cardiologist, because i read on www.Mayoclinic.Com that thes", "question_id": "389265"},
{"question_content": "I have chronic diarrhea accompanying extreme abdominal pain w my ibs. Antidiarrhea pills have been working good. Anything else I can do for flare ups?", "question_id": "81674"},
{"question_content": "I am 48 i have been having regular periods..this time no show.sore breasts.cramp..tired unprotected sex but negative test. Can i be pregnant?", "question_id": "1529585"},
{"question_content": "Is it safe to get breast implants while on mirena birth control?", "question_id": "331854"},
{"question_content": "Can mitral valve prolapse cause a person to get anxiety attacks?", "question_id": "95917"},
{"question_content": "I think I have gallstones, pain in upper abdomen, bloating, gas, diarrhea, nausea, intolerance of fatty foods.It feels like a gamble on what I can eat now.?", "question_id": "185600"},
{"question_content": "Can mitral valve prolapse be a cause of svt?", "question_id": "35861"},
{"question_content": "Help me? I had sex 3 days ago supposedly when I was due too be on my period. I'm now bleeding brown blood after having unprotected sex. I'm concerned.", "question_id": "1476954"},
{"question_content": "I've had this problem for 5 days with abdominal pain, diarrhea some, gas, and bloating. Do I go to ER or wait to see my family doctor?", "question_id": "6704274"},
{"question_content": "Could a mild case of mitral valve prolapse cause prevent me from having lower face lift? What about white coat hypertension?", "question_id": "723038"},
{"question_content": "My 3 months baby may caught what I have, sore throat. She has a temperature of 98.6, nasal congestion and runny nose, sneezing and coughing.what to do", "question_id": "1432219"},
{"question_content": "4 days late, stomach ache not abdominal cramps, brown discharge only when i pee, had unprotected sex, i dont want to get pregnant?", "question_id": "1405839"},
{"question_content": "Two attacks of tingling hands/jaw and chest pain today. Ekg,stress,echo,24holt normal. No fam hist and 28. Is this my heart still? Or panic? Non smoke", "question_id": "1436411"},
{"question_content": "Chest pain across breasts and shortness of breath. I've had a norm stress test, echo and EKG two months ago. Serious heart issues ruled out?", "question_id": "1273179"},
{"question_content": "I have swollen, sore and heavy breasts along with nausea, i also sweat a lot and having trouble sleeping even tho im tired. Pms or pregnancy?", "question_id": "1015425"},
{"question_content": "My last period was june 21. I had unprotected sex the 30th, the 2 of july and the 4of july . Yesterday and the day before i had a little brownish blood on toilet paper. Could i be pregnant?", "question_id": "856874"},
{"question_content": "Period Always on Time , Unprotected Sex Period 5 Days Late Then Light Bleeding Turned Into Spotting Lasted 4 days. Neg Test At 9/12 DPO . pregnant?", "question_id": "1397867"},
{"question_content": "Can my girlfriend be pregnant after we had unprotected intercourse for less than 8 seconds? Her period came 1 week late and is light. Bright red blood", "question_id": "254119"},
{"question_content": "Svr migraine 2 days ago with vomiting every 5 minutes for 3 hours. Worst migraine of my life. Now my eye sockets hurt bad & 1 eye is puffy with slight headache. Feel like i got punched. What do I do?", "question_id": "1025493"},
{"question_content": "I have graves disease and was treated with rai two years ago. Now I am on Synthroid 50mcgs.  Can this be thyroid related?", "question_id": "554298"},
{"question_content": "D&C in april. Period june 3-9. Unprotected sex the 11th. Period is 3 days late, brown blood while wiping today and some cramps. Could I be pregnant?", "question_id": "1392806"},
{"question_content": "Again extream head pain, nausea , vomiting, dizzy sensitivity light&sound .Again er, test, treatment.Ct-clear pain med+zofran.=diag:migraine. Sent home!", "question_id": "1025228"},
{"question_content": "Can stress/anxiety cause heart attack-like symptoms? Good EKG, heart enzymes, and chest x-Ray. 21, active. Having chest cramping/aching and arm pain.", "question_id": "1441554"},
{"question_content": "Back in january I had an EKG and had low blood pressure they said the next step was a stress test. I am uninsured so I passed the heart fluttering went away but now I have chest pressure along with jaw and teeth pain, fatigue and some nausea. I have an ap", "question_id": "263713"},
{"question_content": "Dx'd with cellulitis in neck but swelling is now extending into back. Headache, nausea, fever, pain in jaw now present. Suggestions on what to do next?", "question_id": "1251724"},
{"question_content": "11 weeks ago mild head trauma. Ct & MRI showed bruising of brain. Fatigue, insomnia and hearing loss issues.Anyway to combat fatigue and headaches?", "question_id": "1229746"},
{"question_content": "My last period was n august 22nd and for the past couple of days I have been having brown spotting. My period is due on sept. 19th, I took a hpt on the 11th but it was neg and so was a blood test. What could be going on or could I really be pregnant?", "question_id": "282057"},
{"question_content": "3 days of pain. Back wisdom tooth, swelling of the gums, cheek, jaw hurts, neck hurts, headache. Hurts to open mouth and swallow. What should i do?", "question_id": "6790562"},
{"question_content": "I'm 40 years old. I have been having severe anxiety for a month with panic attacks. I have just got my period twice in amonth. I get rapid heart rate/pounding but the stress test and EKG were normal. Could this be a hormonal problem?", "question_id": "896121"},
{"question_content": "Can you give me advice about ENT, vertigo and nystagmus? I've been to 3 doctors, had a perfect MRI and perfect blood work. ENT is sending to Neuro and vestib rhb. What could be wrong?", "question_id": "857788"},
{"question_content": "I currently have a wisdom tooth that is growing and it is swelling the gum area. I am unable to open my mouth all the way. Is this normal?", "question_id": "6763913"},
{"question_content": "The doctors did CAT Scan, MRI, blood test, heart test. But they cannot find the cause of my head pain(pain movin), sometimes I feel like a mucus in it?", "question_id": "1451691"},
{"question_content": "Symptoms of MS, brain MRI showed \"no significant abnormalities in the white matter\" symptoms came back 6 weeks later. Next step is neurologist,?", "question_id": "1487835"},
{"question_content": "What diseases cause hand paresthesia and swelling (in the MS mimic) catagory? I've been having a lot of symptoms that are classic MS symptoms but have not been diagnosed. My brain MRI without contrast was normal. One neurologist sd it was anxiety and to s", "question_id": "382067"},
{"question_content": "Tooth decayed over years until almost gone. Gums grew over last pieces. No pain until now. No $. How risky? Antibiotics fix for while until i get $?", "question_id": "1100414"},
{"question_content": "Hi, what are the chances I have MS?  I had a clean MRI of brain, with contrast.  I have been having some tingly hands, floaters in eyes and dizziness.", "question_id": "1438654"},
{"question_content": "I'm 40 and seem to have hormonal symtpoms. I have heavy clotting during menses and I have anemia. Blood clots are constant and the size of my fist. I have been having racing heart and dizzness for months and nausea. My heart workup is good. What could be", "question_id": "944027"},
{"question_content": "Possible wisdom tooth infection. Gum puffy around tooth.. Ear hurts but no tooth pain. Can i wait 3 days (monday) for dentist or need antibiotics now?", "question_id": "1047560"},
{"question_content": "What are the symptoms of Primary Progressive MS?  I think I might have it.  Tight weak knee, tingly hands that go to sleep at night, stiff neck.", "question_id": "1471588"},
{"question_content": "What are antibiotics and what are the examples of antibiotics  that could cure an infection in gums-wisdom tooth ?For my best friend .", "question_id": "769898"},
{"question_content": "I'm taking 2.5 warfarin daily for a clotting disorder. The past week have taken 2 Aleve daily for leg pain from a dvt, will this affect my inr?", "question_id": "830759"},
{"question_content": "Sudden onset tingling and pins and needles after drinking alcohol.  Liver and kidney labwork is normal.  NCV and EMG normal.  Brain MRI norml.  Cause?", "question_id": "1455181"},
{"question_content": "Have had a sore throat for a couple weeks now, my wisdom tooth is cracked and growing in my gum. Could a tooth infection cause this? Also swollengland", "question_id": "1549280"},
{"question_content": "Tooth infection.On rodogyl. 10days.Root canal done.Still pain. Lnode by jaw swollen.Bone by ear near temple hurts.Do i need see a doctor not dentist?", "question_id": "1034569"},
{"question_content": "Are swollen glands common with canker sores? Could I have an infection? I have had a huge canker sore on my cheek now I have a small ones on my tounge, lip, and back near my wisdom tooth and my glands are swollen and feels better after i brush.", "question_id": "399835"},
{"question_content": "I got a simple molar extraction on tooth number 17 due to a painful abscess on 11/12. Now, I find a lump under the cheek/jaw area. Could it be the same infection or should I see a dentist or a doctor?", "question_id": "769543"},
{"question_content": "I'm being tested for ms, I have all the symptoms, heavy limbs, shaky hands, electric shock down neck & hands etc, but MRI is clear, could it still be ms?", "question_id": "645500"},
{"question_content": "With Cefzil & rocephin I get hives.Should I take penicillin shot for syphilis treatment.This is a 3rd infection. Used doxycycline for first 2.", "question_id": "6625864"},
{"question_content": "I have lhermitte's but normal neuro and brain/neck mri. Neuro says its not ms, but symptom intensifies with exercise. Is this ms?", "question_id": "918245"},
{"question_content": "Pain in my jaw and still swollen cheek and jaw, it's been over a week since my wisdom tooth was pulled from being infected. Is it still infected?", "question_id": "691291"},
{"question_content": "Bad tooth pain, noticed it turned black as of yesterday. Abscess? Going to doc today as dentist is closed. What's likelihood infection spread already?", "question_id": "1086578"},
{"question_content": "My upper left second premolar has become a bit loose due to a few years of recurring infections. I've been told it needs a root canal. If the root canal is done and the infection is gone, will it tighten back up? Can bone loss around the root of the tooth", "question_id": "1583968"},
{"question_content": "Age21, male. Get chest pain that goes when sitting down after lifting weights / running. Had ecg, 24h holter, exercise stress test, echo. All normal?", "question_id": "636644"},
{"question_content": "Am diagnosed with MS having 2 lesions on spine causing electric shock symptoms up spine into head, could i safely take hypericum to dampen pain.?", "question_id": "519189"},
{"question_content": "I have a deep pain from 1 or 2 teeth and/or gums on bottom. My dentist says it's irritated gum. He said there were no indication of abcess or infection and that teeth appear normal. What is problem?", "question_id": "1498766"},
{"question_content": "Dental abscess and eating, please answer quickly? I have a dental abscess that's currently draining on it's own. I know i need to go to the dentist, but can I eat like this? I don't want to get a worse infection, but my teeth don't hurt, the gum is just s", "question_id": "400928"},
{"question_content": "I've had tooth pain on the tooth I had a root canal on 5 years ago when chewing. Sometimes unbearable. Could it have something to do with infection?", "question_id": "1568202"},
{"question_content": "Possible MS from head injury that caused severe concussion?", "question_id": "1163451"},
{"question_content": "I visit dentist tdy as my teeth/gum are hurting all day for a month & she said mayb its gum infection & gave me a mouthwash.  Shld it be that all??", "question_id": "6636022"},
{"question_content": "I've had a recurring sinus infection, coupled with severe tooth pain. Do i possibly need a root canal?", "question_id": "638684"},
{"question_content": "Have severe tooth and gum pain need relief dentist app still 4 weeks away have tried hot tea bag tylenol Advil oragel  products mouth wash and alchol ?", "question_id": "502693"},
{"question_content": "Brain MRI findings. Tiny nonspecific periventricular and subcortical white matter. Possiblities mini strokes, vasculaties, ms. I shuffle my feet & drop?", "question_id": "569540"},
{"question_content": "Home remedies that can help with tooth infection along with antibiotics provided by dentist? Other than salt water mouth wash. Thanks", "question_id": "6689705"},
{"question_content": "I have optic nueritis and my eye dr cant figure out what it is so Im getting an MRI. What are the chances for MS? Will I end up with it", "question_id": "1523424"},
{"question_content": "3 large tori in toof of mouth sometimes cause choking on food, difficulty swallowing or breathing, or trap food.  What specialists remove tori? Risks?", "question_id": "1412280"},
{"question_content": "Can you give me some suggestions on infected root canal after the treatment. Alternate to tooth removal?", "question_id": "1135570"},
{"question_content": "Can women with MS have babies while on treatment or do they have to stop ?", "question_id": "76567"},
{"question_content": "Been suffering with constant headaches, pressure in head and eyes, eye pain, neck pain, teeth aching, dizziness, what could it be?", "question_id": "6629492"},
{"question_content": "I have problems with my wisdom teeth,the dentist cut off the gum above one tooth but I still have tooth pain pressure in my mouth,jaw pain and click.", "question_id": "1494467"},
{"question_content": "What are the most definitive and least expensive tests for ms? I am looking for a new doctor to follow through and use the second MRI i had. What are the specific questions thati should ask the new doctor?", "question_id": "791308"},
{"question_content": "What can I do about this problem with tooth after root canal treatment?", "question_id": "1081419"},
{"question_content": "My test result: Bilirubin total: 3.2 Mg/dl  Bilirubin direct:0.5Mg/dl  SGOT: 18 IU/L SGPT: 18 IU/L ALK PHP: 168 IU/L  any need to visit a doctor?", "question_id": "1430659"},
{"question_content": "Been getting headache for month. Not TMJ as have false teeth, i feel pressure and dizzy and tender head. What could this be?", "question_id": "620787"},
{"question_content": "Been getting headache for monthes not TMJ as have false teeth, i feel pressure and dizzy and head tender?I wake up with one, have least 7 a day", "question_id": "484615"},
{"question_content": "Fever and pain on the left side of the face after upper wisdom tooth removal 2 weeks ago. Pressure under eye, pain in ear, eye, throat. What's wrong?", "question_id": "1333510"},
{"question_content": "I went for liver test and the result shows that my alt(sgpt) is 84.3 and asp (sgot) is 87.5. Pls what does it mean?", "question_id": "570725"},
{"question_content": "Frequent post nasal drip, each episodes last 6 weeks. Causes breathing problems, choking, constant throat clearing. Is it exacerbated by my goiter?", "question_id": "616277"},
{"question_content": "I have had all the symptoms of ms. I have brain lesions and i already have autoimmune disorder and psoriasis. The neurologist says that the lesions don't look like ms. What should I do?", "question_id": "887324"},
{"question_content": "Wisdom tooth on lower left side of jaw growing in. Swollen in that area & annoying discomfort in gums of that area. Gum feels like its lifted in area?", "question_id": "1126047"},
{"question_content": "Hi just of hospital after suffering minor head injury getting headaches minor dizziness +pressure in head should I go back or is tha normal.", "question_id": "598266"},
{"question_content": "If MRI w/contrast of the brain showed lesions & have all symptoms of MS including diplopia, could I have another autoimmune disease other than ms?", "question_id": "852444"},
{"question_content": "My gum gets swollen with fluid from time to time where my wisdom tooth is in the bottom left side what is the problem?", "question_id": "261519"},
{"question_content": "My latest liver enzyme tests showed I have ALT 11 and AST 20. I have read that a 2:1 ratio of AST to ALT is indicative of liver disease and my numbers are pretty close to that. Can you tell me your thoughts on this? I am a 29 year old female who does drin", "question_id": "1556120"},
{"question_content": "Had a negative brain MRI w/o contrast on 1.5 tesla.Still having MS type symptoms.would another MRI be helpful ?should it be w contrast or is w/o fine?", "question_id": "1485633"},
{"question_content": "If diplopia lasts 10-14 days  with 3-4 yrs  between attacks is stroke/ms  more likely than mg.Slight dv daily ? Muscle now weak from earlier problems.", "question_id": "313072"},
{"question_content": "My gum is swollen around my wisdom teeth, difficulty swallowing, swollen lymph nodes and a slight headache. Am i okay?", "question_id": "1281867"},
{"question_content": "Uncompensated labyrinthitis, I have pressure and slight dizziness in my head. Kind of weird vision like my eyes are strained,  normal symptoms?", "question_id": "6746502"},
{"question_content": "If a CT scan radiation gonna cause a brain tumor how many years it will take for the tumor to appear from the radiation \r\n3 years is enough?", "question_id": "811343"},
{"question_content": "Can iron and vitamin d deficiency cause head confusion and dizziness?", "question_id": "508515"},
{"question_content": "I have a dizzy head, achy body and sore throat? What is wrong with me?", "question_id": "1122285"},
{"question_content": "I have cluster headaches 2-3 times per week, depression and fibromyalgia. Providers ruled out MS last year but i still keep getting more symptoms.", "question_id": "1226551"},
{"question_content": "I'm suffering frm swollen gums around my wisdom tooth, earache, headache. Please help?", "question_id": "1080979"},
{"question_content": "Lower lymph node behind ear is swollen. Have had earaches & drainage, but wisdom teeth are coming in, too. Is it an ear infection or the wisdom teeth?", "question_id": "6734524"},
{"question_content": "I've got pression on top of the head,forehead and jaw tightness,dizziness and feeling unbalanced,light spots in my eyes sometimes.\nct and MRI normal.", "question_id": "1443613"},
{"question_content": "Just realized my wisdom teeth are coming through and have had an earache ever since. What can I do to treat it?", "question_id": "368928"},
{"question_content": "What do you advise if i want to start taking vitamin B12 supplements and will that solve the issue?", "question_id": "1303702"},
{"question_content": "Hav shortness of breath, small amt. Blood in mucus phlegm no cough at all. Did xray blood test. Doc says no TB cancer. Mayb smoking. I jus quit. Help!?", "question_id": "111782"},
{"question_content": "I had all 4 wisdom teeth taken out 8 days ago, 2 impacted, 1 half and the other fully exposed- for the last 3 days i've had terrible earaches. Normal?", "question_id": "564949"},
{"question_content": "Is numbness in both hands and feet at the same time a common symptom of the onset of MS , or am I worrying over nothing?", "question_id": "249311"},
{"question_content": "Would an MRI of the brain rule out alzheimer's or brain damage? Or ms? I'm 19, male, been battling horrible symptoms for years, about to end it all", "question_id": "1048004"},
{"question_content": "What are symptoms of sinus infection? I am dizzy and having blurred vision. No runny nose, no headache, a slight pressure on the bridge of my nose. I feel like I am coming off of a merry go round..", "question_id": "382046"},
{"question_content": "I am 37 yo. I've had feet numbness for 15 years now...And palm numbness for some 10 years. The doctors say its not ms. What is wrong with me?", "question_id": "583227"},
{"question_content": "I have optic neuritis numbness, balance problems , memory loss and chronic pain do you think I have ms?", "question_id": "321793"},
{"question_content": "How to know if I have dysthymia (depression) ? Symptoms include tiredness, lack of motivation & crying for no reason..?", "question_id": "618466"},
{"question_content": "I have vitamin d deficiency- taking 10,000 units a week. I used to have neuropathy on my left side and now my feet and fingers are tingling a lot more than usual. Related?", "question_id": "6765765"},
{"question_content": "I was hit on the left side off my face my jaw and ear hurts and when i open my mouth my jaw hurts the side off my head hurts by the temple its tender ?", "question_id": "6703115"},
{"question_content": "What can cause angular cheilitis besides anemia or vitamin deficiency?", "question_id": "100377"},
{"question_content": "I weigh 264 and 25yrs  old i feel tingling in my head hand and feet i check my blood pressure its160/110  could it be that.Or my sinus .Wat should I do.", "question_id": "696274"},
{"question_content": "I've just been sick with the flu/high temp/ sore throat. Now my mouth has swollown gums and painful white spots. What are those?", "question_id": "608300"},
{"question_content": "I am 34 year old woman, my hands and feet tingling always when i sit down for just few minutes.? In blood report its nothing.", "question_id": "315540"},
{"question_content": "18 mo old, 101+ temp, rr 39, no dyspnea, lethargic, vomited 4x this am, loose stool x1, taking amoxicillin for recently diagnosed ear/sinus infection. Is this viral or should I see md?", "question_id": "655397"},
{"question_content": "Headache, chills, sore throat, fever, tired, body ache,  blak out occasionally, lost appetite, been 2 days, stomache pain , vomiting?", "question_id": "1258331"},
{"question_content": "I have had a fever for 2 days chills body aches and now I have a very sore and swollen throat even my neck hurtws what could this be and should I see my dr or wait it out I have been drinking hot tea and taking ibu 800 any other suggestions ?", "question_id": "336122"},
{"question_content": "I have got a sinus infection for over a month. I've taken1000 mg of amoxicillin for 28 days and it has still not gone. What should I do?", "question_id": "53416"},
{"question_content": "For the past two days, I have had burning stomach pain and loose to watery stools.I get a low grade temperature at night. There is no intestinal cramping. Could it be an ulcer, IBS or virus?", "question_id": "820353"},
{"question_content": "25 yr old male, 9 year smoking history, quit 2 mnths ago.  Gums bleed spontaneously, if it were lung cancer causing this, wouldn't I have more symptom?", "question_id": "1550378"},
{"question_content": "My daughter is currently taking Amoxicillin for a sinus infection  now she says that she has a pain on the right side of her throat when she swallows?", "question_id": "1530262"},
{"question_content": "5 yr old complains of sore tongue way in the back; has red spots in back of throat. What could be the cause?", "question_id": "480070"},
{"question_content": "Had tennis elbow and cubital tunnel surgery this morning about 9a with nerve block, my arm is just as numb as when i left center,  should i be concern?", "question_id": "1405327"},
{"question_content": "Red dots on roof of mouth and sore throat and rash on arm?", "question_id": "616253"},
{"question_content": "Clear mucus in left nostril, left side nose pressure and jaw pain, sometimes blood in mucus when blow nose to clear it, is this sinus infection . ?", "question_id": "1122516"},
{"question_content": "Dehydration, lower abdominal cramping, irregular bowel movements, sore breasts, too early for period, could i be pregnant?", "question_id": "858570"},
{"question_content": "I have what looks like a pimple right next to my nostril piercing. Could my nose ring be irritating the surrounding skin?", "question_id": "616673"},
{"question_content": "Had impacted wisdom tooth@cyst (upper) 5dys ago gen anesthetic spitin blood think it comin from nostril blowin nose showin blood to can u advice please x?", "question_id": "790072"},
{"question_content": "I am having impacted wisdom tooth and cyst out 2moro general anthestic wil it be ok to have a smoke a couple of hours before, if not why? Thanks", "question_id": "768836"},
{"question_content": "Feeling poorly through cyst@impacted wisdom tooth swollen cheek @pain in palate have to wait 4 sugery, or can I speed things up, what can I do?", "question_id": "758986"},
{"question_content": "Do I have cold or sinus infection? Runny/stuffy nose, itchy scratchy throat, top right teeth seem sore, and my front right tooth has become super sensitive to temperature over night, now I seem to be feeling very cold, a dry cough and very chapped lips", "question_id": "277901"},
{"question_content": "I have the following symptoms for past 5 days now (sneezing, headache, stuffy nose, itchy eyes, sore throat. I'm thinking it's allergies, i've been using reactive but doesn't seem to do the job.. Any suggestions?", "question_id": "203975"},
{"question_content": "I have painful palate at the front, have impacted wisdom teeth, and swollen cheek. What should I do?", "question_id": "622370"},
{"question_content": "Got removed my wisdom tooth removed 7 days because of infection, took augmentin for over 7 days. Still have teeth infection, have ear pain too now. What to do? Thanks", "question_id": "6689322"},
{"question_content": "I take fenofibrate lipid regulating agent,thus it trigger allergy.eg.sneezing watery nose,redness of both eyes,itchiness of tongue with preckles ontop?", "question_id": "1380387"},
{"question_content": "What does it mean when u spit blood sometimes not when I brush my teeth?", "question_id": "147687"},
{"question_content": "I am getting my bottom wisdom teeth. My right cheek is swollen and painful. I called every oral surgeon whose number i could find. Finally found one who could take me in 2 weeks time. I recently went to my doctor for a UTI and now I am on antibiotics. Wil", "question_id": "488467"},
{"question_content": "Can an infection from a wisdom tooth cause neck swelling and swelling behind the ear plus swelling under the wisdom tooth/jaw? I have no pain with it.", "question_id": "767450"},
{"question_content": "My nose is stuffed up and when I clear it the mucus goes into my mouth and I swallow it. Is this bad for you?", "question_id": "53532"},
{"question_content": "Two wisdom tooth removed at a time.Lymphnodes below ear remain swollen for three months after antibiotic treatment.Is it required to remove lymphnode?", "question_id": "1127717"},
{"question_content": "My 5 month old has a runny nose and sneezing today.  No fever, eating and drinking, just cranky. Is this the flu, should should I worry.", "question_id": "6626173"},
{"question_content": "My son has reactive airway disease  he is wheezing coughing and has a runny nose and a fever of 101 under arm pit hes been.Around a child with strep , ?", "question_id": "501322"},
{"question_content": "Had lower rt wisdom tooth extracted 3 months ago using local. Tooth impacted took 1 1/2 hours to remove. Swollen still, clicking jaw, stuffy ears tmj?", "question_id": "829353"},
{"question_content": "My 6-month-old girl caught flu/cold since Friday. She has running nose and cough. She has mucus in her nose and it's understandable. The part worries me is that I can hear mucus when she breathes. Shall I be concerned about it?", "question_id": "6761564"},
{"question_content": "Is is safe to take both zyrtec and singulaiir?  Recently I switched because my allergies have flared up this summer, but I still have lots of symptoms like sneezing and itchy eyes.", "question_id": "188972"},
{"question_content": "Right ear ache, right side of jaw hurts as well as the right side of my throat. Day 4 of taking amoxil still no relief. Pain caused by infection?", "question_id": "690961"},
{"question_content": "Son14, cough/hacking/runny nose,sore throat, fever vary to 100.6, dr didn't med,rapid strep norm.Is he contagious? How do I know if needs re-eval?", "question_id": "6665158"},
{"question_content": "I had a wisdom teeth extraction on monday it was impacted and i removed one.  Now I have strep throat. How do I soothe the pain asap ?", "question_id": "829411"},
{"question_content": "How long is bleeding normal after wisdom tooth extraction?", "question_id": "1399250"},
{"question_content": "My kids have STREPP and my throat is sore with swollen glands. Can I get a prescription? They are on Amoxicillin.", "question_id": "1546404"},
{"question_content": "I've been prone to sneezing burning eyes ,no redness and runny nose since 3 months non stop. Never had a history of allergies.What could be the cause?", "question_id": "1430560"},
{"question_content": "Swollen lips, wheeze, cough, tightness in throat, tightness in chest are all present during my kids month on tobi. I wear n95 1 hr & hepabut still sx.", "question_id": "678964"},
{"question_content": "How common is jaw soreness and stiffness after wisdom tooth extraction? I'm having my wisdom tooth extracted in a few weeks. A friend could hardly open her mouth for over a week after she had hers out. How likely is it this will happen to me?\n\n\n.", "question_id": "393505"},
{"question_content": "Had 2 wisdom teeth pulled by dentist 3 days ago. Jaw hurts a lot. Cud this b due a dry socket, or just pain from extraction? I have a pic if needed", "question_id": "617286"},
{"question_content": "No cough or sputum but I have a wheeze and tight chest. Pred. Value spirometry is 83%. Is this COPD or late onset asthma?", "question_id": "675293"},
{"question_content": "It has been a week since my wisdom teeth extraction and the left side of my mouth still hurts. What should I do? Im afraid of a dry socket.", "question_id": "637345"},
{"question_content": "Had bottom wisdom teeth extracted over three weeks ago. All teeth still sensitive. Bottom teeth/jaw area feels tight. Normal?", "question_id": "6732636"},
{"question_content": "Going to the dentist for wisdom teeth extraction and cavities removal. Help what to expect?", "question_id": "1073126"},
{"question_content": "How long after wisdom tooth extraction does dry socket develop?", "question_id": "96153"},
{"question_content": "Have had headache, facial pain for 6 months, left side. Mri revealed large mucus retention cyst right side. Any link?", "question_id": "731371"},
{"question_content": "I have pain in the middle of my right under arm for two days and now its in my chest above my right boob when i take a deep breath it hurts?", "question_id": "489168"},
{"question_content": "I am still having extreme pain 3 weeks after tooth extraction with no dry socket and the socket is not closing. I don't have an infection either.", "question_id": "1223975"},
{"question_content": "Can my wisdom teeth be filled instead of pulled, with surface cavities on two one on each side in the top of my mouth . I'm 55 an anxious about having them remove.", "question_id": "6782864"},
{"question_content": "What gets done first, cavities filled or wisdom teeth pulled?", "question_id": "911558"},
{"question_content": "Still in pain after molar extraction and bone graft. Os says I have no signs of infection or dry socket. Is this pain normal? What to do?", "question_id": "758103"},
{"question_content": "Jaw pain on left side, wisdom tooth has been grown in for years. Loose flap of skin/gum near the tooth, pain up and down jaw bone?", "question_id": "1293223"},
{"question_content": "I had #19 and #3 tooth extraction/bone graft 6 days ago.  What is my risk for dry socket?  How long until I can be sure that I won't get dry socket?", "question_id": "1426654"},
{"question_content": "My wisdom tooth just grew in a few weeks ago and it has a huge hole next to the gum that is painful. Could it have grown in with a cavity?", "question_id": "340964"},
{"question_content": "I have a pain in my lower, back jaw.. Cavity or wisdom teeth? For a few days it never goes away. I heard that cavities only hurt when you eat, is that true?", "question_id": "911698"},
{"question_content": "What can I do to treat a recurrent/persistent infection after wisdom tooth extraction?", "question_id": "350920"},
{"question_content": "How long does the pain normally last after tooth extraction/bone graft?", "question_id": "350337"},
{"question_content": "Should I do the salt water rinse after a wisdom tooth extraction?", "question_id": "231540"},
{"question_content": "I had a tooth extraction and a dental bone graft, three weeks ago. After one course of amoxicillin and more than 36 hoursof taking augmentin, there is swelling, pain, stench andoozing at the site. The doctor lanced and squeezed it 24hours ago, but it has", "question_id": "792534"},
{"question_content": "Which is better to get a tooth extracted and dental implant placed with bone graft same time or extraction/graft wait 3 mos then implant? Success rate", "question_id": "537938"},
{"question_content": "Really bad headaches (migraine?), dizziness, nausea, trouble concentrating, weakness in arms, changes in vision, etc... Could it be a brain tumor?", "question_id": "333133"},
{"question_content": "How long does it take for the periodontist to complete a molar tooth extraction with a bone graft and stitches?", "question_id": "258534"},
{"question_content": "Are bone grafts always needed after a tooth extraction?", "question_id": "158166"},
{"question_content": "There's a black hole where my wisdom tooth is coming in and it's causing a great deal of pain and swelling on my left side of my jaw, what should I do?", "question_id": "870826"},
{"question_content": "What's the difference between wisdom teeth extraction vs bone grafting pain?", "question_id": "317266"},
{"question_content": "I am unable to open my mouth after bone grafting after tooth extraction because of pain.. What to do \r\n? Is it normal ?", "question_id": "504030"},
{"question_content": "Is losing blood from your mouth from wisdom teeth extraction the same as losing blood from anywhere else in the body?", "question_id": "368585"},
{"question_content": "What is the proper dosage of nucynta following a lower molar extraction with bone graft and stitches?", "question_id": "277856"},
{"question_content": "Had me left wisdom teeth removed 4 days ago. Swelling only went down today. Massive lump nowhere near extraction site & taste of rotten blood in mouth?", "question_id": "530520"},
{"question_content": "Can feel and hear my pulse in my head for the first 10-15 seconds when I stand up. I do not have high blood pressure. What may be causing this?", "question_id": "1395437"},
{"question_content": "When can I begin to eat solids following my lower right back molar extraction with bone graft and stitches?", "question_id": "258344"},
{"question_content": "Does maxillary sinusitis cause vertigo?       Is vertigo ever caused by sinusitis of the maxillary sinuses?", "question_id": "21496"},
{"question_content": "Is it normal to have persistent throbbing pain in the bone above the #6 tooth 14 days after extraction? Dentist said healing well.", "question_id": "692240"},
{"question_content": "Could this swelling around one molar be caused by an abscessed tooth? I have a molar on the left side of the mouth where the gum is incredibly swollen and tender around it. It hurts to eat, brush or do anything around that tooth, and i'm wondering if this", "question_id": "398115"},
{"question_content": "Yes my will not open after a week of wisdom tooth removal and I still have swelling in sore throat what should I do?", "question_id": "6783008"},
{"question_content": "How to get my sinus to drain? My nose feel fine but doctor said throat is red and ear infections. Sinus won't drain. Nose feel fine. Cheek pain.", "question_id": "1436714"},
{"question_content": "My blood pressure is 168/110 and im on labetalol twice a day at 100mg.Is this med not helping?", "question_id": "245318"},
{"question_content": "Hi i had a sinus infection for two weeks and bad headaches/congestion. that is gone but in the morning when i wake up my throat hurts and there is still mucus being coughed up. what is the cause of this? what should i do? thanks", "question_id": "6728133"},
{"question_content": "My daughter has swelling and redness over, what i think, isher wisdom tooth trying to come in. Her jaw is sore. It's a saturday night. What do I do?", "question_id": "356763"},
{"question_content": "Ear ache, head ache, loss of hearing, dizziness, diareah, blurry vision, fatigue? Just got off z-pack for bronchitis?", "question_id": "504821"},
{"question_content": "I have this tooth problem and am not sure if it is TMJ or wisdom tooth .My jaw cracks on the right side when i open or yawn but hurts on the left ?", "question_id": "1275751"},
{"question_content": "How can you eliminate chronic fluid build up behind eardrum. What causes this in 6 year olds not a swimmer, no sinus respiratory issues, ongoing since january fluid won't go away, we have had 9 trips to pediatrician with either ear infection or just fluid", "question_id": "372955"},
{"question_content": "Unexplained  bruising all over body, fatigue,  wieghtloss, headaches, loss of appitite, body aches, mild dizziness, weak legs.What going on with me?", "question_id": "1475068"},
{"question_content": "It has been roughly a month since my wisdom teeth wereremoved. I am now having swelling, tenderness, and heat in my jaw area. Is it possible that my bone is infected?", "question_id": "66074"},
{"question_content": "Can you please tell me if fatigue and foggy brain are serious side effects of penicillin. I am taking Ospen for sore throat. Thank you?", "question_id": "1456704"},
{"question_content": "Dizziness 24/7 for 6 months tense jaw ocassional headache tinnitus blood&urine test were fine dentist said wisdom teeth are fine I have TMJ am 20 yr?", "question_id": "1236497"},
{"question_content": "Symptoms: unilateral enlarged tonsil (left side), swollen lymph node, throat and ear pain all on left side, extreme fatigue, weight loss for 2 months.", "question_id": "1381513"},
{"question_content": "Low back pain, no other sx.No uti, kidney stones, etc.Dr. Wants to send me for mri, but hasn't checked blood, etc.Is this standard for healthy 32 yo?", "question_id": "1052452"},
{"question_content": "bloodwork WBC high urine test Epithelial cell MANY Luek Esterase SMALL Blood Moderate had kidney stone and UTI this why wbc is high concern 20 yr old?", "question_id": "6680376"},
{"question_content": "What could this be? No congestion, coughing or runny nose but pressure around my eyes, nasal area, upper teeth hurt and headache", "question_id": "1423815"},
{"question_content": "Is a saline nasal spray safe to use with asthma and allergies? Thanks.", "question_id": "360746"},
{"question_content": "I can't shake an infection I have had for more than five years in upper jaw/ sinus area  despite prolonged antibiotic use - what would you recommend?", "question_id": "275833"},
{"question_content": "Fever, asthma history, & slight shortness of breath. Just more asthma, or maybe pneumonia?", "question_id": "103119"},
{"question_content": "Wbc's in urine no bladder infection or uti, cystoscopy/ cultures showed nothing, CT scan with contrast only saw small pelvic fluid im in no pain help", "question_id": "287181"},
{"question_content": "Asthma attack during a run in the middle of the woods. Sx: shortness of breath, wheezing (in/out), coughing. Stop or run out of woods? No inhaler.", "question_id": "978624"},
{"question_content": "Dry eyes & sore throat in morning, eat a lot but losing weight, sore joints & weak muscles, acne, but normal TSH (2.25) and glucose (76). What is it?", "question_id": "356241"},
{"question_content": "Severe reaction to 2hand cigarette smoke/cling. Instantly lose voice, chest congestion, wet cough, wheezing, trouble breathing. Some popcorn bags too. Pure tobacco ok. No other asthmas. What additive?", "question_id": "634374"},
{"question_content": "Hey I'm 18 years old and sexually active...I use no form of birth control at all...normally I just take emergency contraception...I started bleeding two weeks after my period?", "question_id": "6740670"},
{"question_content": "Having trouble getting a deep breath. Yawning a lot. Dizzy here n there. What else could this be, besides anxiety or asthma. Chest xrays came back ok.", "question_id": "629697"},
{"question_content": "Hard knot behind left ear. Pain when turning neck, blurred vision right eye only, some headaches, feels like pressure in left ear?", "question_id": "945162"},
{"question_content": "Normal chest X-ray and VQ SCAN. Normal ekg. Chest and back pain, gurggling sound, short of breath, dizzy. Also tachycardic and dry cough. Please help.", "question_id": "6724924"},
{"question_content": "Period not due for two weeks. Have severe cramping and brown discharge. Feeling nauseas.  Could it be ovulation? Not pregnant. Tubes tied.", "question_id": "944185"},
{"question_content": "Is it still considered asthma even though the child doesn't have any problems wheezing or breathing unless sick?", "question_id": "38775"},
{"question_content": "Can smoking medical marijuana lead to asthma? I've been using medical marijuana for about a year. Now I am having periodic wheezing and chest tightness. Could my smoking be causing asthma? It doesn't always happen while I am smoking.\n\n.", "question_id": "407304"},
{"question_content": "My period  is supposed to start today. Instead I am spotting and have mild pain in my ovary. I am sexually active with birth control. Am I ok?", "question_id": "1568869"},
{"question_content": "Pain and pressure in left eye that comes and goes. Vision gets mildly blurry. Along with headaches. Could this be caused by my sinus congestion?", "question_id": "965876"},
{"question_content": "Can anxiety cause constant chest burning and shortness of breath? Many tests . . . If heart is ruled out should I go the mental health route?", "question_id": "766992"},
{"question_content": "Having chest pain lower pain under rib cage have asthma COPD taking that you like her 4 times a day still not feeling well what should I do?", "question_id": "1164144"},
{"question_content": "I have copd, will I always feel congested and cough?", "question_id": "28983"},
{"question_content": "Is sleep apnea related to COPD and/or asthma? What are some effective treatments for someone with sleep apnea and COPD - cpap, bipap, pillows?", "question_id": "71415"},
{"question_content": "How effective can a dental appliance be in treatment of sleep apnea over cpap?", "question_id": "1060974"},
{"question_content": "Sleep apnea - was just told to use the dental appliance. When can I expect it to get better?", "question_id": "1120726"},
{"question_content": "Stroke symptoms? Terrible headache 2 days mostly temples and top of head, stiff neck, pressure behind eyes, lightheaded. Getting nervous.", "question_id": "1367432"},
{"question_content": "Facial pain around sinuses & eyes, TMJ pain, minor headache, left side neck pain, foggy head, metallic taste in mouth.", "question_id": "1224025"},
{"question_content": "26 day late never that late I have cramps mostly all days since I missed my period and lower back pain sore breast and very moody and some headache ?", "question_id": "1432960"},
{"question_content": "What can I expect after getting oral appliance therapy for apnea? I'm schedule to go in and talk to my dentist about an oral appliance for sleep apnea, but i'd like a little heads up about what to expect afterwards before i go. Will an oral appliance chan", "question_id": "398374"},
{"question_content": "Can studying too much and sleeplessness lead for headache (like pressure on head) and nervousness and insomia and dizziness ? Or counsult a physician", "question_id": "731474"},
{"question_content": "How will Iknow if Ihave TMJ and trigiminal neauralgia?I have the cracking sound and I get pain from mouth radiates to head and neck.", "question_id": "1453292"},
{"question_content": "Hve pain in shoulder/neck/jaw and arm & down in right breast!. Hve bad tennis elbow! do repetitive work with right side! feels like muscle pain pector?", "question_id": "650397"},
{"question_content": "Last two months symptoms: tight/tingling shoulders, tight/tingling neck, headache (band type), swollen head. Tmj w/swollen lymph nodes for last 2 wks?", "question_id": "1276986"},
{"question_content": "What causes a sharp 5 second pain from center of chest between breasts straight across to right chest/breast?feels almost electric.PCP says not heart.", "question_id": "1479585"},
{"question_content": "Jaw pain pain infront of ear pain im ear sharp pain  running up the side of my head and toothache neck pain Tmj? Or somethng serious?", "question_id": "1337981"},
{"question_content": "I have dull headaches which are now more sharp. I hear high pitched ringing in ears and also buzzing. I feel a sharp neck pain at base of skull. Could it be a TMJ flare up? What should I do?", "question_id": "514879"},
{"question_content": "Current smoker for 13yrs.  Intense burning sensation in my head and back last week and a half. Normal bloodwork. Swollen lymph nodes. Do I hv cancer?", "question_id": "1488295"},
{"question_content": "I have been getting a lot of neck pain and headaches. I passed it off as tmj. But i went to get a neck massage and i found out that I have a lump behind my ear and on my neck.What could it be?", "question_id": "753098"},
{"question_content": "Dull ache right side of throat when i lean my head towards my left shoulder have ONE swollen cervical lymph node also in right side of neck  viral?", "question_id": "1546128"},
{"question_content": "I have had sore throat for three days. I thought it was from my seasonal allergies, because the trees that bother me just bloomed. Now, I have noticed my left lymph node in my neck is swollen. Can that be from my seasonal allergies too?", "question_id": "392894"},
{"question_content": "I've had pain in my left shoulder/upper back for 3 weeks. Also, pain in my left upper arm, with some tingling/numbness. Massage helped some.  Ideas?", "question_id": "76269"},
{"question_content": "Dad had bad pain, at and below elbow (wrist, fingers). Neuro diagnosed with ulnar nerve entrapment. No improvement after 1 week. What to do for pain?", "question_id": "855176"},
{"question_content": "Starting day 4 of sore throat, much worse at night, side neck glands VERY tender, congested, no fever and good appetite. Should I bother to see a Dr?", "question_id": "1568545"},
{"question_content": "33 weeks pregnant with shortness of breath/difficulty breathing and numbness in my arm and shoulder. Shoul I be concerned?", "question_id": "1452159"},
{"question_content": "I fell 6 days ago landing on my  forearm by my elbow.  It bruised significantly. Now it is a burning pain w/ a lump by the bruise. Hand numb at times?", "question_id": "1125953"},
{"question_content": "Back surgery 6/3. 2 weeks later an infection. taking picc line antibiotic for 2  weeks with small draining area. now draining area is getting larger??", "question_id": "1393367"},
{"question_content": "I have an infection in my toe. I'm on two antibiotics. I've been on them for four days and no visible sign of healing. Should i go back to the doctor?", "question_id": "989914"},
{"question_content": "I sprained my ankle 4 days ago but yesterday it started bruising real bad and the bump of my ankle still hurts went to dr did an xray said it was just a sprain been taking ibprofuen put ice and keep it wrapped with an ACE bandage", "question_id": "396197"},
{"question_content": "Had 7 d  amoxicillin before my rct on infected tooth. Post rct, clindamycin causing bad heartburn. Is clinda stronger for infection. Can i go to amox?", "question_id": "514757"},
{"question_content": "Cut side of finger on top knckle 1wk ago. Itchy & raised like liquid is under it. Can't bend finger fully. Tiny amnt clear dischrge, no pain. Normal?", "question_id": "994969"},
{"question_content": "Ulnar sided wrist & hand pain. Pain, tingling, numbness in pinky & ring fingers. Pinky tremors when  when fingers are extended. What can this be?", "question_id": "1068395"},
{"question_content": "If you are immune compromised (ra/metho) and you have a root canal issue, would you take clindamycin if you were allergic to amoxicillin?", "question_id": "227183"},
{"question_content": "I have chronic pain in both my forearm, wrist, and hands for the last year after playing piano. No amount of rest has helped. No redness or swelling.", "question_id": "1224189"},
{"question_content": "Cbc normal, occasional low platelets. Hands and feet purple in cold red when hot. Itchy rash on neck, flushing, aches, tired. Which dr. to see?", "question_id": "1345086"},
{"question_content": "3 weeks ago foot broken per er. Got a cam walker but not ready to walk. Can I use my crutches? Foot is hurting since husband tried to move big toe.", "question_id": "980583"},
{"question_content": "I'm currently on Amoxicillin for sinusitis, can I drink coffee while I am on this medicine? I don't drink much in general, just one cup a day.", "question_id": "1443745"},
{"question_content": "I have been having constant numbness in my left arm andhand. My shoulder and neck had pain, but now i havenumbness in my arms and hands. What should I do?", "question_id": "311819"},
{"question_content": "Is there an over-the-counter or home remedy for a swollen, itchy eye lid? My left eye is swollen and has been for a week.  It itches too.  Well, my eye lid is itchy not my eye itself.  There isn't a knot or anything like that.  My eye itself isn't red or", "question_id": "407888"},
{"question_content": "I walk a lot my foot started hurtingunder the big toe at the side near the arch of foot when walking, doesn't hurt when touching it also throbs at night?", "question_id": "725808"},
{"question_content": "My bf & i are getting small faint red itchy bumps on our chests/stomachs after sex. What could it be?", "question_id": "1113475"},
{"question_content": "Chronic r arm/shoulder pain x6yrs. 2 wrist surgeries & radial nerve release gave zero relief. Current CT angio neck report said modest cervical spondylosis. Could this be the cause of my arm pain?", "question_id": "887424"},
{"question_content": "I feel a pressure behind my left eye, my upper left jaw feels funny, my cheekbones feel swollen and I have a headache and itchy gums. What should I do?", "question_id": "768837"},
{"question_content": "Pain in chest mostly left side. Pain can be dull or sharp . Rapid heartbeat. Pain in left  arm, neck and shoulder. My dr gave me Buspar for anxierty.?", "question_id": "499733"},
{"question_content": "I have noticed small red dots suddenly appering on my arms and upper chest/neck area. They do not hurt nor are they itchy. I am very paled skin.", "question_id": "795003"},
{"question_content": "Infected nose ring piercing, huge swollen right tonsil, sore throat, exhausted, bad headache. What shall I do?", "question_id": "6729289"},
{"question_content": "I have tingling and numbness in my right pinky finger and how it seems to be beginning in my shoulder and going down my right arm.  ?", "question_id": "80467"},
{"question_content": "For almost a month I have been having this vaginal discharge throughout the day, it does have a smell to it... Is this a yeast infection?", "question_id": "1164523"},
{"question_content": "I woke up with my right arm and hand swollen. Now, eight hours later, the swelling went down but there is burning sensation in my upper arm and it is ?", "question_id": "1246222"},
{"question_content": "Active 55 y/o, female, hiker,nonsmoker,surg history for choley L.ear & recent steroids(hearing loss)I have sudden swelling left head,(bite?), front & back ear. Pain jaw, neck . Bite area some redness .", "question_id": "1331723"},
{"question_content": "I've had a pain in my left shoulder. Low above my breast but below my collar bone. All day, for no apparent reason. Now its pulling in my neck?", "question_id": "1442728"},
{"question_content": "I feel pain in my left side of neck, like if a  vein is swollen, left collar bone pain everyday, left ear, left jaw, left shoulder, left varicocele?", "question_id": "1506731"},
{"question_content": "Have sever pain in my neck and shoulders that rums down my right arm into my hand. Now starting on left side. All after C4 & C5 neck surgery. ?", "question_id": "73340"},
{"question_content": "Sciatica for 3 mths, tingling in my legs and feet numbness in my big toe and achy hips for the past week. Mri showed nothing wrong? Whats wrong?", "question_id": "662997"},
{"question_content": "I have what's called cervical disc disease. I had a fusion on c5, C6 discs and it didn't fuse. I'm going back in for surgery next wednesday to redo the fusion. Is this something that can gradually go down my spine and leave me paralyzed?", "question_id": "261262"},
{"question_content": "After I ate breakfast this morning, my throat and inside my ears got really itchy and the back of my tongue had bumps on it. Allergies or food allergy?", "question_id": "136321"},
{"question_content": "What else can I do besides surgery that can help with pain due to lack of a meniscus? Most of  it was removed from my left knee 5 years ago.", "question_id": "261492"},
{"question_content": "What does the discharge of a yeast infection look like? And what does the discharge of bacterial vaginosis look like?", "question_id": "951269"},
{"question_content": "I do not have knee arthritis but a displaced meniscus root? Which I am thinking is a tear because I have clicking and locking of the knee joint? Help", "question_id": "768386"},
{"question_content": "I just had a cervial discectomy and fusion at C5 C6 recovery has been minimal how long before i can schedule a breast lift ?", "question_id": "303351"},
{"question_content": "What is this? Moderately severe disc and joint degeneration at C5-6. Mild disc dessication otherwise with minimal endplate spurring at C4-5 and C6-7. At C5-6 there is disc bulge and spur, mild inferiorly protruding broad-based disc material centrally.", "question_id": "404174"},
{"question_content": "How do I distinguish pain from my sciatica in both legs from a blood clot?I get scared because the pains I Get from hip to foot.Pain similar 2 dvt?", "question_id": "1382646"},
{"question_content": "Does mycolog II cream cure yeast infections or bacterial vaginosis?", "question_id": "85036"},
{"question_content": "Would MRI without contrast find DVT? I've had back of knee and calf pain. D-dimer and ultrasound came back normal, but veins in feet&leg are bulging.", "question_id": "1421721"},
{"question_content": "Had US to look for DVT.  Test negative.  Doc questioned arterial clot.  Advised to \"monitor\".  Symptoms worse.  Lost leg.  Test for arterial clot?", "question_id": "1551705"},
{"question_content": "I have superficial clot in my leg, can this turn into a dvt?", "question_id": "276022"},
{"question_content": "29/f.  Pain behind knee when walking or any type of exercise.  Been this way for a month.  Now pain in calf just started today?  Dvt?  N/s and no bc.", "question_id": "821006"},
{"question_content": "Can papillary muscle dysfunction be present with only a faint murmur, but no symptoms at all, no prior heart attack, normal echo & ekg?", "question_id": "918247"},
{"question_content": "Vaginal itching and burning after having a lot of sex. What is causing it? Could it be a yeast infection? How do i treat it?", "question_id": "1436740"},
{"question_content": "Had chest X-ray  showed tortuous  thoracic  aorta. I know  I have abnormal  EKG  also heart murmur. My father passed away at 54 sudden heart attack.?", "question_id": "507193"},
{"question_content": "Does itching abs burning in vagina without no odor be yeast infection.....It hurts to walk also.  How does rhis relate to having a std. R they linked.", "question_id": "979595"},
{"question_content": "I took Diflucan in January for a yeast infection, didn't have symptoms. I believe I have a yeast infection now. Is it to early to take Diflucan again?", "question_id": "1442582"},
{"question_content": "I am a 20 yr old male. suffer from  anxiety. Occasionally i have heart flutter feelings. They most common during /after sport game. had ekg. is it ok?", "question_id": "6744643"},
{"question_content": "What kind of doctor should I take my infant daughter to if she has a heart murmur?", "question_id": "220749"},
{"question_content": "Can a doctor hear the difference in heart murmurs?", "question_id": "558118"},
{"question_content": "My period late for 9 days, and yesterday i took urine pregnant test and came out negative. I never do intercourse, only fingering. 1 week after my ovulation day, i had brown spotting 4 day. Am i pregnant?", "question_id": "541016"},
{"question_content": "Can SVT Cause blood clots like AFib?", "question_id": "6740710"},
{"question_content": "Hi can a 16 year old girl get pregnant if she has had no sexual intercourses at all, she's got her period but her belly got bigger and breasts swollen", "question_id": "1162288"},
{"question_content": "Cardiac ct, stres tst,holter, cardiac echo all normal.feel tired w air hunger when walk, pain left blade hand.mild reflux,clear lungs.obese.reason?", "question_id": "1556807"},
{"question_content": "Blood work fine, echo came back normal EKG normal chest xray normal. Bp 93/63 hr 66.I still feel like I can't get enough o2...", "question_id": "1555578"},
{"question_content": "My periods are late. They ended on december 31st and i didn't get them in january. Me and my boyfriend did not have sex, but he rubbed his penis against my vagina. He didn't cum. Should i worry about getting pregnant?", "question_id": "1168667"},
{"question_content": "My EKG , holter (1900 pvc's) in 48 hours, cardiac us, nuclearmri/ct and stress test are all normal. I get on/off chest pain which radiates to my neck. Should i see a cardiologist? Family history.", "question_id": "522420"},
{"question_content": "I'm 21 and have had problems with angina-like pain all mylife. More recently, I have started getting palpitations and breathlessness. I have had ekgs, holter, echos, bloods and cardiac CT angiogram done. Have i left any bases uncovered?", "question_id": "798948"},
{"question_content": "Girl while body massaging inserted her finger/s in my vagina for 5 mins.What if she's HIV?Am really worried?Not pregnant, no periods since 50 days.", "question_id": "1568738"},
{"question_content": "I am 19 years old and 5'4\" tall. I have seven stones. I have had chest pain, fast heartbeat, shortness of breath evenwhile eating/talking and palpitations. I've had ecg, cbc, chest X-ray but could find nothing. What should I do?", "question_id": "926668"},
{"question_content": "My 19 year old has chest pain. The pain started in last august. He end up in emergency room. They told us they found nothing wrong with heart. He saw a cardiologist after that in august and december. The cardiologist did EKG and stress test. He told us my", "question_id": "393440"},
{"question_content": "Can a girl get pregnant if a boy first touches his penis, have some semen on his hand and then touch a girl's vagina with the same hand?", "question_id": "858287"},
{"question_content": "Can a holter monitor only be given by a cardiologist or even my primary doctor?", "question_id": "492807"},
{"question_content": "I have a strong vinegar acid smell discharge coming from my vagina can it be my birth control pills or high blood sugar level ? Or anything else ?", "question_id": "690837"},
{"question_content": "My butt has been itching lately. I shave. I noticed 2 bumps (not blisters) left side inbetween the butt and vagina on the outside. Itchy and painful. ?", "question_id": "1443764"},
{"question_content": "Can a girl be pregnant if she is virgin but penis get inside vagina half only in which penis got up and down around 8 times without releasing sperm ?", "question_id": "6719304"},
{"question_content": "Can a woman get pregnant from pre-cum or inserting sperm into her vagina with her finger if she's ovulating?", "question_id": "1548443"},
{"question_content": "Is it normal for me to have smelly sticky white stuff coming out of my vagina after i have sex , my vagina doesnt hurt or redness or itchy ?", "question_id": "1395684"},
{"question_content": "I have a pea sized bump on my upper inner thigh. It looks purple and bruised and is somewhat squishy. It popped and was filled with bright red blood.?", "question_id": "72496"},
{"question_content": "I think I'm having an allergy elated issue. I have small red hive - live bumps appearing all over my crotch area and between my upper thighs. male. The bumps are extremely itchy at night mostly and are about an inch apart mostly.", "question_id": "6706166"},
{"question_content": "Pain upper left near ribs. Fluttery on right near ribs. Nausea.Sensitive breasts.Pelvic discomfort/pain. Dark areas on areola.\n Negp 10 days ago?", "question_id": "94751"},
{"question_content": "After 1 beer or glass of wine, I get an itchy, red, raised rash covering my entire left hip and thig?", "question_id": "50958"},
{"question_content": "Had mammogram and ultrasound that confirmed tiny cysts in breasts. They are still there. What do I do now? Doctor missed one of them. I can feel both", "question_id": "484730"},
{"question_content": "I had a mammogram and ultrasound  recently  the outcome was negative  but dense (cyst) breast. Should i be concern?", "question_id": "929786"},
{"question_content": "Can I find out if a breast cyst / tumor is malignant through a breast ultrasound and mammogram?", "question_id": "237562"},
{"question_content": "My doctor dis a breast check and thinks I have a cyst.  Will this show up on a mammogram?  Will I need further tests?  Do cysts go away?", "question_id": "1464649"},
{"question_content": "I form lumps in my breast they are not a mass and one of them is not a cyst they done ultrasound and mammogram but it still scared me what is it?", "question_id": "287031"},
{"question_content": "Too young for a mammogram? Breast cancer runs in my family, and i'm really concerned about my own health. I'm only 17 - is it too early to get a mammogram?", "question_id": "370740"},
{"question_content": "I have very itchy skin all over; have had this for years now. Ihave no allergies. I scratch and my skin becomes red. I have itchy arms, legs, feet, hands, scalp and breasts. Help!", "question_id": "916664"},
{"question_content": "One nipple suddenly seems larger and I notice visible veins on that breast only.I'm only 39 and am not pregnant.Should I get a mammogram asap?Cancer?", "question_id": "1474506"},
{"question_content": "In the inside joint areas of my groin, there is like a damp, skin peeling like \r\nproblem, it hurts, itches, smells, has a yellowy colour. Comes back after thorough regular washing, not vagina or sti?", "question_id": "650840"},
{"question_content": "I have a slightly large bump (around the size of a penny/nickel) on my inner thigh/crotch region and its very sore. When i touch it its kind of hard. I originally though it was an ingrown hair until it started to grow larger and it dint go away for a few", "question_id": "6725711"},
{"question_content": "Allergic conjunctivitis?- itchy, dry eyes, alaway doesn't help. Cloudy vision. And swelling of conjunctiva. Ragweed. Hypersensitive for allergy shots.", "question_id": "1025291"},
{"question_content": "I have been taking gabapentin for 10 days now. I have been having dry, burning, itchy eyes for a cpl days now. Cld the gabapentin be causing this?", "question_id": "569977"},
{"question_content": "I'm 22 weeks pregnant my doctor found a hard unmovable lump in my breast and now i'm getting scaly and red marked skin. Could it be breast cancer?", "question_id": "633250"},
{"question_content": "I went to the doctor two days ago for sore throat and congestion, I was given amoxicillin but now I chest congestion, phlegm, and productive cough.", "question_id": "1464282"},
{"question_content": "My 3 year old has pink eye and the doctors office is closed is it ok to use clear eyes maximum itchy eye relief to help with it?", "question_id": "991499"},
{"question_content": "I have a lump on my breast getting bigger my doctor said its fat tissue not happy with his answer could it be cancer i'm scared it hurts when i push o?", "question_id": "950953"},
{"question_content": "My daughter is 15 when she was 13 she had doctors scan the lumps in breasts, it's been two years and they are still here. What are the chances that they have developed into cancer, and since to my knowledge they are still non cancerous could they go away", "question_id": "230021"},
{"question_content": "Fever/blood pressure spikes/red \"splotches\" sporadic on face/ears/neck/chest/arms. Now maybe herpangina in mouth? Other possible cause?", "question_id": "322153"},
{"question_content": "Now &  then on backs of arms i get lots of tiny bumps almost like a rash with no redness or itching they hang around for few days comes & goes causes?", "question_id": "921030"},
{"question_content": "I have had a pimple on inner left labia for 9 days. Not an std. Hasn't come to head. No opening in doctors. How to make it come to a head?", "question_id": "1433546"},
{"question_content": "Severe itchy nostil started with a runny nose from allergies. Now around outside and inside nostrils very itchy & rash. What will fix this?", "question_id": "1218864"},
{"question_content": "How long can a allergies last one nostril block for almost 3 months it alternate my ENT keeps saying allergies using nasal spray for 3 months now?", "question_id": "686697"},
{"question_content": "I have trouble breathing through my nostrils. I used 4-way nasal spray with menthol. They no longer make it. My nasal membranes swell.  What can I do?", "question_id": "263047"},
{"question_content": "Can infection cause red bumps back side of tongue by molars also hard lump inside tongue sore throat and neck irritation. Im 16 and worried of cancer!", "question_id": "979858"},
{"question_content": "I have mild rosacea, put some acne cream on my nose and cheeks, now it is burning and very red, guess my skin is sensitive, what can I use to soothe ?", "question_id": "641501"},
{"question_content": "What are my best options for treating atrophic and hypertrophic acne scars (boxcar and rolling, a couple larger ice pick ones)?", "question_id": "903194"},
{"question_content": "I have two lumps.1 on the cheek in upper mouth.Visible. Its soft and small.1 inside tounge.Can only feel by pinching.Im 16.Could it be oral cancer?", "question_id": "960223"},
{"question_content": "Can I use duac acne cream on my nose after rhinoplasty?", "question_id": "97644"},
{"question_content": "I have acne and scars. Is laser effective in healing thescars? Are there any side effects of laser?", "question_id": "63222"},
{"question_content": "I have two red bumps; one on each side of my tongue. I recently saw some other small bumps right to the back back of my tongue. What could this be?", "question_id": "940893"},
{"question_content": "I recently had a colposcopy due to a pap that showed hpv, with a cancer free result. I am in my 50's and wonder if getting an off-label gardasil vaccine is a good idea or a waste of money?", "question_id": "371754"},
{"question_content": "The back of my throat behind my tonsils have small whitish yellow bumps and my tonsils and back of mouth have small red veins everywhere. Concerns?", "question_id": "1572031"},
{"question_content": "The labia Minora area of my vagina is swollen and iching what is the possible problem and solution?", "question_id": "1425383"},
{"question_content": "Should I consider taking methadone if I have been on a pain contract for two years taking 40 mg vicodin daily?", "question_id": "35626"},
{"question_content": "I have cystic acne, and I have irritated blemishes. What can I do to get rid of the redness. I read that it might be ezc... I can't remember the name?", "question_id": "64873"},
{"question_content": "Suspect pregnant.Back/stomach pain, bleeding&fleshy tissue&thick blood  came out of vagina last night.See doc on sat.Can it be miscarriage?Help", "question_id": "945638"},
{"question_content": "I9 weeks pregnant. Pain in my left lower abdomen.Not sharp pain but consistent and sore to touch with some rebound tenderness. No blood. Ectopic?", "question_id": "1162979"},
{"question_content": "I am having parathyroid surgery tom'w. As someone who is still healing from an anal fissure, my biggest concern is post-operative constipation. Hints?", "question_id": "76324"},
{"question_content": "To get rid of acne redness, do I use ice wrapped in paper towel or paper towel dipped in warm water?", "question_id": "1425657"},
{"question_content": "ER doc said swollen foot, foot/toe pain is plantar fascia, ortho surgeon says likely morton's nueroma, ordered MRI. Worried about misdiagnosis/surgery?", "question_id": "1387876"},
{"question_content": "What are the reason for anal fissure and how it progress to pile and hemmorrids?Even patient haves reular fiber diet and good intake of water?", "question_id": "71796"},
{"question_content": "Big toe broken.One doc (podiatrist) says it's not displaced, the other (sports med surgeon) it is slightly. They agree in no surgery by now. Agree?", "question_id": "315046"},
{"question_content": "Can baking soda use for get rid acne?", "question_id": "491652"},
{"question_content": "Doc says there is approx: \"3 units of blood floating around in my abdomum.. Should i be worried? I had hernia surgery on 3/30, dr said it was about 3inches diameter, so pretty large. On 4/20 i went for a follow up w the surgeon and explained my complicati", "question_id": "408580"},
{"question_content": "I am having pain on my foot where my second toe on my right foot connects to my foot. Swollen also! I have been to the doc already should I go again?", "question_id": "178460"},
{"question_content": "While peri-colace sheet suggests taking at bed time to heal anal fissure& hemorrhoid, what best time for regular colace can be taken and how often/day?", "question_id": "1014295"},
{"question_content": "My doctor told me that I have CIN 4 cervical cancer. She has already done a LEEP and I believe that she said that she has got it all. However, she wants me to get a hysterectomy done. What should I do?", "question_id": "893239"},
{"question_content": "Do pediatricians treat hemorrhoids and anal fissures?", "question_id": "210701"},
{"question_content": "Is it true that rubbing vitamin E oil  onto acne blemishes and scars will make them go away and prevent future breakouts?", "question_id": "303855"},
{"question_content": "I had unprotected sex one time. I am negative for all stds, I'm wondering if there is a possibility I have warts, I got the 3 HPV vaccine shots. ?", "question_id": "1505806"},
{"question_content": "I have constipation 48 hours after getting a general anesthesia.I have taken stool softener, prunes, and water. Is there an otcsuppositor?", "question_id": "483778"},
{"question_content": "I have an external hemorrhoid that I'm treating. I found another bump closer to my vagina. Could this also be a hemorrhoid that's not on my anus?", "question_id": "1509066"},
{"question_content": "I get inflamed external hemorrhoids randomly once or twice a year where the vein bulges and becomes hard and painful for 2 weeks. Why & what to do?", "question_id": "1434930"},
{"question_content": "Right foot hurts on left side when I walk barefoot when sitting whole foot itches. Icyhot does nothing been going on for a week", "question_id": "263282"},
{"question_content": "I have a bump on the outside of my vagina that normally is filled with puss and i can pop. Tried to drain today and blood came out. What could this be?", "question_id": "949961"},
{"question_content": "My daughter tested positive for mono yesterday. how long has it been since she contracted the virus.  she doesnt seem to b overly tired but had the sore throat and swollen glands.", "question_id": "6732701"},
{"question_content": "The similarity and difference of hemorrhoids and varicose veins?", "question_id": "172531"},
{"question_content": "The inner side of my pinky toe on my right foot is swollen and white. It hurts and itches but no sign of pus. Thoughts?", "question_id": "578429"},
{"question_content": "91 year old male with pain on left side about hip level but towards the back.  No blood in urine.  Could this be a kidney stone on Coumadin and flomax.  He has a huge protate and does not hydrate enough.", "question_id": "381871"},
{"question_content": "I get painfully intense itch only on the middle toe of each foot.If the toe is dry, it is okay, but if it is sweaty, it itches. Its likeath-ft but it never spreads, always on the same toes. Theath-ft medicines are useless. Sometimes it is so badthat i wis", "question_id": "966097"},
{"question_content": "Itching burning redness swelling in toes only during winter months. Also tiny blisters and then peeling. Disappears in other seasons. What  is this?", "question_id": "239360"},
{"question_content": "The skin in-between my toes itches. The skin grows dies and can be peeled off. Underneath the dead skin is new skin that is very white and itches.?", "question_id": "272719"},
{"question_content": "I just had breast reduction today and they put me in oxycodone and a z pack I am very itchy i can't sleep my whole body itches can I take benadryl?", "question_id": "1262807"},
{"question_content": "I had sex with my boyfriend we used protection and my vagina itches inside. He also used his fingers on me. Could I be allergic to the condom or what?", "question_id": "6721474"},
{"question_content": "Doc said I had blood in urine and had symptoms of uti. Culture was normal. Does that mean blood is gone or does the culture not measure blood in urine?", "question_id": "1450157"},
{"question_content": "On metformin 500mg for month & 1/2 for pcos, & on birth control, started period but no other changes. need higher dose or give more time? yes Isln Rst", "question_id": "1568779"},
{"question_content": "No period for 3months, all pregnant symptoms, but neg blood test. Dr says to get ultrasound for ovarian cyst. Is possible to still be pregnant ?", "question_id": "839407"},
{"question_content": "I have an itchy rash looks like little ant bites. It's been 7 days. Thought it was poison ivy. Nothing is helping. I have scabs from scratching ?", "question_id": "6707975"},
{"question_content": "Is the occult blood stool sample an accurate method for testing for colon cancer and where can I get info?", "question_id": "121792"},
{"question_content": "How to treat my inflamed poison ivy! My entire body is covered in a warm raised rash! It's painful and itchy and I can't sleep without waking to itch?", "question_id": "6745119"},
{"question_content": "How likely is I to get colon cancer? 22 male I don't smoke or drink and no family history just a lack of appetite is that a main sign of colon cancer?", "question_id": "219031"},
{"question_content": "I had a tooth absess drained by my dentist 4 days ago. I still have a lump on the roof of mouth which is extremely painful. How long till it goes away?", "question_id": "537338"},
{"question_content": "Can a painless pea size swollen inguinal lymph node be a sign of a std? If so which ones and how Common is this? Anything to worry about?", "question_id": "1569286"},
{"question_content": "Im seeing doc in few days but im freaking out! I have a lump under the skin by clit on lips of vagina. it feels like a sm. ball inside when I touch it?", "question_id": "1387570"},
{"question_content": "Have small lump behind my r ear. Painful & lymph nodes in r neck swollen making neck hurt on the r. No other symptoms of infection. What is it? Er worthy?", "question_id": "725174"},
{"question_content": "Dark or bloody urine And dark stool And sore throat And back pain from the Two sides And abdominal pain And bloody gums after sex HIV syph gono chla n?", "question_id": "1407184"},
{"question_content": "Three swollen cervical lymph nodes all on left side of neck some ear pain doctor HS seen one of them says wait 2 month fbc normal should I be worried?", "question_id": "551372"},
{"question_content": "I have swollen lymph nodes in front of the ears and down the jaw. I also have a big lump on the cranium bottom left side. What can it be?", "question_id": "327130"},
{"question_content": "Hello Doc, on Saturday I hit my head on the corner of the wall, not to hard but it kinda hurts, I haven't had any symptoms of concussions, it just hurts where I hit my head. I'm a very paranoid person so I always think the negative.  What should i do? Go", "question_id": "1451368"},
{"question_content": "Can an ear infection cause swollen neck lymph nodes?", "question_id": "1389518"},
{"question_content": "I have neck pain, fluid behind ear, swollen glands in neck and cold sore all on the right side.  Dr. Put me on amoxil and steriods. Is this normal?", "question_id": "1273448"},
{"question_content": "Painful swollen lump in front of ear jaw from tooth abscess?", "question_id": "1023869"},
{"question_content": "I have a small white bump on my gum where my widom tooth used to be. The gum there is also swollen and my jaw and ear hurt. What could it be?", "question_id": "6623200"},
{"question_content": "I suspect I have a tooth abcess. My glands are swollen in neck and have ear and cheek aches. Started with diahorea and vomiting.", "question_id": "1034944"},
{"question_content": "I fell down my stairs 3 days ago and banged my head on the radiator. I still have a painful headache, feel dizzy, sick and very tired. Concussion?", "question_id": "560455"},
{"question_content": "I have a hard swollen lump on the top of my ear where it joins my head. It is very painful to squeeze, what is it? Is it cancer?", "question_id": "1111481"},
{"question_content": "Rear-neck/back pain for 2 mths, now less but get random daily tightness in front neck, face, jaw/teeth, arm tingling, headaches esp. When sitting long. Mostly gone when wake up and worsens gradually?", "question_id": "1230669"},
{"question_content": "Can chikenpox cause a swollen lymph node behind ear?", "question_id": "6648054"},
{"question_content": "I'm 47 with regular cycles. I had sex on the ovulation day. The day after, one day before my aunt flo was due, i got a lot of creamy cervical mucus. I feel tired, my breasts feel full and have mild cramps in the abdomen. Is this a sign of pregnancy?", "question_id": "795297"},
{"question_content": "Can untreated ear infection/tooth abcess/sinus infection/gum disease cause lymph nodes in left supraclavicular? Any possibility?", "question_id": "877739"},
{"question_content": "I have signs of pregnancy I've missed my period for 3 days now and I think I have a yeast infection. Could I be pregnant ?", "question_id": "1507456"},
{"question_content": "Swollen right supraclavicular node over 2 months. Gyno said go to ENT for biopsy but general Dr ordered neck ct scan. Which should I do? Ct then ENT?", "question_id": "6698028"},
{"question_content": "I am 20 years old.I have thyroid problem from the past 16 years.I do take thyroxine 100 mcg regularly.T3 & T4 are normal TSH >100.Suggest me.......", "question_id": "1014355"},
{"question_content": "I woke up with a swollen lymph node on the back left side of my neck. Quite sore and slightly painful?", "question_id": "182452"},
{"question_content": "Should i go to a doctor? Sunday night i closed my thumb in a car door, it bled, there's a cut about a CM long (horizontal) on my thumb nail. It throbbed all night and the next day it felt better but it's still swollen, it still hurts to touch it, and it t", "question_id": "397673"},
{"question_content": "Lymph node in neck, 2 in right armpit, 1in groin. Feel perfectly fine! Getting a biopsy on groin node, I'm 19, is it lymphoma? Would it show in biopsy", "question_id": "1408307"},
{"question_content": "Can I have lymphoma if I have one swollen tonsil (been like this 6 months) normal CBC no other swollen lymphnodes CT sinus and xray chest normal bad breath don't use tobacco?", "question_id": "1169044"},
{"question_content": "Abdominal MRI found a \"fluid filled gallbladder with no gallstones\" & a 1 CM cyst in liver-can it b cause of nausea, diarrhea, rt side pain for 3+ mos?", "question_id": "896864"},
{"question_content": "I got my gallbladder removed 8 weeks ago. Now, I suffer from intermittent nausea daily and moderate pain on the right side of abdomen. My liver/pancreas labs are normal. What should I ask my gastrointestinal doctor about? Could I have sphincter of Oddi?", "question_id": "767368"},
{"question_content": "Liver cancer stage 4 , lung cancer and spleen cancer with cirrhosis and hep c  can I take chemotherapy treatment to reduce tumor maker?", "question_id": "820591"},
{"question_content": "My left jaw is sore as well as the left side of my throat up to you ear. What is this?", "question_id": "700474"},
{"question_content": "When I was younger I needed drainage for my lymph nodes on my left groin area. I was around 2 years old. When I had my son at age 28 I had a blood clot in my left leg.  This year I have back surgery (spinal fusion) and my right leg is constantly swollen.", "question_id": "283022"},
{"question_content": "If you have cirrhosis of the liver does that increase your risk of  liver cancer?", "question_id": "185138"},
{"question_content": "I had a lumpectomy for breast cancer and also had chemotherapy as it was grade 3. Now, the doctors want me to have radiations and take tamoxifen, but i'm fed up with the treatment. What should I do?", "question_id": "492069"},
{"question_content": "Random swelling of lymph nodes. Lymph nodes on right jaw line swollen and painful! Doctor gave augmentin, went away...now back again. Any ideas?", "question_id": "1595390"},
{"question_content": "Can you survive with no treatment for small cell lung cancer that has moved to the brain my mom has 10 tumors?", "question_id": "675516"},
{"question_content": "If a breast cancer patient undergoes neo-adjuvant chemotherapy, how will she ever know her true nodal status?", "question_id": "56229"},
{"question_content": "Constipation after appendectomy, I have my appendix out 4.5 weeks ago and had bad abdomen pain, cramping, like washing machine, wind my stools are loke rabbit pellets would this be my issue for pains?", "question_id": "6734613"},
{"question_content": "Does lung cancer brain metastised tumors treated with the gamma knife extend survival if the tumors shrink and show no signs after a three month perio?", "question_id": "491428"},
{"question_content": "Is there any test that can be done to know whether the chemotherapy drugs for breast cancer stage 1 are working properly?", "question_id": "895688"},
{"question_content": "I am having laproscopic gallbladder surgery and want toknow if i will have to have a catheter? I am 43 years old and have a very small penis and this issue is causing me a lot of worry. Thanks.", "question_id": "376158"},
{"question_content": "Had a molar pulled, bone debrided and biopsied. Diag. Osteomyelitis.  7 days amoxicillan. Fluish, back of neck & jaw pain 2 weeks later. Gp gave 10 days augmentin  should I have iv? Is it in vertebrae", "question_id": "629290"},
{"question_content": "40 years old woman with chronic pain in left shoulder+ left breast pain becomes worse during  period and ECG+Echo are normal, is it breast cancer?", "question_id": "1599662"},
{"question_content": "Laproscopic gall bladder surgery 6 days ago; pain on right side from shoulder to kidney area, especially when breathing....should i be concerned?", "question_id": "6672350"},
{"question_content": "What can cause osteomyelitis in the jaw bone?", "question_id": "1547291"},
{"question_content": "Played volleyball tonight, my hr got up around 180, and i was having chest pain in my left breast for about 5mins, but i had an EKG yesterday that came out fine. Should i go to er?", "question_id": "693041"},
{"question_content": "I am a professional athlete and have a case of tonsillitis with a black tonsil and a little fever. I would like to know how long before I can exercise?", "question_id": "285849"},
{"question_content": "Had 100-102 fever for a day. 2 days later developed pain in throat with some minor swelling of tonsils. No other symptoms. Strep or tonsillitis?", "question_id": "6743038"},
{"question_content": "Can sore nipples and tender breast mean breast cancer or swelling in the breast? No period coming and not pregnant what is it?", "question_id": "65868"},
{"question_content": "I was bitten by blackflies on my shin and developed an itchy rash after 2 days. It's been 2 weeks & I have had headaches & a low fever. What now?", "question_id": "1425574"},
{"question_content": "28 male smoker raised bumps on hard palate tiny red dots in rough texture appearance red and white pigments any ideas. Not sore or painfull?", "question_id": "612066"},
{"question_content": "Is there anything inexpebsive that can be done for year round nasal allergies besides generic claritin, zyrtec, or allegra?", "question_id": "495735"},
{"question_content": "I have four small bumps on my scalp all at different regions. Its sore when i touch them but they are not red. Just raised bumps.  What are they?", "question_id": "1225614"},
{"question_content": "Yesterday went to doc for sore throat, cough and fever. Given meds including antibiotic. Today I have chest pain when cough. What can I do for it. ?", "question_id": "128217"},
{"question_content": "I have a lot of difficulty swallowing and pain in throat. I've had a CT scan of my neck, a barrium swallow, an ultrasound. If  it were cancer, would it have shown up?", "question_id": "286205"},
{"question_content": "Tiny red/pink bumps on roof of mouth on soft palate. These have been there for as long as I can remember but I just wonder if I should be worried ?", "question_id": "6708751"},
{"question_content": "I'm 18, ex smoker and hookah smoker. I have a lump in my throat, loss of weight and appetite. Dry tongue sore neck. Neck feels swollen. What is this?", "question_id": "940021"},
{"question_content": "My son had conjunctivitis around 6weeks ago with viral infection,runny nose,sore throat.he had lymph node at side of his neck and still has,is this ok?", "question_id": "1556117"},
{"question_content": "Can wisdom tooth cause tongue bumps? How to get rid of this?", "question_id": "1001588"},
{"question_content": "My 8 yr old child has been ill since 10/2010. diangosis mono, strep, flu, sinus, croup, pneumonia. Need a specialist, don't know what kind. Help! ?", "question_id": "72177"},
{"question_content": "I have a habit of picking around my gums with a tooth pick.  Now I have a red swollen and very sore gum, what can I do.  Could it be infected?", "question_id": "810951"},
{"question_content": "I had a periodontal cleaning on my front teeth nd a regular cleaning on the rest.. My gums are extremely swollen and very tender is this normal?", "question_id": "1533115"},
{"question_content": "I do have mild sleep apnea, does it cause these numbers ? Do not smoke, 42 age male\r\nrbc 5.78 hgb 17.9 hct 50.7 mpv 11.6 platelets 216 WBC 8.94 scared", "question_id": "754425"},
{"question_content": "I've had sweats, chills, feverish eyes, sinus headaches, lethargy, achey muscles and raw throat for over a month. Two weeks of amoxycillin hasn't helped either. What shouldi do?", "question_id": "980740"},
{"question_content": "I have mid upper back pain after i wake. I have had MRI and chest xray. If i had cancer would it of caught it?", "question_id": "329354"},
{"question_content": "I am 2 days late on my period, I have white discharge, a little cramps, sore nipples, acid reflux is acting up more out of no where, pregnant?", "question_id": "6743675"},
{"question_content": "I am a lung cancer servivor of 15 years I have had bronchitus since mid july I have had a chest xray and a cat scan and my lungs are fine my cancer treatment was surgery to remove top lobe of left lung and 6 and a half weeks of radiiation?", "question_id": "285513"},
{"question_content": "I am a 29 year old female and have been a smoker for 7 years. I have mid back pain near spine for months. I have had chest X-ray and 2 mri's, both clear. I am still scared itslung cancer. What should I do?", "question_id": "313637"},
{"question_content": "I just had an angio pulmonary cat scan with contrast to rule out a pulmonary embolism. Can that detect lung cancer? Chest xray normal. 42 years old.", "question_id": "1481160"},
{"question_content": "I have high ferritin, low vitamin d and high pth in my blood, i get nausa a lot and vomit,  i ache all over and have pins and needles in between my shoulder blades and in my neck & head I have phoasis ?", "question_id": "663980"},
{"question_content": "The result of my chest xray shows a suspicious nodular density overlying the left first anterior rib. Another nodular opacity is seen overlying the left 9th posterior rib is this means that my breast cancer already metastisis in my lungs? Do I have to und", "question_id": "261123"},
{"question_content": "If someone had stage 4 cancer and it spread to lungs and chest. Etc. Wouldn't a chest X-ray show something?", "question_id": "369601"},
{"question_content": "If RA is severe can you have multiple bone erosions in multiple joints causing widespread joint pain and morning stiffness?", "question_id": "1556061"},
{"question_content": "Had neck fusion in 2009.  I now have numbness in shoulder and neck pain.  Can't lift my head in bed either.  What's wrong?", "question_id": "1047289"},
{"question_content": "I am 53 years old. What does the following blood report indicate : WBC 8970,  RBC 5.7 , HAEMOGLOBIN 11.1 HAEMATOCRIT 36 MCV 63.5 MCH 19.6 MCHC 30.8?", "question_id": "1363877"},
{"question_content": "If I have a tooth infection or gum infection, how long could it take to spread to jaw and cause bone loss?  I have appointment saturday", "question_id": "1294490"},
{"question_content": "Female, 69, physically  very active, good health, with left knee pain and decreased range of motion.\r\nMri :complex medial meniscal  tear.\r\nSurgery only?", "question_id": "301747"},
{"question_content": "Bone or jaw poking out of my gum after tooth extraction weeks ago, im starting to have bad breath and its not really that much painful.What to do?", "question_id": "1187060"},
{"question_content": "Is there any link between breast cancer and lung cancer?", "question_id": "25020"},
{"question_content": "I feel something poking me on the inside of my gum after 2 weeks of getting a tooth extraction. Could this be bone forming there?", "question_id": "6653462"},
{"question_content": "How safe is tooth extraction for someone with osteoporosis? I've read that it increases the chances of breaking your jaw during the procedure, but by how much? I was diagnosed about two years ago, and my doctor says reclast has helped, but my bones are st", "question_id": "393508"},
{"question_content": "I have had four x-rays for my chest, one CT of my abdomenand one bone scan. I am worried whether I have an increased chance of developing cancer from this radiation.", "question_id": "799691"},
{"question_content": "I had a tooth extraction last Thursday. The root was fused to the bone. Walnut size lump on jaw line and pain, sometimes intense. ?", "question_id": "1546736"},
{"question_content": "Is it ok to chew gum, eat breath mints, or use mouthwash after wisdom teeth extraction?", "question_id": "802122"},
{"question_content": "I have an absesd tooth and have developed a lump on my jaw bone what could it be?", "question_id": "1229864"},
{"question_content": "Following wisdom teeth removal 6 weeks later gum not heeled and snot comin from wisdom extraction site also foul odor when leaning forward ?", "question_id": "748975"},
{"question_content": "My gums (left side) at the very back of my mouth hurt. (bhind last molar)  wisdom teeth pulled years ago. What else may be causing this irritation?", "question_id": "157844"},
{"question_content": "Numbness in right arm and leg for 2wk. Started as tingling w/migraine, then numb, and now expanding and quite painful. Is it really just a migraine?", "question_id": "1600296"},
{"question_content": "Burning pain in right buttock, accompanied by burning that picks back up a few inches below my knee and runs down the outside of my leg, through the heel. Presents only with sitting. Possible causes?", "question_id": "621977"},
{"question_content": "I have bad chest pain and left arm pain when I have bad palpitations. I have had all tests to rule out heart. Please tell me it's anxiety symptoms.", "question_id": "1246108"},
{"question_content": "Swollen gum around wisdom tooth which i picked with my finger. Blood and pus came out. I've got white spots on both sides of my throat, what should I do?", "question_id": "1118008"},
{"question_content": "The tendon under my kneecap has been hurting lately the pain goes down to my shin, my knee get swollen  and makes my whole leg ache.  How to help?", "question_id": "1246196"},
{"question_content": "I feel pressure in the back of my right leg. There is swelling behind my knee and a mild tingling in my right foot. Whatshould i do?", "question_id": "322121"},
{"question_content": "I have MS. I've been having bad shin splints and my left leg from knee down is swollen for weeks. What is this?", "question_id": "1497249"},
{"question_content": "I have a torn meniscus in my knee. Do I have to have surgery?", "question_id": "193998"},
{"question_content": "Can you give advice on reoccuring symptoms like balance issues, blurry eyes, nerve and muscle pain, fatigue, incontinence issues, dizziness?", "question_id": "6720138"},
{"question_content": "For a long time now i. Have had almost consten pain in my legs feet sometimes in my hands & arms I can't stand my legs and toes to be touched.  ?", "question_id": "233847"},
{"question_content": "Will a knee replacement get rid of arthritis pain?", "question_id": "65967"},
{"question_content": "I have a thymoma and I've been havin chest pain with numbness and tingling in my arms I know its not a panic attack like everyone says so what could be?", "question_id": "64884"},
{"question_content": "I have bad GERD and its making me feel breathless. It has got to be the GERD because PFTs/Chest Xray/CT lung/Echo/Echo stress okay/ started omprazole. When will breathlessness go away? It is making me anxious.", "question_id": "992799"},
{"question_content": "On 9/21 i fell & landed on knee. Pain 7/10 slightly swollen & bruised. Most painful when bending & going up n down stairs. Should i see a dr?", "question_id": "992488"},
{"question_content": "I have been suffering from chest pain for 15yrs! it began when i was 18 years old. I was told its anxiety/costo. Pain is reproducible and no breathlessness, but HDL is155. My stress echo was perfect 5 years ago. Thoughts?", "question_id": "351267"},
{"question_content": "Can a pinched nerve cause pain, numbness and tingling in both hands and tingling in both lower legs? I had a broken vertebrae a few years ago ?", "question_id": "1012282"},
{"question_content": "I get sharp pains in my knee while running. What could this be?", "question_id": "888225"},
{"question_content": "Should i get crutches i sprained my ankle i can walk as long as i don't bend it at all it hurts even like that its badly bruised and swollen what todo?", "question_id": "800071"},
{"question_content": "Sick, extreme fatigue, high platelet, potassium, severe anemia, low tsh, low acth 3.Goiter on thyroid.Hashimotos is in question&addison's.Whats wrong w/me?", "question_id": "961368"},
{"question_content": "I twisted my ankle 4 weeks ago. It is still swollen, throbs a lot and hurts on the pad when i walk. No x-rays were done but i was told its a sprain. How long will it take to heal?", "question_id": "323045"},
{"question_content": "I am in cross country and for the last 5 days the bone under my  ankle bone hurts and is swollen and bruised. What could it be. And also it hurts to walk and run on it.", "question_id": "258588"},
{"question_content": "I'm online now. Type your question here   large knot on side of calf but has the whole leg swollen from knee down\n?", "question_id": "1533994"},
{"question_content": "I have been told that I have a baker's cyst behind my left knee.  My ankle and leg are very swollen.  Is this a part of the baker's cyst.  Remedy?", "question_id": "360335"},
{"question_content": "Rolled over on my ankle while playing soccer yesterday. Today still really painful to move/walk, red, swollen. Should i get it checked?", "question_id": "759167"},
{"question_content": "I sprained my ankle over 3 months ago in rugby i'm playing again it is still swollen bruised i can run but it i turn it wrong it hurt is it ok to play?", "question_id": "951254"},
{"question_content": "My mom fell on her knee down the stairs 5 days ago a lot of bruisingand swelling around the ankle no pain is it broken?", "question_id": "1126785"},
{"question_content": "3 years go=broken ankle & screwes sprained my akle playing tennis in auguet and it's still swollen. Had me in a cast. Is this normal?", "question_id": "1152008"},
{"question_content": "Are there any iron supplement that I can take that wont make me constipated?", "question_id": "87546"},
{"question_content": "Should i cancel my orthopaedic appt weds for my ankle sprain? In air cast on crutches sore but not swollen.No breaks but xray showed s space", "question_id": "1037897"},
{"question_content": "I was playing golf step in hole and twisted my ankle and my knee popped too. Now it hard on to walk with little pain. What should I do.", "question_id": "876893"},
{"question_content": "Do iron supplements cause constipation in infants?", "question_id": "336994"},
{"question_content": "I have been using iron supplements, for the past 4 years, only recently, constipated and bloated, low due to childbirth, stress,not absorbing frm food?", "question_id": "1555259"},
{"question_content": "Can I get high blood pressure or low with anemia?", "question_id": "1463155"},
{"question_content": "How long can swelling last with a sprained ankle? It's 6 weeks and still swollen. Had x-rays and no breaks or fractures.", "question_id": "905483"},
{"question_content": "Will intense pulsed light (ipl) technology get rid of my varicose veins? I have a few large reddish-purple varicose veins on the inside of my left leg just lower than my knee. They bulge out and are so ugly. I feel uncomfortable wearing shorts or skirts t", "question_id": "382760"},
{"question_content": "I have left arm pain radiates to hand. Hand veins bulge more than right. Blood clot? Negative d dimer. Ultrasound on legs came back negative as well.", "question_id": "693829"},
{"question_content": "History of DVT w/vinecava filter tightness above knee w/swelling in calf and ankle itching behind the knee and aching on lovenox 120 sub Q2x day new clot?", "question_id": "623769"},
{"question_content": "I have a spot under my left leg half way from my knee to my waist that keeps filling with blood and then pops. I never feel pain or discomfort. What could it be?", "question_id": "570200"},
{"question_content": "I am recovering from a DVT in the calf area and was wondering if a tubular bandage or the like would help to control the swelling behind my knee?", "question_id": "608440"},
{"question_content": "I sprained my ankle a couple of weeks ago. There is now swelling in my calf and it is painful. Should i be worried about dvt?", "question_id": "328035"},
{"question_content": "Is it typical to prescribe fluconazole 200mg one time dose for vaginal yeast infection? Is this dosage too high?", "question_id": "1061857"},
{"question_content": "My period was supposed to start four days ago but I got on and off spotting for two days with bad cramps, diarrhea and nausea. I got two pregnancy tests done three days ago and they were negative. What could it be?", "question_id": "950035"},
{"question_content": "No period in 2 months, spotting, cramping, extremely bloated, back pain, nausea, negative pregnancy test. could i be pregnant?", "question_id": "1433045"},
{"question_content": "R/o cellulites non specific, unclear/undefined margins now has been developing on right leg in 2 areas apprx 2-3\" wide. The left leg started at ankle and is all the way up mid tibial area. \r\nPt brief?", "question_id": "565591"},
{"question_content": "A 33 year old woman has been suffering from tummy cramps, nausea, burping, flatulence, headache, diarrhea, pain on theleft side of the back, and sharp chest pain, from the last 3 days.What should be done?", "question_id": "882018"},
{"question_content": "Is it necessary to get a leg amputation at the mid-calf because of a very bad ankle fracture that wouldn't heal?", "question_id": "290861"},
{"question_content": "Congestive heart failure is causing  clear fluid to leak through my skin on both legs from ankle to mid-calf.   Treatment?", "question_id": "607448"},
{"question_content": "I walk 2 miles every night and my left ankle to mid shin really aches. What is this and how can I make it stop?", "question_id": "241454"},
{"question_content": "Have pain in the back of my knee, no swelling redness or warmth, haven't injured it; could it a blood clot or dvt?", "question_id": "1028792"},
{"question_content": "My vagina has been itching mainly lips & clitoris. I noticed a white discharge inside the lips. Could this be a yeast infection? Or just from shaving?", "question_id": "120558"},
{"question_content": "15 weeks after ankle sprain. Can do toe raise, heel raise, stand one foot. Inner ankle pain when walk. Doc said muscle n ligament tight. What to do?", "question_id": "637814"},
{"question_content": "Have 3 auto-immune probs. 4/2013 got cellulitis (r) hand.  Antibiotics resulted in  c-diff. Had blood draw this week, also canning tomatoes. (r)hand red, hot, swollen headed almost to elbow. Md or er?", "question_id": "887769"},
{"question_content": "My period is late, and I had unprotected sex on one of my fertile days. What's the chances I'm pregnant? When should I take a pregnancy test?", "question_id": "1493446"},
{"question_content": "Yesterday, both feet & ankles swollen, this mng, only the entire right leg swollen, left leg normal, no pain, just swelling.", "question_id": "1101954"},
{"question_content": "I have 'dropfoot, nervdamage left leg, always pain, ortopedicshoes.I walk on toe.The bone on top of foot \"bigger, bump.Foot smaller.What do about \"bump?", "question_id": "161426"},
{"question_content": "Burning top of foot near big toe where stretched nerve years ago after broken ankle. Also bone spurs in ball of foot. What to do for burning pain?", "question_id": "272182"},
{"question_content": "My period is 5 days late (day 42). I have headaches, cramps, pink spotting and faint bfp that turned always bfn. Bbt chart is crazy, tending to low. Could i be pregnant?", "question_id": "843662"},
{"question_content": "I have a really tight ligament in my foot, and my doctor said it was rare and almost everytime i walk my ankle cracks. What would be good for the pain?", "question_id": "589583"},
{"question_content": "Been deal wit a \"sprained ankle\" goin on 3 months i hav nerve damage  & i hav a ligament out everytime i bend my toes i get sharp pain go up my leg?", "question_id": "342545"},
{"question_content": "Sudden swelling after 1st pregnancy in ankles & feet been 15 mos now walking is alnost impossible. Burning stabbibg pain when stand or sit to long?", "question_id": "611278"},
{"question_content": "I'm 28. Had ankle surgery 3 wks ago. My foot & toes get swollen. When swelling goes down, toes look wrinkled. How do I get rid of wrinkles? Permanent?", "question_id": "6646549"},
{"question_content": "My feet hurt all over. When I get up in the morning I can't walk on them. Now my ankles are swollen.?", "question_id": "245326"},
{"question_content": "Could my peripheral neuropathy be an indication i had diabetes and was unaware of it before pregnancy? For the last two years I have experienced pain in my hands and feet. When i recently became pregnant it seemed to worsen. I saw my neurologist at 8 week", "question_id": "403804"},
{"question_content": "I have Diabetes. My blood sugars run around 200. I have neuropathy in my feet but all of a sudden my big toe is just throbbing from the joint up. Why?", "question_id": "1402291"},
{"question_content": "I had pink spotting and cramping last night. This morning i have diarrhea and lil neaseau what is going on im not due to have period until dec  im 41?", "question_id": "1568648"},
{"question_content": "I have my missed period, frequent urination,white discharge but negative pregnancy test. What could be the problem?", "question_id": "6719474"},
{"question_content": "Does it matter if my wife and I only use one sexual position (missionary position) to try and get pregnant?  We've been off birth control since july 2010 and are on the 2nd cycle of clomid.  The docs have found nothing wrong with us yet.", "question_id": "233703"},
{"question_content": "Dr.Is it true that ladies who get pregnant by self/home insemination will get birth defects/menatally/physicaly retarded babies?", "question_id": "902729"},
{"question_content": "I have small fiber neuropathy and i'm taking 900 mg of gabapentin for my foot pain. Not helping at all. What's the chance the max dose will help?", "question_id": "753152"},
{"question_content": "I have upper arm tingling  and some leg tingling only on right side  been six with carpal tunnel. However hands don't hurt or feel numb?", "question_id": "558017"},
{"question_content": "I woke up twice this past week withy fingers tingling numb on right hand.  Took a few minutes to go away. I've read it's possibly carpal tunnel?", "question_id": "1569235"},
{"question_content": "I get joint flare ups of wrist, elbow and fingers and on both sides, only in summers. The blood test came positive for RA but it was dismissed as a non-standard test. Why does it happen?", "question_id": "868652"},
{"question_content": "I have symptoms of trigger finger in both hands, left more than right, carpal tunnel in left hand and numbness and tingling in the left.  What can cau?", "question_id": "979458"},
{"question_content": "25 yo female, no family history of colon cancer - bloating ulq, sometimes with pain. No blood in stools, changes in stools from constipation to softer stools. Gas, loss of appetite. Colon cancer?", "question_id": "1026363"},
{"question_content": "My breast been feeling itchy \\u0026#40;Nipples\\u0026#41; I've been having the mild cramps I've been takin naps more than offend VERY thirsty 10DPO could I be pregnant?", "question_id": "1433005"},
{"question_content": "Hand & wrist numbness - can joint pain be a symptom of carpal tunnel syndrome?", "question_id": "226299"},
{"question_content": "Emg study for puffy feet reads . A fairly symmetric mild sensorimotor peripheral neuropathy with  primarily axonal loss features.  What are options?", "question_id": "506813"},
{"question_content": "Are thin wrists, and long thin hands on a male a symptom of carpal tunnel syndrome or something else?", "question_id": "32062"},
{"question_content": "Scared of cancer lumpy breast and numbness and tingling feels like there is movement in my breast right one itchy armpit and yellow discharge help?", "question_id": "1294070"},
{"question_content": "Thinking I have als.  Doctor did emg just right arm and neck and said I have nothing to worry about. No signs of ALS or peripheral neuropathy. ?", "question_id": "1168741"},
{"question_content": "I have eds3 And hypermobile neck. 2 days my neck has been tight and hurting , head feels pressured and sometimes I feel spacey. Dangerous or annoying?", "question_id": "1452735"},
{"question_content": "I am diagnosed with irregular periods  . Can i take metformin/ Clomid to treat irregular periods but i don't want to conceive now.Is there any side ef?", "question_id": "1164134"},
{"question_content": "Lump on left breast for 4 weeks - feels on surface, not \"in\" breast. No visible skin changes, or changes to breast shape. Also enlarged left supraclavicular lymph node. Only 23 - is cancer possible?", "question_id": "960820"},
{"question_content": "Low grade fever stomach cramps vomiting diarrhea.  No shakes or headache. Got drunk on friday and saturday. Symptoms started last night. Alcohol w/d?", "question_id": "688324"},
{"question_content": "I had endoscopic carpal tunnel surgery a week ago.  The base of my hand still feels hard and a little numb, is this normal?", "question_id": "264675"},
{"question_content": "I wanted to know if u think I had a panic attack. The other day when me and my husband were fighting my throat felt like it was closing and my chest was hurting and I couldn't hardly breath.?", "question_id": "190670"},
{"question_content": "I had carpal tunnel surgery on both hands. I am in my 8th week recovering. I still feel very sore at the base of my hand. Is this normal?", "question_id": "349447"},
{"question_content": "Five weeks ago, i had an endoscopic carpal tunnel surgery .I still feel a tightness in my wrist and forearm. It causes a lot of discomfort. What should I do?", "question_id": "294684"},
{"question_content": "Is it normal to have tingling in my hands after carpal tunnel surgery?", "question_id": "34159"},
{"question_content": "I keep getting sharp shooting pain in my right wrist  i was diagnosed with carpal tunnel in 2010 and had the surgery already what could it be doing ?", "question_id": "1274510"},
{"question_content": "My cheek bone is kinda swollen I think I have a tooth abcess and I have a sinus infection im taking Clindmaycin should I be worried?", "question_id": "1331719"},
{"question_content": "For about a week now I have had a red lump on the side of my left breast. It hurts when I touch it. What could it be?", "question_id": "92335"},
{"question_content": "4 days in a row i've woken to bad headaches and body aches.  So bad i can't sleep.  During the day i take tylenol and ibuprofen and it helps.", "question_id": "1238249"},
{"question_content": "Breast implants with left breast burning pain with lumps or mass surrounding the breast closest to armpit what could it be?", "question_id": "1038063"},
{"question_content": "I have a large lump on my left breast scheduled for a mam on friday, tonight I had sharp stinging pains radiating across my breast and nipple ?", "question_id": "279840"},
{"question_content": "Why are markers left in the chest of previous breast cancer patients? I can see them on X-rays and do they hurt?", "question_id": "1382978"},
{"question_content": "I have headache on the right side of my head mostly at the temple area, and now it's at the top and behind of my head and my eye all on my right side?", "question_id": "614800"},
{"question_content": "Are aspirin, acetaminophen and ibuprofen equally good at preventing heart attacks?", "question_id": "35732"},
{"question_content": "I've had a productive cough for nearly 6 months, as well as chest pain on left side of breast bone. 27 year-old male, who smoked for a year. Cancer?", "question_id": "674186"},
{"question_content": "I had a breast lump checked using ultrasound and told results said unremarkable but get a baseline mammogram.  I did this back in may.  I didn't hear back,  so i  figured everything fine.  All summer i noticed left breast swollen more than right.  End of", "question_id": "314732"},
{"question_content": "I'm a 17 year old male and I have a little lump under my left nipple, it hurts a little when i apply pressure on it, do I have male breast cancer?", "question_id": "793286"},
{"question_content": "Had a mammogram and ultrasound of breast confirming benign lump. Told its just a lymph node - just concerned as i know breast ca can spread here?", "question_id": "619002"},
{"question_content": "I have two lumps on my right breast. Went to doctor and will have a diagnostic mammogram done but in 5 weeks?", "question_id": "53661"},
{"question_content": "I found breast lump mammogram shows fibroadenoma but i read in the report axillary lymphnodes mildly enlarged and mostly reactive what does this mean ?", "question_id": "1114058"},
{"question_content": "I have an abcessed tooth, the swelling in my face hasn't gone down yet and they prescribed me penicillin and hydrocodone yesterday.. How long ?", "question_id": "1509032"},
{"question_content": "I had a lump in my left breast about 7 months ago and i had a mammogram the doctor said it was nothing lately it has enlarged significantly ?", "question_id": "633858"},
{"question_content": "My daughter has 104, 03  of fever. I gave her ibuprofen and acetaminophen but it doesn't drop. Should i take her to the emergency room?", "question_id": "530305"},
{"question_content": "33 yrs old, axillary swelling, family history of breast cancerbefore 40. Doctor suggests mammogram. Should I hold off on xrays? Are there better tests?", "question_id": "1312795"},
{"question_content": "How can you tell a normal lump under a guy's nipple vs. A symptom of male breast cancer?", "question_id": "145564"},
{"question_content": "What could breast lump that does not show on a mammogram or a sonagram be?", "question_id": "199898"},
{"question_content": "If a CT scan shows a breast lump and the mammogram does not should another test be performed?", "question_id": "24978"},
{"question_content": "Are dense breasts a problem? My doctor sends me to do mammograms every year. But I am afraid of too much radiation! is this a problem?", "question_id": "602251"},
{"question_content": "Pain upper left side under rib cage just below left breast. Mammogram, x-ray, CT scan, colonoscopy and urine all fine. Help.", "question_id": "694806"},
{"question_content": "Mammogram necessary?  7 PET/CT  scans, 1 CT w/ dye, 1 chest CT w/o dye and abdominal MRI in last 26 months. All clear.  Do I need a mammogram this year? Been 2 1/2 yrs Age 63 small breast. No concerns", "question_id": "1312966"},
{"question_content": "Can a CT chest scan show if you have a tumor or any lumps, mass large lymphnodes around the breast area ? If the test was ment to look at the lungs ?", "question_id": "1403864"},
{"question_content": "Do CT scans of the chest/ abdomen in teen males cause breast cancer?", "question_id": "507930"},
{"question_content": "My 2 yr old grandson started running a fever this afternoon and it is staying around 103 even after meds and tepid bath. He has had motrin and tylenol and my daughter put him in the bath..Fever remaining around 103 should she take him to er..He is not com", "question_id": "372806"},
{"question_content": "If I have had surgery for a bleeding ulcer in my stomach is it possible that it may start bleeding again?", "question_id": "64554"},
{"question_content": "Do I have a ear infection? Itchy ears, popping ears from blowing my nose too much.  I also have a runny/stuffy nose (itchy nose). What can it be? No other symptoms.", "question_id": "6683424"},
{"question_content": "1 yr old. Runny nose, cough, teething. Fever for 3 days range 98-102. Tylenol and ibuprofin help. Still plays, eats and drinks. What to do?", "question_id": "756582"},
{"question_content": "Is \nndication to use aspirin in venous thrombosis?", "question_id": "1026800"},
{"question_content": "Can anyone tell what this mean please?\"breast tissue is heterogeneously dense, which may obscure detection of small masses\"", "question_id": "871039"},
{"question_content": "1 yr old on day 5 of runny nose, cough, very lethargic & lack of appetite. First 2 days fever was high (104). Now it's low (99.5). Ped said don't worry? Had mmr+prevanar shots monday. Still not playing.", "question_id": "1179819"},
{"question_content": "How to tell if my breast milk is drying up? I have been nursing for 17 months and my nipples are getting sore because my daughter is sucking so hard.", "question_id": "1531822"},
{"question_content": "I have very dense, cystic breasts. I just had my yearly digital mammogram and it was inconclusive. Should I write my will?", "question_id": "149922"},
{"question_content": "My daughter has a fever and cough combination can she take Tylenol and Nyquil or Robitussin?", "question_id": "1346401"},
{"question_content": "Mammo 7 yrs ago showed microcalcifications 1 breast. 18 mon of followups benign no change. No mammo since Jan '10 re colon cancer tx. 7 PET/CT since 2012 w last one 10/13. All clear. Scared. Worry?", "question_id": "1423724"},
{"question_content": "Does inflammatory breast cancer look like a 4mm circular sore that's been there for over a month and has new skin growing over top? I'm nursing.", "question_id": "755941"},
{"question_content": "My wife had a mammogram over a year ago. Had small calcification. Now has grown through skin draining smelly fluid. She won't go to dr. What is it?", "question_id": "645153"},
{"question_content": "Can you have a normal clinical breast exam , but have a MRI show cancer? How often does that happen ? I have a cousin that had cancer in her late 20's", "question_id": "812709"},
{"question_content": "Is it likely that I have breast cancer if the doctors took a mammogram, then an ultrasound, then a breast mri?", "question_id": "250771"},
{"question_content": "11 week old had 2 month shot. Doc said give tylenol for pain and fever. Can i give her  infant motrin also. Since I have some all ready have some.", "question_id": "1247215"},
{"question_content": "Fever 2 days ago, coughing, taking Mucinex for cough, allegra for allergy, is it ok to take 2 tylenol for back pain with these other meds?", "question_id": "674358"},
{"question_content": "Can you determine breast cancer with an MRI with contrast?", "question_id": "750466"},
{"question_content": "A 2 year old is on the second day of off and on fever (100/101). There is chest congestion, occasional cough, not cranky, still active, decreased appetite and is drinking well. I am worried now?", "question_id": "338218"},
{"question_content": "What type of breast cancer that cause the breast to swell and cause under the armpit to have a painful lump? And does that mean the cancer has spread", "question_id": "1045316"},
{"question_content": "I have a lump in my left breast that feels about the size of a plum pit. I have no symptoms of breast cancer, but could it still be it?", "question_id": "330453"},
{"question_content": "I have u lump in my right breast, is it ?. I went to the doctor a few months ago for blood work, if i had cancer it would have showed up. Right?", "question_id": "647898"},
{"question_content": "Found a lump on my left breast near the armpit. Is this breast cancer?", "question_id": "656562"},
{"question_content": "I have a lump about the size of an olive between my armpit and breast and im scared . My maternal grandmother also has terminal cancer. I'm 23 yrs old?", "question_id": "616524"},
{"question_content": "I have lumps in my armpits that don't seem to go away. I am only 19 and feel like breast cancer only happens to older people. What could it be?", "question_id": "488619"},
{"question_content": "Family history lung cancer before 50. I'm 32 former smoker. Good age for low dose CT screen? I do not fit current screening requirements. Studies say I have 80% increase lc risk, scared!", "question_id": "1227640"},
{"question_content": "Worried about cancer.  Dr. Recommended an abdomen pelvis CT scan with contrast because of lower right pain that came up clean.  It was a 10msv dose. Is 10msv a lot and should I be worried? Thanks", "question_id": "994786"},
{"question_content": "Do I have to wait until my radiation treatments are over before i can get breast reconstruction? I wanted to get immediate breast reconstruction after my mastectomy, but my doctor says i need radiation and recommended i wait. Why?\n\n.", "question_id": "403102"},
{"question_content": "Armpit lump pain, family history of breast cancer. Can it be seen or biopsied?", "question_id": "185500"},
{"question_content": "Could an abdominal/pelvic CT scan without contrast (ordered for ureteral stones) detect ovarian cancer also?", "question_id": "253216"},
{"question_content": "I finished my treatment for breast cancer and had a bilateral mastectomy in february. I just found a lump on my rib cage on the same side as the cancer. Could it be cancer?", "question_id": "332929"},
{"question_content": "I have to make a decision on whether to have my ovaries removed during a hysterectomy and do not know what to do.  My mom died of breast cancer.", "question_id": "878099"},
{"question_content": "What would the usual treatment be for a breast cancer of 5mm dcis with 1mm foci grade 3?", "question_id": "868096"},
{"question_content": "Can dcis breast cancer be caused by stress?", "question_id": "25539"},
{"question_content": "Pelvic/Transvag sono on 8/22 showed partially ruptured ovarian cyst with small amount of free fluid. Would this cause bloating and abdominal fullness?", "question_id": "1483176"},
{"question_content": "Should stage 1 breast cancer patients with no lymph node involvement generally receive chemo?", "question_id": "25022"},
{"question_content": "Left forearm dull achy pain x2 weeks. Try to massage it, tender muscles. No injury/trauma. Not severe, no need for tylenol just annoying. Bone cancer?", "question_id": "1305817"},
{"question_content": "I was told my mom had dcis and it was negative. No chemo . Can you have triple negative breast cancer with dcis? Or is the negative something else?", "question_id": "809781"},
{"question_content": "Is there any oral maintenance medicine fot her2  breast cancer after finishing the herceptin?", "question_id": "287780"},
{"question_content": "Can an infant (1~12 months) take tylenol or Advil when having fever?", "question_id": "59929"},
{"question_content": "What is the function of HER2/neu and how is it related to breast cancer?", "question_id": "1356661"},
{"question_content": "I'm er+ pr- and her2+, but been told I have triple negative breast cancer. What is that?", "question_id": "185511"},
{"question_content": "What is a less toxic more natural alternative to chemo therapy for breast cancer treatment ?", "question_id": "340253"},
{"question_content": "I had lumpectomy for breast cancer then had to have chemo now drs want me to have radiotherapy   i don't want to have anymore treatment  should i?", "question_id": "489698"},
{"question_content": "Stg 4 liver mets, breast cancer. On 4/15 got- 650, gpt 350, bilirbn 18.\r\nNow got- 390, gpt 190, bilirbn 24.\r\nOn herceptin, carboplatin, linezolid, cipro.\r\nWhy bilirbn increasing while gpt/ got improving?", "question_id": "751281"},
{"question_content": "My breast cancer came back after 13 years - has radiation and chemotherapy improved since then?", "question_id": "39358"},
{"question_content": "Can you get genital herpes by touching inanimate objects someone with a cold sore has touched and then touching yourself after?", "question_id": "1423917"},
{"question_content": "Is it safe to give an 8 month old baby Infant  Tylenol every day during teething to help with teething pain & discomfort? Baby's weight is 18 lbs.", "question_id": "1443751"},
{"question_content": "Can femara (used for breast cancer) have gum bleeding as a side effect ?", "question_id": "677974"},
{"question_content": "My mother had a breast cancer surgery 3 months ago and is now taking arimidex. She has lost about 2kg of weight. Any problems?", "question_id": "960175"},
{"question_content": "What could cause upper abdominal pain and mid back pain?  I've been on a picc line for antibiotics to cure a staph infection for the past 5 weeks.", "question_id": "925737"},
{"question_content": "ALT is 63, AST normal range. I am obese, high triglycerides, bad eating, and pretty \nsedentary. Diet and exercise to get levels down? Any supplements you would recommend in addition? I hear the liver is resilient, responds well to lifestyle changes.", "question_id": "6765565"},
{"question_content": "How soon after breast reduction surgery can you begin taking phentermine on average?", "question_id": "650507"},
{"question_content": "White coating on tounge red sore on tongue near tonsil neck pain and hard lump on gum under and jaw pain  any ideas ?", "question_id": "521306"},
{"question_content": "I just took 2 Tums about 15 mins ago, but I am still feeling the burning and itching in my throat and my stomach is still tight.. I started having a panic attack when I felt the acid reflux in my throat so I took a half of my .5mg Xanax that I have prescr", "question_id": "1582467"},
{"question_content": "My daughter has a runny nose how much infants Tylenol can I give her she is 10 months weighs 23 lbs.", "question_id": "1446049"},
{"question_content": "How much pain will I have after male breast reduction surgery? I need to go back to work as soon as possible, but i can't be on heavy-duty pain meds. Will the pain after male breast reduction surgery be manageable with aspirin or aleve?\n\n.", "question_id": "403082"},
{"question_content": "I have pain on my tounge feels like a sore throat but when I put my finger on the back of my mouth on the tounge there are bumps that hurt what is it?", "question_id": "1430262"},
{"question_content": "Is combined tamoxifen plus hormonal therapy better for breast cancer in pre or postmenopausal women?", "question_id": "186519"},
{"question_content": "My mother has a breast cancer, now she has fever with 38.7° and last monday she has done first cycle of chemioterapy. Could she take paracetamol?", "question_id": "1519715"},
{"question_content": "Have had burping/reflux excessively for several months, Nexium reduced acid, not burping. Burning stomach pain between meals, negative h pylori, 22 year old male. Terrified its stomach cancer?", "question_id": "856626"},
{"question_content": "My 3.5 years old son has severe allergies. Particularly in spring time, swollen eyes, stuffy nose, ichiness allover, rashes on his hands. Solution?", "question_id": "118630"},
{"question_content": "I have been having some serious bleeding from the gums I have gingivitis and I have recently noticed red itchy bumps on roof of mouth....gingivitis??", "question_id": "6698566"},
{"question_content": "Can a CT  scan be wrong in metaststic breast cancer to the lung if the pt is on on chemotherapy and breast cancer was stage 2 grade 3 at diagnosis?", "question_id": "333825"},
{"question_content": "Is stage 2 breast cancer treatable with radiation and chemo, or will I need surgery?", "question_id": "39348"},
{"question_content": "I HAD SURGERY FOR BREAST CANCER A LUMP REMOVED. WILL I have to have radiation ?", "question_id": "1532348"},
{"question_content": "Does radiation after breast cancer surgery hurt? And what does it do to the body?", "question_id": "959817"},
{"question_content": "How strong is the link between HRT and breast cancer? Maternal grandma is bc survivor and was diagnosis after being on HRT for many years.", "question_id": "344770"},
{"question_content": "Could my immune system still be compromised 2 years after chemo and radiation for stage 1 breast cancer?  I seem to get sick a lot now.", "question_id": "568790"},
{"question_content": "Should i be afraid to start methotrexate for my ra?  I can't fully close my right hand.  I don't want to lose my hair.  I was diagnosed 5 months ago.", "question_id": "762722"},
{"question_content": "I have a new tiny lump in scar from breast cancer surgery, is this a recurrence?", "question_id": "673982"},
{"question_content": "Can I take vitamin d while on chemotherapy for breast cancer?", "question_id": "68582"},
{"question_content": "Will a CT scan show gallstones/ other gall bladder problems as well as stomach ulcers? What about a urine and blood test?", "question_id": "1244987"},
{"question_content": "I am a survivor of breast cancer and my mother died of ovarian cancer. I have been experiencing a lot of bloating, constipation and weight gain. What should I do?", "question_id": "364820"},
{"question_content": "My period came on two weeks late and I had unprotected sex . I always threw up and Been having lower back pains and headaches w/ tender breast.prego?", "question_id": "1548550"},
{"question_content": "Could you get ovarian cancer if you don't have family history and you never had breast cancer early.?", "question_id": "500036"},
{"question_content": "Normal ct, neuro did physical exam, thinks i don't have ms. I have tingles(buzz), hands/feet, stiff extremeties, ears pop, a lil lightheaded, tension in hea?", "question_id": "288617"},
{"question_content": "3 days ago I bad tooth pain& all my gums have gone white , now I have chills sweats no appetite throbbing jaw feel sick fast heart white line in cheek?", "question_id": "6733204"},
{"question_content": "Should i get a 2nd oppinion over the last 31/2 weeks I have had all my teeth pulled so i can get dentures, this past week i had my bottoms pulled and today is day 6 and my lower gums are tender of course but the problem is I have two areas on the right si", "question_id": "399621"},
{"question_content": "Sore swollen and throbbing gums. Small lumps in cheek at jaw line one on either side.", "question_id": "1215194"},
{"question_content": "My child has several allergies, eczema and asthma how can I help?", "question_id": "62456"},
{"question_content": "I have pcos. I've been takeing prenatal vitamins and fish oil. Can the prenatal vitamins make my breast sore?", "question_id": "1139176"},
{"question_content": "Swollen cheek, jaw and gum on left side. Dentist has provided me with amoxicillin and metronidazole. No toothache... What's wrong with me?", "question_id": "1216531"},
{"question_content": "My 2 year old boy has asthma and eczema. He has rashes all over his body which irritate him. Can an allergist help with this condition? Is it apt to see one?", "question_id": "152377"},
{"question_content": "I get badly swollen face and horrible bloating before my period accompanied by horrible mood swings and breast tenderness. How can I get rid of it?", "question_id": "490631"},
{"question_content": "I need to get my wisdom teeth removed. The dentist gave me amoxicillin and metronidazole. I read that metronidazole cures vaginosis. How will it help?", "question_id": "1375690"},
{"question_content": "When is it physically possible to become pregnant after labor and is breastfeeding mixed with norqd pills good birth controls?", "question_id": "938589"},
{"question_content": "Wisdom tooth extracted 2 months ago. Immediate pain in next tooth .Now intense and in 2 others. On amoxil but pain even worse.Seen dentist 3 times ?", "question_id": "280280"},
{"question_content": "My three year old girl has some kind of eczema (itchy skin and rash). What kind of doctor should I take her to see to save my time and money and get best result for my girl, a pediatrician, a dermatologist, a family doctor, a hospital, or someplace else?", "question_id": "388057"},
{"question_content": "I have asthma and what test should I be doing to know what triggers me, is it dust , flowers or maybe I have allergy to some food.", "question_id": "1284500"},
{"question_content": "A family friend had an infection in her wisdom teeth , amoxicilin 500 mg capsule was prescribed by her dentist .Now she has rash on the face is it ok?", "question_id": "794800"},
{"question_content": "My 4yo has a \"barking cough\". 3x today I have given albuterol/atrovent nebs for wheeze. Cloudy drn from nose after 3days clear. 99.5 temp go in when?", "question_id": "55601"},
{"question_content": "My asthma seems aggravated by my post nasal drip. Can't seem to clear my throat entirely. Bad allergies, chronic sinusitis. Will sudafed help?", "question_id": "856157"},
{"question_content": "Had 2 wisdom teeth pulled. Is is safe to take ibuprofen 600mg 5 times a day and amoxicillin 875 every 12 hours and hydrocodon 7.5-325  as needed 4/6 h?", "question_id": "1201374"},
{"question_content": "I had a baby 5 months ago now still have a little milk when check for it with stomach and back cramps and nausea what dies that mean an I pregnant aga?", "question_id": "1550687"},
{"question_content": "Antibiotics good for tooth infection other than augmentin/amoxicillin for my knowledge? Seeing dentist soon", "question_id": "6690220"},
{"question_content": "What can I do to reduce my anxiety at night and calm my racing heart so i can get back to sleep?", "question_id": "500648"},
{"question_content": "Remedies for a deep congested cough? Went to doctor, had chest X-ray and it was normal. Dr said bad bronchitis. 20mg of prednisone & advair. What else can I do to get rid of this cough?!?!", "question_id": "1122814"},
{"question_content": "Augmentin or amoxcillin better for tooth infection?", "question_id": "996027"},
{"question_content": "I have an infection that keeps coming back from broken teeth. I need to see a dentist but can't get in right away. Im on augmentin. The 4th med so far.", "question_id": "856728"},
{"question_content": "I have small airway disease, not asthma, which means I have problems getting air out of my lungs.  Is this restrictive or obstructive? The doctor didn't put me on any treatment.", "question_id": "993665"},
{"question_content": "Mom 50- frequent bronchitis since winter with dry cough- constantly losing voice keeps going to ER for breathing treatment, no history smoking xray negative keeps needing prednisone/inhaler, is this serious?", "question_id": "1309307"},
{"question_content": "Can I have IV augmentin if tablet based (3/day 500/150) doesn't work on tooth infection even after 7 days?", "question_id": "6690108"},
{"question_content": "Took augmentin for 7 days then clindamycim for 7 days based on oral surgeon recommendation, still have tooth infection, what's next? See doc soon. Tks", "question_id": "6698061"},
{"question_content": "In just under 3 days I have taken, 12 paracetamol, 16 ibuprofen, 16 codeine and 12 amoxicillin tables. Due to an abscess on my tooth. Should i be ok?", "question_id": "694788"},
{"question_content": "What other options will my doc give me if steroid & rescue inhalers aren't helping asthma?", "question_id": "1440631"},
{"question_content": "Just got splints taken out after rhinoplasty and septoplasty. Is it normal if I have a constant runny nose and septum hurts really bad?", "question_id": "835756"},
{"question_content": "I had septoplasty surgery done about 8 months ago for my deviated septum. If my nose is grabbed, hit, etc. Can it be re-deviated?", "question_id": "1122173"},
{"question_content": "Can I take my Coumadin at the same time as drinking alcohol?", "question_id": "43951"},
{"question_content": "Hi doc my son 8 years old had asthma attack and still have cough for a week now. Had muscle pains on his right leg . Having fever at night, what is it?", "question_id": "1485032"},
{"question_content": "My ENT said he is going to remove a bone spur from my septum during septoplasty/ turb reduction. How common is this spur and will it make surgery hard?", "question_id": "1037691"},
{"question_content": "For several months I have terrible abdominal pain, and yellow, slimy liquid stool-but never feel like I am emptying completely.I have no gallbl. Or app.", "question_id": "699912"},
{"question_content": "Whats a nasal valve collapse? how does it relate to my deviated septum and chronic sinus infections? will septoplasty correct or is it separate op?", "question_id": "1331035"},
{"question_content": "Pulse 206, BP 190/100, faint, dizzy, sweating, loss of appetite, joint pain, muscle weakness. 18 yrs of age?", "question_id": "1442112"},
{"question_content": "Dizziness, nausea heartburn peeing frequently cloudy urine period for 3 months lowerback aches. movement in abdomen when Laying down neg. pregnancy?", "question_id": "1335703"},
{"question_content": "I have bumps on the outside of the lip of the vaginal area. Itis not painful and has no pus inside but soft tissue. But the vaginal area is itchy. What should I do?", "question_id": "309583"},
{"question_content": "I had my period on 8th nov and ovulation on the 23rd. I had unprotected sex on the same day. I started having cramps six days later. What are the chances that i'm pregnant?", "question_id": "1075556"},
{"question_content": "Small bump on lining of bottom lip. It is not painful, itchy, or tender. It isn't a cold sore. What could it possibly be.", "question_id": "1127225"},
{"question_content": "At what level of blood pressure would cause headache vision symptoms?", "question_id": "1094190"},
{"question_content": "Whats the best way to get rid of acne, I've tried benzoyl peroxide, and monodox, and every OTC thing I can find?", "question_id": "58077"},
{"question_content": "Pretty sure I've had measles shots, just in case, am I out of the woods if no fever,cough,runny nose,red eyes 15 days after very low risk exposure?", "question_id": "1392856"},
{"question_content": "Acne scars, how to get rid of the little holes u see up close, and active acne?", "question_id": "98135"},
{"question_content": "6 yr old boy small red rash all over looks like hives, now has fever of 103, joint pain, swelling & pain in eyes, rash changed and spread, what is it?", "question_id": "1184278"},
{"question_content": "My son has a running nose, coughing chest congestion. He is 15 months old. Has had RSV pnemonia twice.", "question_id": "1306802"},
{"question_content": "Could you contract HSV if someone licked their fingers then fingered you? No sign of cold sore noticed on mouth, and how fast would you get symptoms?", "question_id": "1432534"},
{"question_content": "My husband just got a cold sore and touched my 2 month old son on the hand after flossing. My baby often puts his hands in his mouth. Can he get it?", "question_id": "284369"},
{"question_content": "4 yr old with no fever and normal behavior but has some yellowish eye drainage and nasal congestion. Antibiotics or let his immune system work?", "question_id": "692953"},
{"question_content": "i have a lump in the back of my head on the lower right side it's been there for a month I've been dizzy having neck pain & eye pain. Should I worry?", "question_id": "1598262"},
{"question_content": "Hi dr. If a person has has had hsv-1 for 1 year and hsv-2 for 13 years can they get whitliw finger.   I had dr up another account but could not sign?", "question_id": "1159090"},
{"question_content": "Accidentally picked up my friend' drinking bottle, only put my lips on the bottle, i didn't drink of it. She has oral herpes, do I have hsv-1 now?", "question_id": "1031692"},
{"question_content": "I have been stuffy, sneezing, coughing, watery eyes runny nose and sore thrat all day. I have taken nyquil. Now I am having sharp chest pain. Why?", "question_id": "516498"},
{"question_content": "I don't have allergies but I do have allergy like reaction (including nasal congestion) to dust, smoke, scents, etc. Did that cause my dark circles?", "question_id": "181946"},
{"question_content": "I have a small patch of little blisters above my clitoris in my pubic region, there extremely sore and burny. Faithful partner can't be an STD. Help?", "question_id": "1430436"},
{"question_content": "Fell off horse 2 days ago, not sure if I hit my head. S/S: headaches(short, come&go), dizziness&nausea. Head injury symptoms or from my fractured rib?", "question_id": "6748810"},
{"question_content": "I hit my head hard on my car as I was getting in! Real bad headache today and little dizzy/off balance is this normal or should I go to ER ?", "question_id": "1391182"},
{"question_content": "Had a d&c 7 weeks ago, got a negative pregnancy test 11 days after, got 1st period lasting 4 days 12 days ago, but am now getting 5 positive tests clear blue says 2-3 weeks since conception? Confused", "question_id": "762293"},
{"question_content": "So i got tested negative for hsv-2 IgG blood test after 7 weeks of possible exposure. How reliable are these results? I tend to get red bumps every time i shave. I keep thinking it is herpes.", "question_id": "1236516"},
{"question_content": "Should I take amoxicillin for salmonella?", "question_id": "73217"},
{"question_content": "Took a home pregancy test and was negative. Planned parenthood said she was positive. Her doctor said she was negative pregnant test (urine). Confused?", "question_id": "546802"},
{"question_content": "What causes bleeding behind the eye ? He's having blood transfusions, he ran out of red blood cells, no high blood pressure, no hiv, and no diabetes", "question_id": "395354"},
{"question_content": "Does the same virus that causes genital herpes cause cold sores?", "question_id": "1008"},
{"question_content": "I've been really dizzy lately. There are times where i try to get up and it feels like something is pushing me back down and my head aches badly. Help?", "question_id": "994842"},
{"question_content": "I've been having a strong head ache at the back of my head. It does not make me dizzy but when it happens it's hard for mm to focuse on things.", "question_id": "597641"},
{"question_content": "Can an intradural 1cm peripheral nerve sheath tumor on left side of thecal sac at L4 cause relative weakness in left leg, periodic aching in left leg, and increased coldness/ischemia in left foot?", "question_id": "991354"},
{"question_content": "Pelvic MRI for pain and complications following tvt bladder sling removal and infections revealed an enhancing .7 mm lesion in thecal sac of l4.  What follow up is needed, if any?", "question_id": "949332"},
{"question_content": "After my palm caught my fall, I have a swollen thumb, scrape at the bottom of the thumb and a tender thumb. The fall happened five hours ago. Should I see a doctor?", "question_id": "55402"},
{"question_content": "I've been experiencing extreme pain in my foot and it feels as though I have a giant rubberband around my ankle. My foot is throbbing and swelling up. The pain is also in my hand. What should I do?", "question_id": "944055"},
{"question_content": "I  am feeling fatigue, occasionally dizziness swelling of calves&ankles., occasionally leg cramps. Heart cath was good, leg circulation test was good what could be wrong", "question_id": "279807"},
{"question_content": "What should I expect for breast augmentation recovery time? How long does it typically take to recover from a breast augmentation? How long is it likely i would be unable to go to work if I am on my feet all day and how long do people tend to be sore?", "question_id": "371252"},
{"question_content": "Blood test at 9 weeks less than 0.6 hcg, negative hpt, two positive ovulation tests. Am I pregnant?", "question_id": "1354626"},
{"question_content": "Suffering from migraine, palinopsia, vertigo, nausea, painful joints, fatigue, dry mouth with burning tongue, swollen salivary glands and throat.help ?", "question_id": "1404653"},
{"question_content": "Is my thumb broken or are some nerves damaged? I play softball and everytime i hit a slash appears on my thumb and my webbed part of my hand. I had severly hurt it a year ago and my whole thumb was bruised and swollen. It has always been bigger than my ot", "question_id": "381866"},
{"question_content": "Swollen lymph node under tongue along floor of mouth for over two years. Dentist said not a salivary gland and to get biopsy. Should I be concerned?", "question_id": "6674582"},
{"question_content": "I have a scaphoid fracture, but I am starting to get numbness in my thumb. What can I do?", "question_id": "34398"},
{"question_content": "I have dizzy spells nausea and sore head on left side?", "question_id": "484577"},
{"question_content": "Migraines nausea fatigue diarrhea sharp stomach pains inner trembling loss of appetite. Began 5dys ago after vertigo in shower/vomiting. Period in 2wk?", "question_id": "1443822"},
{"question_content": "Should I have my gallbladder remove? I have been diagnose with gallstones.  I’m not vomiting, nor do I have fevers or chills, but I have some discomfort on my stomach, burning on the right side which wraps around my back and pressure on my lower abdominal", "question_id": "394481"},
{"question_content": "I have missed my periods and no pregnancy blood test negative for my beta hcg. What othet test i can do to rule out my missed period reason.", "question_id": "644348"},
{"question_content": "I have been diagnosed as having gall stones, how long do I have until my gall bladder has to be taken out? I had an attack involving vomiting and rapid bow movement with sevier pains in my abdomen so i went to the emergency room while i was out of town. T", "question_id": "399101"},
{"question_content": "I'm 6 weeks pregnant, my progesterone was 28.5 and it dropped to 18.9, my hCG levels are normal still, from 221 to 641. Why my progesterone levels dropped? Am i at high risk to loose my baby?", "question_id": "1308847"},
{"question_content": "My son and I have had diarrhea for the the last 6 months. Wehave stomach cramps and our stomachs are bloated. I had it first, then my son used my tooth brush and he got it. Whatshould i do?", "question_id": "502879"},
{"question_content": "I had a miscarriage 4 months ago, i'm still not better. My estrogen is 25 & progesterone -5 prolactin 159 CBC normal. Hcg negative &fshn 3.3.? Suggestions please?", "question_id": "238820"},
